keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  F294, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM4_CH5_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F294u)

/** \\brief  F298, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM4_CH5_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F298u)

/** \\brief  F284, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH5_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F284u)

/** Alias (User Manual Name) for GTM_ATOM4_CH5_CTRL.
* To use register names with standard convension, please use GTM_ATOM4_CH5_CTRL.
*/
#define	GTM_ATOM4_CH5_CTRL_SOMP	(GTM_ATOM4_CH5_CTRL)

/** Alias (User Manual Name) for GTM_ATOM4_CH5_CTRL.
* To use register names with standard convension, please use GTM_ATOM4_CH5_CTRL.
*/
#define	GTM_ATOM4_CH5_CTRL_SOMC	(GTM_ATOM4_CH5_CTRL)

/** Alias (User Manual Name) for GTM_ATOM4_CH5_CTRL.
* To use register names with standard convension, please use GTM_ATOM4_CH5_CTRL.
*/
#define	GTM_ATOM4_CH5_CTRL_SOMI	(GTM_ATOM4_CH5_CTRL)

/** Alias (User Manual Name) for GTM_ATOM4_CH5_CTRL.
* To use register names with standard convension, please use GTM_ATOM4_CH5_CTRL.
*/
#define	GTM_ATOM4_CH5_CTRL_SOMS	(GTM_ATOM4_CH5_CTRL)

/** \\brief  F2A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM4_CH5_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F2A4u)

/** \\brief  F2A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM4_CH5_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F2A8u)

/** \\brief  F2AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM4_CH5_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F2ACu)

/** \\brief  F2A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM4_CH5_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F2A0u)

/** \\brief  F280, ATOM Channel ARU Read Address Register */
#define GTM_ATOM4_CH5_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F280u)

/** \\brief  F288, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH5_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F288u)

/** \\brief  F28C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH5_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F28Cu)

/** \\brief  F29C, ATOM Channel Status Register */
#define GTM_ATOM4_CH5_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F29Cu)

/** \\brief  F310, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM4_CH6_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010F310u)

/** \\brief  F314, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM4_CH6_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F314u)

/** \\brief  F318, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM4_CH6_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F318u)

/** \\brief  F304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH6_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F304u)

/** Alias (User Manual Name) for GTM_ATOM4_CH6_CTRL.
* To use register names with standard convension, please use GTM_ATOM4_CH6_CTRL.
*/
#define	GTM_ATOM4_CH6_CTRL_SOMP	(GTM_ATOM4_CH6_CTRL)

/** Alias (User Manual Name) for GTM_ATOM4_CH6_CTRL.
* To use register names with standard convension, please use GTM_ATOM4_CH6_CTRL.
*/
#define	GTM_ATOM4_CH6_CTRL_SOMS	(GTM_ATOM4_CH6_CTRL)

/** Alias (User Manual Name) for GTM_ATOM4_CH6_CTRL.
* To use register names with standard convension, please use GTM_ATOM4_CH6_CTRL.
*/
#define	GTM_ATOM4_CH6_CTRL_SOMC	(GTM_ATOM4_CH6_CTRL)

/** Alias (User Manual Name) for GTM_ATOM4_CH6_CTRL.
* To use register names with standard convension, please use GTM_ATOM4_CH6_CTRL.
*/
#define	GTM_ATOM4_CH6_CTRL_SOMI	(GTM_ATOM4_CH6_CTRL)

/** \\brief  F324, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM4_CH6_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F324u)

/** \\brief  F328, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM4_CH6_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F328u)

/** \\brief  F32C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM4_CH6_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F32Cu)

/** \\brief  F320, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM4_CH6_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F320u)

/** \\brief  F300, ATOM Channel ARU Read Address Register */
#define GTM_ATOM4_CH6_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F300u)

/** \\brief  F308, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH6_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F308u)

/** \\brief  F30C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH6_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F30Cu)

/** \\brief  F31C, ATOM Channel Status Register */
#define GTM_ATOM4_CH6_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F31Cu)

/** \\brief  F390, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM4_CH7_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010F390u)

/** \\brief  F394, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM4_CH7_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F394u)

/** \\brief  F398, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM4_CH7_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F398u)

/** \\brief  F384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM4_CH7_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F384u)

/** Alias (User Manual Name) for GTM_ATOM4_CH7_CTRL.
* To use register names with standard convension, please use GTM_ATOM4_CH7_CTRL.
*/
#define	GTM_ATOM4_CH7_CTRL_SOMI	(GTM_ATOM4_CH7_CTRL)

/** Alias (User Manual Name) for GTM_ATOM4_CH7_CTRL.
* To use register names with standard convension, please use GTM_ATOM4_CH7_CTRL.
*/
#define	GTM_ATOM4_CH7_CTRL_SOMC	(GTM_ATOM4_CH7_CTRL)

/** Alias (User Manual Name) for GTM_ATOM4_CH7_CTRL.
* To use register names with standard convension, please use GTM_ATOM4_CH7_CTRL.
*/
#define	GTM_ATOM4_CH7_CTRL_SOMP	(GTM_ATOM4_CH7_CTRL)

/** Alias (User Manual Name) for GTM_ATOM4_CH7_CTRL.
* To use register names with standard convension, please use GTM_ATOM4_CH7_CTRL.
*/
#define	GTM_ATOM4_CH7_CTRL_SOMS	(GTM_ATOM4_CH7_CTRL)

/** \\brief  F3A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM4_CH7_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F3A4u)

/** \\brief  F3A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM4_CH7_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F3A8u)

