keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  F3AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM4_CH7_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F3ACu)

/** \\brief  F3A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM4_CH7_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F3A0u)

/** \\brief  F380, ATOM Channel ARU Read Address Register */
#define GTM_ATOM4_CH7_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F380u)

/** \\brief  F388, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH7_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F388u)

/** \\brief  F38C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH7_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F38Cu)

/** \\brief  F39C, ATOM Channel Status Register */
#define GTM_ATOM4_CH7_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F39Cu)

/** \\brief  F84C, TOM TGC0 Action Time Base Register */
#define GTM_ATOM5_AGC_ACT_TB /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB*)0xF010F84Cu)

/** \\brief  F844, ATOM AGC Enable/Disable Control Register */
#define GTM_ATOM5_AGC_ENDIS_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL*)0xF010F844u)

/** \\brief  F848, ATOM AGC Enable/Disable Status Register */
#define GTM_ATOM5_AGC_ENDIS_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT*)0xF010F848u)

/** \\brief  F858, ATOM AGC Force Update Control Register */
#define GTM_ATOM5_AGC_FUPD_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL*)0xF010F858u)

/** \\brief  F840, ATOM AGC Global control register */
#define GTM_ATOM5_AGC_GLB_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL*)0xF010F840u)

/** \\brief  F85C, ATOM AGC Internal Trigger Control Register */
#define GTM_ATOM5_AGC_INT_TRIG /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG*)0xF010F85Cu)

/** \\brief  F850, ATOM AGC Output Enable Control Register */
#define GTM_ATOM5_AGC_OUTEN_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL*)0xF010F850u)

/** \\brief  F854, ATOM AGC Output Enable Status Register */
#define GTM_ATOM5_AGC_OUTEN_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT*)0xF010F854u)

/** \\brief  F810, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM5_CH0_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010F810u)

/** \\brief  F814, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM5_CH0_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F814u)

/** \\brief  F818, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM5_CH0_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F818u)

/** \\brief  F804, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH0_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F804u)

/** Alias (User Manual Name) for GTM_ATOM5_CH0_CTRL.
* To use register names with standard convension, please use GTM_ATOM5_CH0_CTRL.
*/
#define	GTM_ATOM5_CH0_CTRL_SOMI	(GTM_ATOM5_CH0_CTRL)

/** Alias (User Manual Name) for GTM_ATOM5_CH0_CTRL.
* To use register names with standard convension, please use GTM_ATOM5_CH0_CTRL.
*/
#define	GTM_ATOM5_CH0_CTRL_SOMC	(GTM_ATOM5_CH0_CTRL)

/** Alias (User Manual Name) for GTM_ATOM5_CH0_CTRL.
* To use register names with standard convension, please use GTM_ATOM5_CH0_CTRL.
*/
#define	GTM_ATOM5_CH0_CTRL_SOMS	(GTM_ATOM5_CH0_CTRL)

/** Alias (User Manual Name) for GTM_ATOM5_CH0_CTRL.
* To use register names with standard convension, please use GTM_ATOM5_CH0_CTRL.
*/
#define	GTM_ATOM5_CH0_CTRL_SOMP	(GTM_ATOM5_CH0_CTRL)

/** \\brief  F824, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM5_CH0_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F824u)

/** \\brief  F828, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM5_CH0_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F828u)

/** \\brief  F82C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM5_CH0_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F82Cu)

/** \\brief  F820, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM5_CH0_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F820u)

/** \\brief  F800, ATOM Channel ARU Read Address Register */
#define GTM_ATOM5_CH0_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F800u)

/** \\brief  F808, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM5_CH0_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F808u)

/** \\brief  F80C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM5_CH0_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F80Cu)

/** \\brief  F81C, ATOM Channel Status Register */
#define GTM_ATOM5_CH0_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F81Cu)

/** \\brief  F890, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM5_CH1_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010F890u)

/** \\brief  F894, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM5_CH1_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F894u)

/** \\brief  F898, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM5_CH1_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F898u)

/** \\brief  F884, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH1_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F884u)

/** Alias (User Manual Name) for GTM_ATOM5_CH1_CTRL.
* To use register names with standard convension, please use GTM_ATOM5_CH1_CTRL.
*/
#define	GTM_ATOM5_CH1_CTRL_SOMS	(GTM_ATOM5_CH1_CTRL)

/** Alias (User Manual Name) for GTM_ATOM5_CH1_CTRL.
* To use register names with standard convension, please use GTM_ATOM5_CH1_CTRL.
*/
#define	GTM_ATOM5_CH1_CTRL_SOMP	(GTM_ATOM5_CH1_CTRL)

/** Alias (User Manual Name) for GTM_ATOM5_CH1_CTRL.
* To use register names with standard convension, please use GTM_ATOM5_CH1_CTRL.
*/
#define	GTM_ATOM5_CH1_CTRL_SOMC	(GTM_ATOM5_CH1_CTRL)

/** Alias (User Manual Name) for GTM_ATOM5_CH1_CTRL.
* To use register names with standard convension, please use GTM_ATOM5_CH1_CTRL.
*/
#define	GTM_ATOM5_CH1_CTRL_SOMI	(GTM_ATOM5_CH1_CTRL)

/** \\brief  F8A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM5_CH1_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F8A4u)

/** \\brief  F8A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM5_CH1_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F8A8u)

/** \\brief  F8AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM5_CH1_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F8ACu)

/** \\brief  F8A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM5_CH1_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F8A0u)

/** \\brief  F880, ATOM Channel ARU Read Address Register */
#define GTM_ATOM5_CH1_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F880u)

/** \\brief  F888, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM5_CH1_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F888u)

/** \\brief  F88C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM5_CH1_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F88Cu)

/** \\brief  F89C, ATOM Channel Status Register */
#define GTM_ATOM5_CH1_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F89Cu)

/** \\brief  F910, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM5_CH2_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010F910u)

