keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  F914, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM5_CH2_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F914u)

/** \\brief  F918, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM5_CH2_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F918u)

/** \\brief  F904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH2_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F904u)

/** Alias (User Manual Name) for GTM_ATOM5_CH2_CTRL.
* To use register names with standard convension, please use GTM_ATOM5_CH2_CTRL.
*/
#define	GTM_ATOM5_CH2_CTRL_SOMC	(GTM_ATOM5_CH2_CTRL)

/** Alias (User Manual Name) for GTM_ATOM5_CH2_CTRL.
* To use register names with standard convension, please use GTM_ATOM5_CH2_CTRL.
*/
#define	GTM_ATOM5_CH2_CTRL_SOMP	(GTM_ATOM5_CH2_CTRL)

/** Alias (User Manual Name) for GTM_ATOM5_CH2_CTRL.
* To use register names with standard convension, please use GTM_ATOM5_CH2_CTRL.
*/
#define	GTM_ATOM5_CH2_CTRL_SOMS	(GTM_ATOM5_CH2_CTRL)

/** Alias (User Manual Name) for GTM_ATOM5_CH2_CTRL.
* To use register names with standard convension, please use GTM_ATOM5_CH2_CTRL.
*/
#define	GTM_ATOM5_CH2_CTRL_SOMI	(GTM_ATOM5_CH2_CTRL)

/** \\brief  F924, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM5_CH2_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F924u)

/** \\brief  F928, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM5_CH2_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F928u)

/** \\brief  F92C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM5_CH2_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F92Cu)

/** \\brief  F920, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM5_CH2_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F920u)

/** \\brief  F900, ATOM Channel ARU Read Address Register */
#define GTM_ATOM5_CH2_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F900u)

/** \\brief  F908, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM5_CH2_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F908u)

/** \\brief  F90C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM5_CH2_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F90Cu)

/** \\brief  F91C, ATOM Channel Status Register */
#define GTM_ATOM5_CH2_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F91Cu)

/** \\brief  F990, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM5_CH3_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010F990u)

/** \\brief  F994, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM5_CH3_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010F994u)

/** \\brief  F998, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM5_CH3_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010F998u)

/** \\brief  F984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH3_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010F984u)

/** Alias (User Manual Name) for GTM_ATOM5_CH3_CTRL.
* To use register names with standard convension, please use GTM_ATOM5_CH3_CTRL.
*/
#define	GTM_ATOM5_CH3_CTRL_SOMC	(GTM_ATOM5_CH3_CTRL)

/** Alias (User Manual Name) for GTM_ATOM5_CH3_CTRL.
* To use register names with standard convension, please use GTM_ATOM5_CH3_CTRL.
*/
#define	GTM_ATOM5_CH3_CTRL_SOMI	(GTM_ATOM5_CH3_CTRL)

/** Alias (User Manual Name) for GTM_ATOM5_CH3_CTRL.
* To use register names with standard convension, please use GTM_ATOM5_CH3_CTRL.
*/
#define	GTM_ATOM5_CH3_CTRL_SOMP	(GTM_ATOM5_CH3_CTRL)

/** Alias (User Manual Name) for GTM_ATOM5_CH3_CTRL.
* To use register names with standard convension, please use GTM_ATOM5_CH3_CTRL.
*/
#define	GTM_ATOM5_CH3_CTRL_SOMS	(GTM_ATOM5_CH3_CTRL)

/** \\brief  F9A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM5_CH3_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010F9A4u)

/** \\brief  F9A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM5_CH3_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010F9A8u)

/** \\brief  F9AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM5_CH3_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010F9ACu)

/** \\brief  F9A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM5_CH3_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010F9A0u)

/** \\brief  F980, ATOM Channel ARU Read Address Register */
#define GTM_ATOM5_CH3_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010F980u)

/** \\brief  F988, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM5_CH3_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010F988u)

/** \\brief  F98C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM5_CH3_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010F98Cu)

/** \\brief  F99C, ATOM Channel Status Register */
#define GTM_ATOM5_CH3_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010F99Cu)

/** \\brief  FA10, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM5_CH4_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010FA10u)

/** \\brief  FA14, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM5_CH4_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010FA14u)

/** \\brief  FA18, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM5_CH4_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010FA18u)

/** \\brief  FA04, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH4_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010FA04u)

/** Alias (User Manual Name) for GTM_ATOM5_CH4_CTRL.
* To use register names with standard convension, please use GTM_ATOM5_CH4_CTRL.
*/
#define	GTM_ATOM5_CH4_CTRL_SOMS	(GTM_ATOM5_CH4_CTRL)

