keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  FB20, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM5_CH6_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010FB20u)

/** \\brief  FB00, ATOM Channel ARU Read Address Register */
#define GTM_ATOM5_CH6_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010FB00u)

/** \\brief  FB08, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM5_CH6_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010FB08u)

/** \\brief  FB0C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM5_CH6_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010FB0Cu)

/** \\brief  FB1C, ATOM Channel Status Register */
#define GTM_ATOM5_CH6_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010FB1Cu)

/** \\brief  FB90, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM5_CH7_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF010FB90u)

/** \\brief  FB94, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM5_CH7_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF010FB94u)

/** \\brief  FB98, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM5_CH7_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF010FB98u)

/** \\brief  FB84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM5_CH7_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF010FB84u)

/** Alias (User Manual Name) for GTM_ATOM5_CH7_CTRL.
* To use register names with standard convension, please use GTM_ATOM5_CH7_CTRL.
*/
#define	GTM_ATOM5_CH7_CTRL_SOMS	(GTM_ATOM5_CH7_CTRL)

/** Alias (User Manual Name) for GTM_ATOM5_CH7_CTRL.
* To use register names with standard convension, please use GTM_ATOM5_CH7_CTRL.
*/
#define	GTM_ATOM5_CH7_CTRL_SOMC	(GTM_ATOM5_CH7_CTRL)

/** Alias (User Manual Name) for GTM_ATOM5_CH7_CTRL.
* To use register names with standard convension, please use GTM_ATOM5_CH7_CTRL.
*/
#define	GTM_ATOM5_CH7_CTRL_SOMI	(GTM_ATOM5_CH7_CTRL)

/** Alias (User Manual Name) for GTM_ATOM5_CH7_CTRL.
* To use register names with standard convension, please use GTM_ATOM5_CH7_CTRL.
*/
#define	GTM_ATOM5_CH7_CTRL_SOMP	(GTM_ATOM5_CH7_CTRL)

/** \\brief  FBA4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM5_CH7_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF010FBA4u)

/** \\brief  FBA8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM5_CH7_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF010FBA8u)

/** \\brief  FBAC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM5_CH7_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF010FBACu)

/** \\brief  FBA0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM5_CH7_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF010FBA0u)

/** \\brief  FB80, ATOM Channel ARU Read Address Register */
#define GTM_ATOM5_CH7_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF010FB80u)

/** \\brief  FB88, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM5_CH7_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF010FB88u)

/** \\brief  FB8C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM5_CH7_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF010FB8Cu)

/** \\brief  FB9C, ATOM Channel Status Register */
#define GTM_ATOM5_CH7_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF010FB9Cu)

/** \\brief  1004C, TOM TGC0 Action Time Base Register */
#define GTM_ATOM6_AGC_ACT_TB /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB*)0xF011004Cu)

/** \\brief  10044, ATOM AGC Enable/Disable Control Register */
#define GTM_ATOM6_AGC_ENDIS_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL*)0xF0110044u)

/** \\brief  10048, ATOM AGC Enable/Disable Status Register */
#define GTM_ATOM6_AGC_ENDIS_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT*)0xF0110048u)

/** \\brief  10058, ATOM AGC Force Update Control Register */
#define GTM_ATOM6_AGC_FUPD_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL*)0xF0110058u)

/** \\brief  10040, ATOM AGC Global control register */
#define GTM_ATOM6_AGC_GLB_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL*)0xF0110040u)

/** \\brief  1005C, ATOM AGC Internal Trigger Control Register */
#define GTM_ATOM6_AGC_INT_TRIG /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG*)0xF011005Cu)

/** \\brief  10050, ATOM AGC Output Enable Control Register */
#define GTM_ATOM6_AGC_OUTEN_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL*)0xF0110050u)

/** \\brief  10054, ATOM AGC Output Enable Status Register */
#define GTM_ATOM6_AGC_OUTEN_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT*)0xF0110054u)

/** \\brief  10010, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM6_CH0_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110010u)

/** \\brief  10014, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM6_CH0_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110014u)

/** \\brief  10018, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM6_CH0_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110018u)

/** \\brief  10004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH0_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110004u)

/** Alias (User Manual Name) for GTM_ATOM6_CH0_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH0_CTRL.
*/
#define	GTM_ATOM6_CH0_CTRL_SOMP	(GTM_ATOM6_CH0_CTRL)

/** Alias (User Manual Name) for GTM_ATOM6_CH0_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH0_CTRL.
*/
#define	GTM_ATOM6_CH0_CTRL_SOMS	(GTM_ATOM6_CH0_CTRL)

/** Alias (User Manual Name) for GTM_ATOM6_CH0_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH0_CTRL.
*/
#define	GTM_ATOM6_CH0_CTRL_SOMI	(GTM_ATOM6_CH0_CTRL)

/** Alias (User Manual Name) for GTM_ATOM6_CH0_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH0_CTRL.
*/
#define	GTM_ATOM6_CH0_CTRL_SOMC	(GTM_ATOM6_CH0_CTRL)

