keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  10024, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM6_CH0_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF0110024u)

/** \\brief  10028, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM6_CH0_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF0110028u)

/** \\brief  1002C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM6_CH0_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF011002Cu)

/** \\brief  10020, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM6_CH0_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF0110020u)

/** \\brief  10000, ATOM Channel ARU Read Address Register */
#define GTM_ATOM6_CH0_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110000u)

/** \\brief  10008, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM6_CH0_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110008u)

/** \\brief  1000C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM6_CH0_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011000Cu)

/** \\brief  1001C, ATOM Channel Status Register */
#define GTM_ATOM6_CH0_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011001Cu)

/** \\brief  10090, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM6_CH1_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110090u)

/** \\brief  10094, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM6_CH1_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110094u)

/** \\brief  10098, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM6_CH1_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110098u)

/** \\brief  10084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH1_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110084u)

/** Alias (User Manual Name) for GTM_ATOM6_CH1_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH1_CTRL.
*/
#define	GTM_ATOM6_CH1_CTRL_SOMI	(GTM_ATOM6_CH1_CTRL)

/** Alias (User Manual Name) for GTM_ATOM6_CH1_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH1_CTRL.
*/
#define	GTM_ATOM6_CH1_CTRL_SOMC	(GTM_ATOM6_CH1_CTRL)

/** Alias (User Manual Name) for GTM_ATOM6_CH1_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH1_CTRL.
*/
#define	GTM_ATOM6_CH1_CTRL_SOMP	(GTM_ATOM6_CH1_CTRL)

/** Alias (User Manual Name) for GTM_ATOM6_CH1_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH1_CTRL.
*/
#define	GTM_ATOM6_CH1_CTRL_SOMS	(GTM_ATOM6_CH1_CTRL)

/** \\brief  100A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM6_CH1_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01100A4u)

/** \\brief  100A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM6_CH1_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01100A8u)

/** \\brief  100AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM6_CH1_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01100ACu)

/** \\brief  100A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM6_CH1_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01100A0u)

/** \\brief  10080, ATOM Channel ARU Read Address Register */
#define GTM_ATOM6_CH1_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110080u)

/** \\brief  10088, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM6_CH1_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110088u)

/** \\brief  1008C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM6_CH1_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011008Cu)

/** \\brief  1009C, ATOM Channel Status Register */
#define GTM_ATOM6_CH1_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011009Cu)

/** \\brief  10110, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM6_CH2_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110110u)

/** \\brief  10114, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM6_CH2_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110114u)

/** \\brief  10118, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM6_CH2_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110118u)

/** \\brief  10104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH2_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110104u)

/** Alias (User Manual Name) for GTM_ATOM6_CH2_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH2_CTRL.
*/
#define	GTM_ATOM6_CH2_CTRL_SOMC	(GTM_ATOM6_CH2_CTRL)

/** Alias (User Manual Name) for GTM_ATOM6_CH2_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH2_CTRL.
*/
#define	GTM_ATOM6_CH2_CTRL_SOMI	(GTM_ATOM6_CH2_CTRL)

/** Alias (User Manual Name) for GTM_ATOM6_CH2_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH2_CTRL.
*/
#define	GTM_ATOM6_CH2_CTRL_SOMS	(GTM_ATOM6_CH2_CTRL)

/** Alias (User Manual Name) for GTM_ATOM6_CH2_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH2_CTRL.
*/
#define	GTM_ATOM6_CH2_CTRL_SOMP	(GTM_ATOM6_CH2_CTRL)

/** \\brief  10124, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM6_CH2_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF0110124u)

/** \\brief  10128, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM6_CH2_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF0110128u)

/** \\brief  1012C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM6_CH2_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF011012Cu)

/** \\brief  10120, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM6_CH2_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF0110120u)

/** \\brief  10100, ATOM Channel ARU Read Address Register */
#define GTM_ATOM6_CH2_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110100u)

/** \\brief  10108, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM6_CH2_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110108u)

