keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  1010C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM6_CH2_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011010Cu)

/** \\brief  1011C, ATOM Channel Status Register */
#define GTM_ATOM6_CH2_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011011Cu)

/** \\brief  10190, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM6_CH3_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110190u)

/** \\brief  10194, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM6_CH3_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110194u)

/** \\brief  10198, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM6_CH3_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110198u)

/** \\brief  10184, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH3_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110184u)

/** Alias (User Manual Name) for GTM_ATOM6_CH3_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH3_CTRL.
*/
#define	GTM_ATOM6_CH3_CTRL_SOMC	(GTM_ATOM6_CH3_CTRL)

/** Alias (User Manual Name) for GTM_ATOM6_CH3_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH3_CTRL.
*/
#define	GTM_ATOM6_CH3_CTRL_SOMS	(GTM_ATOM6_CH3_CTRL)

/** Alias (User Manual Name) for GTM_ATOM6_CH3_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH3_CTRL.
*/
#define	GTM_ATOM6_CH3_CTRL_SOMP	(GTM_ATOM6_CH3_CTRL)

/** Alias (User Manual Name) for GTM_ATOM6_CH3_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH3_CTRL.
*/
#define	GTM_ATOM6_CH3_CTRL_SOMI	(GTM_ATOM6_CH3_CTRL)

/** \\brief  101A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM6_CH3_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01101A4u)

/** \\brief  101A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM6_CH3_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01101A8u)

/** \\brief  101AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM6_CH3_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01101ACu)

/** \\brief  101A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM6_CH3_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01101A0u)

/** \\brief  10180, ATOM Channel ARU Read Address Register */
#define GTM_ATOM6_CH3_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110180u)

/** \\brief  10188, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM6_CH3_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110188u)

/** \\brief  1018C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM6_CH3_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011018Cu)

/** \\brief  1019C, ATOM Channel Status Register */
#define GTM_ATOM6_CH3_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011019Cu)

/** \\brief  10210, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM6_CH4_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110210u)

/** \\brief  10214, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM6_CH4_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110214u)

/** \\brief  10218, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM6_CH4_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110218u)

/** \\brief  10204, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH4_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110204u)

/** Alias (User Manual Name) for GTM_ATOM6_CH4_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH4_CTRL.
*/
#define	GTM_ATOM6_CH4_CTRL_SOMP	(GTM_ATOM6_CH4_CTRL)

/** Alias (User Manual Name) for GTM_ATOM6_CH4_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH4_CTRL.
*/
#define	GTM_ATOM6_CH4_CTRL_SOMS	(GTM_ATOM6_CH4_CTRL)

/** Alias (User Manual Name) for GTM_ATOM6_CH4_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH4_CTRL.
*/
#define	GTM_ATOM6_CH4_CTRL_SOMI	(GTM_ATOM6_CH4_CTRL)

/** Alias (User Manual Name) for GTM_ATOM6_CH4_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH4_CTRL.
*/
#define	GTM_ATOM6_CH4_CTRL_SOMC	(GTM_ATOM6_CH4_CTRL)

/** \\brief  10224, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM6_CH4_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF0110224u)

/** \\brief  10228, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM6_CH4_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF0110228u)

/** \\brief  1022C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM6_CH4_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF011022Cu)

/** \\brief  10220, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM6_CH4_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF0110220u)

/** \\brief  10200, ATOM Channel ARU Read Address Register */
#define GTM_ATOM6_CH4_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110200u)

/** \\brief  10208, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM6_CH4_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110208u)

/** \\brief  1020C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM6_CH4_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011020Cu)

/** \\brief  1021C, ATOM Channel Status Register */
#define GTM_ATOM6_CH4_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011021Cu)

/** \\brief  10290, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM6_CH5_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110290u)

/** \\brief  10294, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM6_CH5_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110294u)

