keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  10298, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM6_CH5_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110298u)

/** \\brief  10284, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH5_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110284u)

/** Alias (User Manual Name) for GTM_ATOM6_CH5_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH5_CTRL.
*/
#define	GTM_ATOM6_CH5_CTRL_SOMC	(GTM_ATOM6_CH5_CTRL)

/** Alias (User Manual Name) for GTM_ATOM6_CH5_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH5_CTRL.
*/
#define	GTM_ATOM6_CH5_CTRL_SOMP	(GTM_ATOM6_CH5_CTRL)

/** Alias (User Manual Name) for GTM_ATOM6_CH5_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH5_CTRL.
*/
#define	GTM_ATOM6_CH5_CTRL_SOMS	(GTM_ATOM6_CH5_CTRL)

/** Alias (User Manual Name) for GTM_ATOM6_CH5_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH5_CTRL.
*/
#define	GTM_ATOM6_CH5_CTRL_SOMI	(GTM_ATOM6_CH5_CTRL)

/** \\brief  102A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM6_CH5_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01102A4u)

/** \\brief  102A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM6_CH5_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01102A8u)

/** \\brief  102AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM6_CH5_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01102ACu)

/** \\brief  102A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM6_CH5_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01102A0u)

/** \\brief  10280, ATOM Channel ARU Read Address Register */
#define GTM_ATOM6_CH5_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110280u)

/** \\brief  10288, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM6_CH5_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110288u)

/** \\brief  1028C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM6_CH5_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011028Cu)

/** \\brief  1029C, ATOM Channel Status Register */
#define GTM_ATOM6_CH5_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011029Cu)

/** \\brief  10310, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM6_CH6_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110310u)

/** \\brief  10314, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM6_CH6_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110314u)

/** \\brief  10318, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM6_CH6_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110318u)

/** \\brief  10304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH6_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110304u)

/** Alias (User Manual Name) for GTM_ATOM6_CH6_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH6_CTRL.
*/
#define	GTM_ATOM6_CH6_CTRL_SOMC	(GTM_ATOM6_CH6_CTRL)

/** Alias (User Manual Name) for GTM_ATOM6_CH6_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH6_CTRL.
*/
#define	GTM_ATOM6_CH6_CTRL_SOMI	(GTM_ATOM6_CH6_CTRL)

/** Alias (User Manual Name) for GTM_ATOM6_CH6_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH6_CTRL.
*/
#define	GTM_ATOM6_CH6_CTRL_SOMP	(GTM_ATOM6_CH6_CTRL)

/** Alias (User Manual Name) for GTM_ATOM6_CH6_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH6_CTRL.
*/
#define	GTM_ATOM6_CH6_CTRL_SOMS	(GTM_ATOM6_CH6_CTRL)

/** \\brief  10324, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM6_CH6_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF0110324u)

/** \\brief  10328, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM6_CH6_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF0110328u)

/** \\brief  1032C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM6_CH6_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF011032Cu)

/** \\brief  10320, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM6_CH6_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF0110320u)

/** \\brief  10300, ATOM Channel ARU Read Address Register */
#define GTM_ATOM6_CH6_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110300u)

/** \\brief  10308, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM6_CH6_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110308u)

/** \\brief  1030C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM6_CH6_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011030Cu)

/** \\brief  1031C, ATOM Channel Status Register */
#define GTM_ATOM6_CH6_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011031Cu)

/** \\brief  10390, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM6_CH7_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110390u)

/** \\brief  10394, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM6_CH7_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110394u)

/** \\brief  10398, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM6_CH7_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110398u)

/** \\brief  10384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM6_CH7_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110384u)

/** Alias (User Manual Name) for GTM_ATOM6_CH7_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH7_CTRL.
*/
#define	GTM_ATOM6_CH7_CTRL_SOMS	(GTM_ATOM6_CH7_CTRL)

/** Alias (User Manual Name) for GTM_ATOM6_CH7_CTRL.
* To use register names with standard convension, please use GTM_ATOM6_CH7_CTRL.
*/
#define	GTM_ATOM6_CH7_CTRL_SOMP	(GTM_ATOM6_CH7_CTRL)

