keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  108AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM7_CH1_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01108ACu)

/** \\brief  108A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM7_CH1_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01108A0u)

/** \\brief  10880, ATOM Channel ARU Read Address Register */
#define GTM_ATOM7_CH1_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110880u)

/** \\brief  10888, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM7_CH1_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110888u)

/** \\brief  1088C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM7_CH1_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011088Cu)

/** \\brief  1089C, ATOM Channel Status Register */
#define GTM_ATOM7_CH1_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011089Cu)

/** \\brief  10910, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM7_CH2_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110910u)

/** \\brief  10914, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM7_CH2_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110914u)

/** \\brief  10918, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM7_CH2_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110918u)

/** \\brief  10904, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH2_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110904u)

/** Alias (User Manual Name) for GTM_ATOM7_CH2_CTRL.
* To use register names with standard convension, please use GTM_ATOM7_CH2_CTRL.
*/
#define	GTM_ATOM7_CH2_CTRL_SOMS	(GTM_ATOM7_CH2_CTRL)

/** Alias (User Manual Name) for GTM_ATOM7_CH2_CTRL.
* To use register names with standard convension, please use GTM_ATOM7_CH2_CTRL.
*/
#define	GTM_ATOM7_CH2_CTRL_SOMP	(GTM_ATOM7_CH2_CTRL)

/** Alias (User Manual Name) for GTM_ATOM7_CH2_CTRL.
* To use register names with standard convension, please use GTM_ATOM7_CH2_CTRL.
*/
#define	GTM_ATOM7_CH2_CTRL_SOMC	(GTM_ATOM7_CH2_CTRL)

/** Alias (User Manual Name) for GTM_ATOM7_CH2_CTRL.
* To use register names with standard convension, please use GTM_ATOM7_CH2_CTRL.
*/
#define	GTM_ATOM7_CH2_CTRL_SOMI	(GTM_ATOM7_CH2_CTRL)

/** \\brief  10924, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM7_CH2_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF0110924u)

/** \\brief  10928, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM7_CH2_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF0110928u)

/** \\brief  1092C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM7_CH2_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF011092Cu)

/** \\brief  10920, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM7_CH2_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF0110920u)

/** \\brief  10900, ATOM Channel ARU Read Address Register */
#define GTM_ATOM7_CH2_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110900u)

/** \\brief  10908, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM7_CH2_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110908u)

/** \\brief  1090C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM7_CH2_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011090Cu)

/** \\brief  1091C, ATOM Channel Status Register */
#define GTM_ATOM7_CH2_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011091Cu)

/** \\brief  10990, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM7_CH3_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110990u)

/** \\brief  10994, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM7_CH3_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110994u)

/** \\brief  10998, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM7_CH3_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110998u)

/** \\brief  10984, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH3_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110984u)

/** Alias (User Manual Name) for GTM_ATOM7_CH3_CTRL.
* To use register names with standard convension, please use GTM_ATOM7_CH3_CTRL.
*/
#define	GTM_ATOM7_CH3_CTRL_SOMS	(GTM_ATOM7_CH3_CTRL)

/** Alias (User Manual Name) for GTM_ATOM7_CH3_CTRL.
* To use register names with standard convension, please use GTM_ATOM7_CH3_CTRL.
*/
#define	GTM_ATOM7_CH3_CTRL_SOMC	(GTM_ATOM7_CH3_CTRL)

/** Alias (User Manual Name) for GTM_ATOM7_CH3_CTRL.
* To use register names with standard convension, please use GTM_ATOM7_CH3_CTRL.
*/
#define	GTM_ATOM7_CH3_CTRL_SOMI	(GTM_ATOM7_CH3_CTRL)

/** Alias (User Manual Name) for GTM_ATOM7_CH3_CTRL.
* To use register names with standard convension, please use GTM_ATOM7_CH3_CTRL.
*/
#define	GTM_ATOM7_CH3_CTRL_SOMP	(GTM_ATOM7_CH3_CTRL)

/** \\brief  109A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM7_CH3_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01109A4u)

/** \\brief  109A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM7_CH3_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01109A8u)

/** \\brief  109AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM7_CH3_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01109ACu)

/** \\brief  109A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM7_CH3_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01109A0u)

/** \\brief  10980, ATOM Channel ARU Read Address Register */
#define GTM_ATOM7_CH3_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110980u)

/** \\brief  10988, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM7_CH3_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110988u)

/** \\brief  1098C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM7_CH3_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011098Cu)

/** \\brief  1099C, ATOM Channel Status Register */
#define GTM_ATOM7_CH3_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011099Cu)

/** \\brief  10A10, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM7_CH4_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110A10u)

/** \\brief  10A14, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM7_CH4_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110A14u)

/** \\brief  10A18, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM7_CH4_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110A18u)

