keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_ATOM7_CH6_CTRL.
* To use register names with standard convension, please use GTM_ATOM7_CH6_CTRL.
*/
#define	GTM_ATOM7_CH6_CTRL_SOMC	(GTM_ATOM7_CH6_CTRL)

/** \\brief  10B24, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM7_CH6_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF0110B24u)

/** \\brief  10B28, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM7_CH6_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF0110B28u)

/** \\brief  10B2C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM7_CH6_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF0110B2Cu)

/** \\brief  10B20, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM7_CH6_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF0110B20u)

/** \\brief  10B00, ATOM Channel ARU Read Address Register */
#define GTM_ATOM7_CH6_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110B00u)

/** \\brief  10B08, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM7_CH6_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110B08u)

/** \\brief  10B0C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM7_CH6_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF0110B0Cu)

/** \\brief  10B1C, ATOM Channel Status Register */
#define GTM_ATOM7_CH6_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF0110B1Cu)

/** \\brief  10B90, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM7_CH7_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0110B90u)

/** \\brief  10B94, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM7_CH7_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0110B94u)

/** \\brief  10B98, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM7_CH7_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0110B98u)

/** \\brief  10B84, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM7_CH7_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0110B84u)

/** Alias (User Manual Name) for GTM_ATOM7_CH7_CTRL.
* To use register names with standard convension, please use GTM_ATOM7_CH7_CTRL.
*/
#define	GTM_ATOM7_CH7_CTRL_SOMS	(GTM_ATOM7_CH7_CTRL)

/** Alias (User Manual Name) for GTM_ATOM7_CH7_CTRL.
* To use register names with standard convension, please use GTM_ATOM7_CH7_CTRL.
*/
#define	GTM_ATOM7_CH7_CTRL_SOMP	(GTM_ATOM7_CH7_CTRL)

/** Alias (User Manual Name) for GTM_ATOM7_CH7_CTRL.
* To use register names with standard convension, please use GTM_ATOM7_CH7_CTRL.
*/
#define	GTM_ATOM7_CH7_CTRL_SOMC	(GTM_ATOM7_CH7_CTRL)

/** Alias (User Manual Name) for GTM_ATOM7_CH7_CTRL.
* To use register names with standard convension, please use GTM_ATOM7_CH7_CTRL.
*/
#define	GTM_ATOM7_CH7_CTRL_SOMI	(GTM_ATOM7_CH7_CTRL)

/** \\brief  10BA4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM7_CH7_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF0110BA4u)

/** \\brief  10BA8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM7_CH7_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF0110BA8u)

/** \\brief  10BAC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM7_CH7_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF0110BACu)

/** \\brief  10BA0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM7_CH7_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF0110BA0u)

/** \\brief  10B80, ATOM Channel ARU Read Address Register */
#define GTM_ATOM7_CH7_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0110B80u)

/** \\brief  10B88, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM7_CH7_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0110B88u)

/** \\brief  10B8C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM7_CH7_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF0110B8Cu)

/** \\brief  10B9C, ATOM Channel Status Register */
#define GTM_ATOM7_CH7_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF0110B9Cu)

/** \\brief  1104C, TOM TGC0 Action Time Base Register */
#define GTM_ATOM8_AGC_ACT_TB /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB*)0xF011104Cu)

/** \\brief  11044, ATOM AGC Enable/Disable Control Register */
#define GTM_ATOM8_AGC_ENDIS_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL*)0xF0111044u)

/** \\brief  11048, ATOM AGC Enable/Disable Status Register */
#define GTM_ATOM8_AGC_ENDIS_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT*)0xF0111048u)

/** \\brief  11058, ATOM AGC Force Update Control Register */
#define GTM_ATOM8_AGC_FUPD_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL*)0xF0111058u)

/** \\brief  11040, ATOM AGC Global control register */
#define GTM_ATOM8_AGC_GLB_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL*)0xF0111040u)

/** \\brief  1105C, ATOM AGC Internal Trigger Control Register */
#define GTM_ATOM8_AGC_INT_TRIG /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG*)0xF011105Cu)

/** \\brief  11050, ATOM AGC Output Enable Control Register */
#define GTM_ATOM8_AGC_OUTEN_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL*)0xF0111050u)

/** \\brief  11054, ATOM AGC Output Enable Status Register */
#define GTM_ATOM8_AGC_OUTEN_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT*)0xF0111054u)

/** \\brief  11010, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM8_CH0_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0111010u)

/** \\brief  11014, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM8_CH0_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0111014u)

/** \\brief  11018, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM8_CH0_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0111018u)

/** \\brief  11004, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH0_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0111004u)

