keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_ATOM8_CH0_CTRL.
* To use register names with standard convension, please use GTM_ATOM8_CH0_CTRL.
*/
#define	GTM_ATOM8_CH0_CTRL_SOMC	(GTM_ATOM8_CH0_CTRL)

/** Alias (User Manual Name) for GTM_ATOM8_CH0_CTRL.
* To use register names with standard convension, please use GTM_ATOM8_CH0_CTRL.
*/
#define	GTM_ATOM8_CH0_CTRL_SOMI	(GTM_ATOM8_CH0_CTRL)

/** Alias (User Manual Name) for GTM_ATOM8_CH0_CTRL.
* To use register names with standard convension, please use GTM_ATOM8_CH0_CTRL.
*/
#define	GTM_ATOM8_CH0_CTRL_SOMS	(GTM_ATOM8_CH0_CTRL)

/** Alias (User Manual Name) for GTM_ATOM8_CH0_CTRL.
* To use register names with standard convension, please use GTM_ATOM8_CH0_CTRL.
*/
#define	GTM_ATOM8_CH0_CTRL_SOMP	(GTM_ATOM8_CH0_CTRL)

/** \\brief  11024, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM8_CH0_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF0111024u)

/** \\brief  11028, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM8_CH0_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF0111028u)

/** \\brief  1102C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM8_CH0_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF011102Cu)

/** \\brief  11020, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM8_CH0_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF0111020u)

/** \\brief  11000, ATOM Channel ARU Read Address Register */
#define GTM_ATOM8_CH0_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0111000u)

/** \\brief  11008, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM8_CH0_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0111008u)

/** \\brief  1100C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM8_CH0_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011100Cu)

/** \\brief  1101C, ATOM Channel Status Register */
#define GTM_ATOM8_CH0_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011101Cu)

/** \\brief  11090, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM8_CH1_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0111090u)

/** \\brief  11094, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM8_CH1_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0111094u)

/** \\brief  11098, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM8_CH1_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0111098u)

/** \\brief  11084, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH1_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0111084u)

/** Alias (User Manual Name) for GTM_ATOM8_CH1_CTRL.
* To use register names with standard convension, please use GTM_ATOM8_CH1_CTRL.
*/
#define	GTM_ATOM8_CH1_CTRL_SOMC	(GTM_ATOM8_CH1_CTRL)

/** Alias (User Manual Name) for GTM_ATOM8_CH1_CTRL.
* To use register names with standard convension, please use GTM_ATOM8_CH1_CTRL.
*/
#define	GTM_ATOM8_CH1_CTRL_SOMI	(GTM_ATOM8_CH1_CTRL)

/** Alias (User Manual Name) for GTM_ATOM8_CH1_CTRL.
* To use register names with standard convension, please use GTM_ATOM8_CH1_CTRL.
*/
#define	GTM_ATOM8_CH1_CTRL_SOMS	(GTM_ATOM8_CH1_CTRL)

/** Alias (User Manual Name) for GTM_ATOM8_CH1_CTRL.
* To use register names with standard convension, please use GTM_ATOM8_CH1_CTRL.
*/
#define	GTM_ATOM8_CH1_CTRL_SOMP	(GTM_ATOM8_CH1_CTRL)

/** \\brief  110A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM8_CH1_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01110A4u)

/** \\brief  110A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM8_CH1_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01110A8u)

/** \\brief  110AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM8_CH1_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01110ACu)

/** \\brief  110A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM8_CH1_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01110A0u)

/** \\brief  11080, ATOM Channel ARU Read Address Register */
#define GTM_ATOM8_CH1_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0111080u)

/** \\brief  11088, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM8_CH1_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0111088u)

/** \\brief  1108C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM8_CH1_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011108Cu)

/** \\brief  1109C, ATOM Channel Status Register */
#define GTM_ATOM8_CH1_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011109Cu)

/** \\brief  11110, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM8_CH2_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0111110u)

/** \\brief  11114, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM8_CH2_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0111114u)

/** \\brief  11118, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM8_CH2_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0111118u)

/** \\brief  11104, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH2_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0111104u)

/** Alias (User Manual Name) for GTM_ATOM8_CH2_CTRL.
* To use register names with standard convension, please use GTM_ATOM8_CH2_CTRL.
*/
#define	GTM_ATOM8_CH2_CTRL_SOMP	(GTM_ATOM8_CH2_CTRL)

/** Alias (User Manual Name) for GTM_ATOM8_CH2_CTRL.
* To use register names with standard convension, please use GTM_ATOM8_CH2_CTRL.
*/
#define	GTM_ATOM8_CH2_CTRL_SOMS	(GTM_ATOM8_CH2_CTRL)

/** Alias (User Manual Name) for GTM_ATOM8_CH2_CTRL.
* To use register names with standard convension, please use GTM_ATOM8_CH2_CTRL.
*/
#define	GTM_ATOM8_CH2_CTRL_SOMC	(GTM_ATOM8_CH2_CTRL)

/** Alias (User Manual Name) for GTM_ATOM8_CH2_CTRL.
* To use register names with standard convension, please use GTM_ATOM8_CH2_CTRL.
*/
#define	GTM_ATOM8_CH2_CTRL_SOMI	(GTM_ATOM8_CH2_CTRL)

/** \\brief  11124, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM8_CH2_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF0111124u)

/** \\brief  11128, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM8_CH2_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF0111128u)

/** \\brief  1112C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM8_CH2_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF011112Cu)

/** \\brief  11120, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM8_CH2_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF0111120u)

/** \\brief  11100, ATOM Channel ARU Read Address Register */
#define GTM_ATOM8_CH2_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0111100u)

/** \\brief  11108, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM8_CH2_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0111108u)

/** \\brief  1110C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM8_CH2_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011110Cu)

/** \\brief  1111C, ATOM Channel Status Register */
#define GTM_ATOM8_CH2_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011111Cu)

/** \\brief  11190, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM8_CH3_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0111190u)

/** \\brief  11194, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM8_CH3_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0111194u)

