keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  112A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM8_CH5_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01112A4u)

/** \\brief  112A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM8_CH5_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01112A8u)

/** \\brief  112AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM8_CH5_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01112ACu)

/** \\brief  112A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM8_CH5_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01112A0u)

/** \\brief  11280, ATOM Channel ARU Read Address Register */
#define GTM_ATOM8_CH5_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0111280u)

/** \\brief  11288, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM8_CH5_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0111288u)

/** \\brief  1128C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM8_CH5_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011128Cu)

/** \\brief  1129C, ATOM Channel Status Register */
#define GTM_ATOM8_CH5_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011129Cu)

/** \\brief  11310, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM8_CH6_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0111310u)

/** \\brief  11314, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM8_CH6_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0111314u)

/** \\brief  11318, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM8_CH6_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0111318u)

/** \\brief  11304, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH6_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0111304u)

/** Alias (User Manual Name) for GTM_ATOM8_CH6_CTRL.
* To use register names with standard convension, please use GTM_ATOM8_CH6_CTRL.
*/
#define	GTM_ATOM8_CH6_CTRL_SOMP	(GTM_ATOM8_CH6_CTRL)

/** Alias (User Manual Name) for GTM_ATOM8_CH6_CTRL.
* To use register names with standard convension, please use GTM_ATOM8_CH6_CTRL.
*/
#define	GTM_ATOM8_CH6_CTRL_SOMS	(GTM_ATOM8_CH6_CTRL)

/** Alias (User Manual Name) for GTM_ATOM8_CH6_CTRL.
* To use register names with standard convension, please use GTM_ATOM8_CH6_CTRL.
*/
#define	GTM_ATOM8_CH6_CTRL_SOMI	(GTM_ATOM8_CH6_CTRL)

/** Alias (User Manual Name) for GTM_ATOM8_CH6_CTRL.
* To use register names with standard convension, please use GTM_ATOM8_CH6_CTRL.
*/
#define	GTM_ATOM8_CH6_CTRL_SOMC	(GTM_ATOM8_CH6_CTRL)

/** \\brief  11324, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM8_CH6_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF0111324u)

/** \\brief  11328, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM8_CH6_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF0111328u)

/** \\brief  1132C, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM8_CH6_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF011132Cu)

/** \\brief  11320, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM8_CH6_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF0111320u)

/** \\brief  11300, ATOM Channel ARU Read Address Register */
#define GTM_ATOM8_CH6_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0111300u)

/** \\brief  11308, ATOM Channel CCU0 Compare Shadow Register */
#define GTM_ATOM8_CH6_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF0111308u)

/** \\brief  1130C, ATOM Channel CCU1 Compare Shadow Register */
#define GTM_ATOM8_CH6_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF011130Cu)

/** \\brief  1131C, ATOM Channel Status Register */
#define GTM_ATOM8_CH6_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF011131Cu)

/** \\brief  11390, ATOM Channel CCU0 Compare Register */
#define GTM_ATOM8_CH7_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF0111390u)

/** \\brief  11394, ATOM Channel CCU1 Compare Register */
#define GTM_ATOM8_CH7_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF0111394u)

/** \\brief  11398, ATOM Channel CCU0 Counter Register */
#define GTM_ATOM8_CH7_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF0111398u)

/** \\brief  11384, ATOM Channel Control in SOMI mode Register */
#define GTM_ATOM8_CH7_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF0111384u)

/** Alias (User Manual Name) for GTM_ATOM8_CH7_CTRL.
* To use register names with standard convension, please use GTM_ATOM8_CH7_CTRL.
*/
#define	GTM_ATOM8_CH7_CTRL_SOMI	(GTM_ATOM8_CH7_CTRL)

/** Alias (User Manual Name) for GTM_ATOM8_CH7_CTRL.
* To use register names with standard convension, please use GTM_ATOM8_CH7_CTRL.
*/
#define	GTM_ATOM8_CH7_CTRL_SOMC	(GTM_ATOM8_CH7_CTRL)

/** Alias (User Manual Name) for GTM_ATOM8_CH7_CTRL.
* To use register names with standard convension, please use GTM_ATOM8_CH7_CTRL.
*/
#define	GTM_ATOM8_CH7_CTRL_SOMP	(GTM_ATOM8_CH7_CTRL)

/** Alias (User Manual Name) for GTM_ATOM8_CH7_CTRL.
* To use register names with standard convension, please use GTM_ATOM8_CH7_CTRL.
*/
#define	GTM_ATOM8_CH7_CTRL_SOMS	(GTM_ATOM8_CH7_CTRL)

/** \\brief  113A4, ATOM Channel Interrupt Enable Register */
#define GTM_ATOM8_CH7_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01113A4u)

/** \\brief  113A8, ATOM Channel Software Interrupt Generation Register */
#define GTM_ATOM8_CH7_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01113A8u)

/** \\brief  113AC, ATOM IRQ Mode Configuration Register */
#define GTM_ATOM8_CH7_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01113ACu)

/** \\brief  113A0, ATOM Channel Interrupt Notification Register */
#define GTM_ATOM8_CH7_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01113A0u)

/** \\brief  11380, ATOM Channel ARU Read Address Register */
#define GTM_ATOM8_CH7_RDADDR /*lint --e(923)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF0111380u)

