keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  28F1C, DPLL Act0on Control i Register */
#define GTM_DPLL_ACB7 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ACB*)0xF0128F1Cu)

/** \\brief  28018, DPLL ACTION Status Register With Shadow Register */
#define GTM_DPLL_ACT_STA /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ACT_STA*)0xF0128018u)

/** \\brief  28438, Calculated ADD_IN Value for SUB_INC1 Generation */
#define GTM_DPLL_ADD_IN_CAL1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADD_IN_CAL1*)0xF0128438u)

/** Alias (User Manual Name) for GTM_DPLL_ADD_IN_CAL1.
* To use register names with standard convension, please use GTM_DPLL_ADD_IN_CAL1.
*/
#define	GTM_ADD_IN_CAL1	(GTM_DPLL_ADD_IN_CAL1)

/** \\brief  2843C, Calculated ADD_IN Value for SUB_INC2 Generation */
#define GTM_DPLL_ADD_IN_CAL2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADD_IN_CAL2*)0xF012843Cu)

/** Alias (User Manual Name) for GTM_DPLL_ADD_IN_CAL2.
* To use register names with standard convension, please use GTM_DPLL_ADD_IN_CAL2.
*/
#define	GTM_ADD_IN_CAL2	(GTM_DPLL_ADD_IN_CAL2)

/** \\brief  280C8, DPLL Direct Load Input Value for SUB_INC1 */
#define GTM_DPLL_ADD_IN_LD1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADD_IN_LD1*)0xF01280C8u)

/** Alias (User Manual Name) for GTM_DPLL_ADD_IN_LD1.
* To use register names with standard convension, please use GTM_DPLL_ADD_IN_LD1.
*/
#define	GTM_ADD_IN_LD1	(GTM_DPLL_ADD_IN_LD1)

/** \\brief  280CC, DPLL Direct Load Input Value for SUB_INC1 */
#define GTM_DPLL_ADD_IN_LD2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADD_IN_LD2*)0xF01280CCu)

/** Alias (User Manual Name) for GTM_DPLL_ADD_IN_LD2.
* To use register names with standard convension, please use GTM_DPLL_ADD_IN_LD2.
*/
#define	GTM_ADD_IN_LD2	(GTM_DPLL_ADD_IN_LD2)

/** \\brief  28800, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S0 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128800u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S0.
* To use register names with standard convension, please use GTM_DPLL_ADT_S0.
*/
#define	GTM_ADT_S0	(GTM_DPLL_ADT_S0)

/** \\brief  28804, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128804u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S1.
* To use register names with standard convension, please use GTM_DPLL_ADT_S1.
*/
#define	GTM_ADT_S1	(GTM_DPLL_ADT_S1)

/** \\brief  28828, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S10 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128828u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S10.
* To use register names with standard convension, please use GTM_DPLL_ADT_S10.
*/
#define	GTM_ADT_S10	(GTM_DPLL_ADT_S10)

/** \\brief  2882C, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S11 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF012882Cu)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S11.
* To use register names with standard convension, please use GTM_DPLL_ADT_S11.
*/
#define	GTM_ADT_S11	(GTM_DPLL_ADT_S11)

/** \\brief  28830, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S12 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128830u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S12.
* To use register names with standard convension, please use GTM_DPLL_ADT_S12.
*/
#define	GTM_ADT_S12	(GTM_DPLL_ADT_S12)

/** \\brief  28834, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S13 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128834u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S13.
* To use register names with standard convension, please use GTM_DPLL_ADT_S13.
*/
#define	GTM_ADT_S13	(GTM_DPLL_ADT_S13)

/** \\brief  28838, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S14 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128838u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S14.
* To use register names with standard convension, please use GTM_DPLL_ADT_S14.
*/
#define	GTM_ADT_S14	(GTM_DPLL_ADT_S14)

/** \\brief  2883C, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S15 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF012883Cu)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S15.
* To use register names with standard convension, please use GTM_DPLL_ADT_S15.
*/
#define	GTM_ADT_S15	(GTM_DPLL_ADT_S15)

/** \\brief  28840, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S16 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128840u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S16.
* To use register names with standard convension, please use GTM_DPLL_ADT_S16.
*/
#define	GTM_ADT_S16	(GTM_DPLL_ADT_S16)

/** \\brief  28844, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S17 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128844u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S17.
* To use register names with standard convension, please use GTM_DPLL_ADT_S17.
*/
#define	GTM_ADT_S17	(GTM_DPLL_ADT_S17)

/** \\brief  28848, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S18 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128848u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S18.
* To use register names with standard convension, please use GTM_DPLL_ADT_S18.
*/
#define	GTM_ADT_S18	(GTM_DPLL_ADT_S18)

/** \\brief  2884C, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S19 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF012884Cu)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S19.
* To use register names with standard convension, please use GTM_DPLL_ADT_S19.
*/
#define	GTM_ADT_S19	(GTM_DPLL_ADT_S19)

/** \\brief  28808, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128808u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S2.
* To use register names with standard convension, please use GTM_DPLL_ADT_S2.
*/
#define	GTM_ADT_S2	(GTM_DPLL_ADT_S2)

