keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  28850, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S20 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128850u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S20.
* To use register names with standard convension, please use GTM_DPLL_ADT_S20.
*/
#define	GTM_ADT_S20	(GTM_DPLL_ADT_S20)

/** \\brief  28854, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S21 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128854u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S21.
* To use register names with standard convension, please use GTM_DPLL_ADT_S21.
*/
#define	GTM_ADT_S21	(GTM_DPLL_ADT_S21)

/** \\brief  28858, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S22 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128858u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S22.
* To use register names with standard convension, please use GTM_DPLL_ADT_S22.
*/
#define	GTM_ADT_S22	(GTM_DPLL_ADT_S22)

/** \\brief  2885C, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S23 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF012885Cu)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S23.
* To use register names with standard convension, please use GTM_DPLL_ADT_S23.
*/
#define	GTM_ADT_S23	(GTM_DPLL_ADT_S23)

/** \\brief  28860, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S24 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128860u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S24.
* To use register names with standard convension, please use GTM_DPLL_ADT_S24.
*/
#define	GTM_ADT_S24	(GTM_DPLL_ADT_S24)

/** \\brief  28864, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S25 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128864u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S25.
* To use register names with standard convension, please use GTM_DPLL_ADT_S25.
*/
#define	GTM_ADT_S25	(GTM_DPLL_ADT_S25)

/** \\brief  28868, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S26 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128868u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S26.
* To use register names with standard convension, please use GTM_DPLL_ADT_S26.
*/
#define	GTM_ADT_S26	(GTM_DPLL_ADT_S26)

/** \\brief  2886C, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S27 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF012886Cu)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S27.
* To use register names with standard convension, please use GTM_DPLL_ADT_S27.
*/
#define	GTM_ADT_S27	(GTM_DPLL_ADT_S27)

/** \\brief  28870, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S28 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128870u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S28.
* To use register names with standard convension, please use GTM_DPLL_ADT_S28.
*/
#define	GTM_ADT_S28	(GTM_DPLL_ADT_S28)

/** \\brief  28874, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S29 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128874u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S29.
* To use register names with standard convension, please use GTM_DPLL_ADT_S29.
*/
#define	GTM_ADT_S29	(GTM_DPLL_ADT_S29)

/** \\brief  2880C, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S3 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF012880Cu)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S3.
* To use register names with standard convension, please use GTM_DPLL_ADT_S3.
*/
#define	GTM_ADT_S3	(GTM_DPLL_ADT_S3)

/** \\brief  28878, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S30 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128878u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S30.
* To use register names with standard convension, please use GTM_DPLL_ADT_S30.
*/
#define	GTM_ADT_S30	(GTM_DPLL_ADT_S30)

/** \\brief  2887C, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S31 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF012887Cu)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S31.
* To use register names with standard convension, please use GTM_DPLL_ADT_S31.
*/
#define	GTM_ADT_S31	(GTM_DPLL_ADT_S31)

/** \\brief  28880, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S32 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128880u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S32.
* To use register names with standard convension, please use GTM_DPLL_ADT_S32.
*/
#define	GTM_ADT_S32	(GTM_DPLL_ADT_S32)

/** \\brief  28884, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S33 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128884u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S33.
* To use register names with standard convension, please use GTM_DPLL_ADT_S33.
*/
#define	GTM_ADT_S33	(GTM_DPLL_ADT_S33)

/** \\brief  28888, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S34 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128888u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S34.
* To use register names with standard convension, please use GTM_DPLL_ADT_S34.
*/
#define	GTM_ADT_S34	(GTM_DPLL_ADT_S34)

/** \\brief  2888C, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S35 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF012888Cu)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S35.
* To use register names with standard convension, please use GTM_DPLL_ADT_S35.
*/
#define	GTM_ADT_S35	(GTM_DPLL_ADT_S35)

/** \\brief  28890, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S36 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128890u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S36.
* To use register names with standard convension, please use GTM_DPLL_ADT_S36.
*/
#define	GTM_ADT_S36	(GTM_DPLL_ADT_S36)

/** \\brief  28894, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S37 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128894u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S37.
* To use register names with standard convension, please use GTM_DPLL_ADT_S37.
*/
#define	GTM_ADT_S37	(GTM_DPLL_ADT_S37)

/** \\brief  28898, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S38 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128898u)

