keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  282D4, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA21 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282D4u)

/** Alias (User Manual Name) for GTM_DPLL_DLA21.
* To use register names with standard convension, please use GTM_DPLL_DLA21.
*/
#define	GTM_DLA21	(GTM_DPLL_DLA21)

/** \\brief  282D8, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA22 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282D8u)

/** Alias (User Manual Name) for GTM_DPLL_DLA22.
* To use register names with standard convension, please use GTM_DPLL_DLA22.
*/
#define	GTM_DLA22	(GTM_DPLL_DLA22)

/** \\brief  282DC, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA23 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282DCu)

/** Alias (User Manual Name) for GTM_DPLL_DLA23.
* To use register names with standard convension, please use GTM_DPLL_DLA23.
*/
#define	GTM_DLA23	(GTM_DPLL_DLA23)

/** \\brief  282E0, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA24 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282E0u)

/** Alias (User Manual Name) for GTM_DPLL_DLA24.
* To use register names with standard convension, please use GTM_DPLL_DLA24.
*/
#define	GTM_DLA24	(GTM_DPLL_DLA24)

/** \\brief  282E4, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA25 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282E4u)

/** Alias (User Manual Name) for GTM_DPLL_DLA25.
* To use register names with standard convension, please use GTM_DPLL_DLA25.
*/
#define	GTM_DLA25	(GTM_DPLL_DLA25)

/** \\brief  282E8, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA26 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282E8u)

/** Alias (User Manual Name) for GTM_DPLL_DLA26.
* To use register names with standard convension, please use GTM_DPLL_DLA26.
*/
#define	GTM_DLA26	(GTM_DPLL_DLA26)

/** \\brief  282EC, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA27 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282ECu)

/** Alias (User Manual Name) for GTM_DPLL_DLA27.
* To use register names with standard convension, please use GTM_DPLL_DLA27.
*/
#define	GTM_DLA27	(GTM_DPLL_DLA27)

/** \\brief  282F0, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA28 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282F0u)

/** Alias (User Manual Name) for GTM_DPLL_DLA28.
* To use register names with standard convension, please use GTM_DPLL_DLA28.
*/
#define	GTM_DLA28	(GTM_DPLL_DLA28)

/** \\brief  282F4, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA29 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282F4u)

/** Alias (User Manual Name) for GTM_DPLL_DLA29.
* To use register names with standard convension, please use GTM_DPLL_DLA29.
*/
#define	GTM_DLA29	(GTM_DPLL_DLA29)

/** \\brief  2828C, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA3 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF012828Cu)

/** Alias (User Manual Name) for GTM_DPLL_DLA3.
* To use register names with standard convension, please use GTM_DPLL_DLA3.
*/
#define	GTM_DLA3	(GTM_DPLL_DLA3)

/** \\brief  282F8, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA30 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282F8u)

/** Alias (User Manual Name) for GTM_DPLL_DLA30.
* To use register names with standard convension, please use GTM_DPLL_DLA30.
*/
#define	GTM_DLA30	(GTM_DPLL_DLA30)

/** \\brief  282FC, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA31 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282FCu)

/** Alias (User Manual Name) for GTM_DPLL_DLA31.
* To use register names with standard convension, please use GTM_DPLL_DLA31.
*/
#define	GTM_DLA31	(GTM_DPLL_DLA31)

/** \\brief  28290, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA4 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF0128290u)

/** Alias (User Manual Name) for GTM_DPLL_DLA4.
* To use register names with standard convension, please use GTM_DPLL_DLA4.
*/
#define	GTM_DLA4	(GTM_DPLL_DLA4)

/** \\brief  28294, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA5 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF0128294u)

/** Alias (User Manual Name) for GTM_DPLL_DLA5.
* To use register names with standard convension, please use GTM_DPLL_DLA5.
*/
#define	GTM_DLA5	(GTM_DPLL_DLA5)

/** \\brief  28298, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA6 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF0128298u)

/** Alias (User Manual Name) for GTM_DPLL_DLA6.
* To use register names with standard convension, please use GTM_DPLL_DLA6.
*/
#define	GTM_DLA6	(GTM_DPLL_DLA6)

/** \\brief  2829C, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA7 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF012829Cu)

/** Alias (User Manual Name) for GTM_DPLL_DLA7.
* To use register names with standard convension, please use GTM_DPLL_DLA7.
*/
#define	GTM_DLA7	(GTM_DPLL_DLA7)

/** \\brief  282A0, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA8 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282A0u)

/** Alias (User Manual Name) for GTM_DPLL_DLA8.
* To use register names with standard convension, please use GTM_DPLL_DLA8.
*/
#define	GTM_DLA8	(GTM_DPLL_DLA8)

/** \\brief  282A4, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA9 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282A4u)

/** Alias (User Manual Name) for GTM_DPLL_DLA9.
* To use register names with standard convension, please use GTM_DPLL_DLA9.
*/
#define	GTM_DLA9	(GTM_DPLL_DLA9)

/** \\brief  28900, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S0 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128900u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S0.
* To use register names with standard convension, please use GTM_DPLL_DT_S0.
*/
#define	GTM_DT_S0	(GTM_DPLL_DT_S0)

/** \\brief  28904, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128904u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S1.
* To use register names with standard convension, please use GTM_DPLL_DT_S1.
*/
#define	GTM_DT_S1	(GTM_DPLL_DT_S1)

