keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  28928, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S10 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128928u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S10.
* To use register names with standard convension, please use GTM_DPLL_DT_S10.
*/
#define	GTM_DT_S10	(GTM_DPLL_DT_S10)

/** \\brief  2892C, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S11 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF012892Cu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S11.
* To use register names with standard convension, please use GTM_DPLL_DT_S11.
*/
#define	GTM_DT_S11	(GTM_DPLL_DT_S11)

/** \\brief  28930, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S12 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128930u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S12.
* To use register names with standard convension, please use GTM_DPLL_DT_S12.
*/
#define	GTM_DT_S12	(GTM_DPLL_DT_S12)

/** \\brief  28934, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S13 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128934u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S13.
* To use register names with standard convension, please use GTM_DPLL_DT_S13.
*/
#define	GTM_DT_S13	(GTM_DPLL_DT_S13)

/** \\brief  28938, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S14 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128938u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S14.
* To use register names with standard convension, please use GTM_DPLL_DT_S14.
*/
#define	GTM_DT_S14	(GTM_DPLL_DT_S14)

/** \\brief  2893C, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S15 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF012893Cu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S15.
* To use register names with standard convension, please use GTM_DPLL_DT_S15.
*/
#define	GTM_DT_S15	(GTM_DPLL_DT_S15)

/** \\brief  28940, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S16 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128940u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S16.
* To use register names with standard convension, please use GTM_DPLL_DT_S16.
*/
#define	GTM_DT_S16	(GTM_DPLL_DT_S16)

/** \\brief  28944, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S17 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128944u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S17.
* To use register names with standard convension, please use GTM_DPLL_DT_S17.
*/
#define	GTM_DT_S17	(GTM_DPLL_DT_S17)

/** \\brief  28948, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S18 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128948u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S18.
* To use register names with standard convension, please use GTM_DPLL_DT_S18.
*/
#define	GTM_DT_S18	(GTM_DPLL_DT_S18)

/** \\brief  2894C, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S19 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF012894Cu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S19.
* To use register names with standard convension, please use GTM_DPLL_DT_S19.
*/
#define	GTM_DT_S19	(GTM_DPLL_DT_S19)

/** \\brief  28908, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128908u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S2.
* To use register names with standard convension, please use GTM_DPLL_DT_S2.
*/
#define	GTM_DT_S2	(GTM_DPLL_DT_S2)

/** \\brief  28950, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S20 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128950u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S20.
* To use register names with standard convension, please use GTM_DPLL_DT_S20.
*/
#define	GTM_DT_S20	(GTM_DPLL_DT_S20)

/** \\brief  28954, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S21 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128954u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S21.
* To use register names with standard convension, please use GTM_DPLL_DT_S21.
*/
#define	GTM_DT_S21	(GTM_DPLL_DT_S21)

/** \\brief  28958, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S22 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128958u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S22.
* To use register names with standard convension, please use GTM_DPLL_DT_S22.
*/
#define	GTM_DT_S22	(GTM_DPLL_DT_S22)

/** \\brief  2895C, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S23 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF012895Cu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S23.
* To use register names with standard convension, please use GTM_DPLL_DT_S23.
*/
#define	GTM_DT_S23	(GTM_DPLL_DT_S23)

/** \\brief  28960, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S24 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128960u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S24.
* To use register names with standard convension, please use GTM_DPLL_DT_S24.
*/
#define	GTM_DT_S24	(GTM_DPLL_DT_S24)

/** \\brief  28964, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S25 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128964u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S25.
* To use register names with standard convension, please use GTM_DPLL_DT_S25.
*/
#define	GTM_DT_S25	(GTM_DPLL_DT_S25)

/** \\brief  28968, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S26 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128968u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S26.
* To use register names with standard convension, please use GTM_DPLL_DT_S26.
*/
#define	GTM_DT_S26	(GTM_DPLL_DT_S26)

/** \\brief  2896C, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S27 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF012896Cu)

