keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_DPLL_DT_S27.
* To use register names with standard convension, please use GTM_DPLL_DT_S27.
*/
#define	GTM_DT_S27	(GTM_DPLL_DT_S27)

/** \\brief  28970, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S28 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128970u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S28.
* To use register names with standard convension, please use GTM_DPLL_DT_S28.
*/
#define	GTM_DT_S28	(GTM_DPLL_DT_S28)

/** \\brief  28974, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S29 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128974u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S29.
* To use register names with standard convension, please use GTM_DPLL_DT_S29.
*/
#define	GTM_DT_S29	(GTM_DPLL_DT_S29)

/** \\brief  2890C, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S3 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF012890Cu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S3.
* To use register names with standard convension, please use GTM_DPLL_DT_S3.
*/
#define	GTM_DT_S3	(GTM_DPLL_DT_S3)

/** \\brief  28978, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S30 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128978u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S30.
* To use register names with standard convension, please use GTM_DPLL_DT_S30.
*/
#define	GTM_DT_S30	(GTM_DPLL_DT_S30)

/** \\brief  2897C, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S31 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF012897Cu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S31.
* To use register names with standard convension, please use GTM_DPLL_DT_S31.
*/
#define	GTM_DT_S31	(GTM_DPLL_DT_S31)

/** \\brief  28980, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S32 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128980u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S32.
* To use register names with standard convension, please use GTM_DPLL_DT_S32.
*/
#define	GTM_DT_S32	(GTM_DPLL_DT_S32)

/** \\brief  28984, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S33 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128984u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S33.
* To use register names with standard convension, please use GTM_DPLL_DT_S33.
*/
#define	GTM_DT_S33	(GTM_DPLL_DT_S33)

/** \\brief  28988, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S34 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128988u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S34.
* To use register names with standard convension, please use GTM_DPLL_DT_S34.
*/
#define	GTM_DT_S34	(GTM_DPLL_DT_S34)

/** \\brief  2898C, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S35 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF012898Cu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S35.
* To use register names with standard convension, please use GTM_DPLL_DT_S35.
*/
#define	GTM_DT_S35	(GTM_DPLL_DT_S35)

/** \\brief  28990, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S36 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128990u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S36.
* To use register names with standard convension, please use GTM_DPLL_DT_S36.
*/
#define	GTM_DT_S36	(GTM_DPLL_DT_S36)

/** \\brief  28994, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S37 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128994u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S37.
* To use register names with standard convension, please use GTM_DPLL_DT_S37.
*/
#define	GTM_DT_S37	(GTM_DPLL_DT_S37)

/** \\brief  28998, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S38 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128998u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S38.
* To use register names with standard convension, please use GTM_DPLL_DT_S38.
*/
#define	GTM_DT_S38	(GTM_DPLL_DT_S38)

/** \\brief  2899C, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S39 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF012899Cu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S39.
* To use register names with standard convension, please use GTM_DPLL_DT_S39.
*/
#define	GTM_DT_S39	(GTM_DPLL_DT_S39)

/** \\brief  28910, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S4 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128910u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S4.
* To use register names with standard convension, please use GTM_DPLL_DT_S4.
*/
#define	GTM_DT_S4	(GTM_DPLL_DT_S4)

/** \\brief  289A0, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S40 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289A0u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S40.
* To use register names with standard convension, please use GTM_DPLL_DT_S40.
*/
#define	GTM_DT_S40	(GTM_DPLL_DT_S40)

/** \\brief  289A4, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S41 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289A4u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S41.
* To use register names with standard convension, please use GTM_DPLL_DT_S41.
*/
#define	GTM_DT_S41	(GTM_DPLL_DT_S41)

/** \\brief  289A8, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S42 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289A8u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S42.
* To use register names with standard convension, please use GTM_DPLL_DT_S42.
*/
#define	GTM_DT_S42	(GTM_DPLL_DT_S42)

/** \\brief  289AC, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S43 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289ACu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S43.
* To use register names with standard convension, please use GTM_DPLL_DT_S43.
*/
#define	GTM_DT_S43	(GTM_DPLL_DT_S43)

/** \\brief  289B0, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S44 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289B0u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S44.
* To use register names with standard convension, please use GTM_DPLL_DT_S44.
*/
#define	GTM_DT_S44	(GTM_DPLL_DT_S44)

