keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  289B4, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S45 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289B4u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S45.
* To use register names with standard convension, please use GTM_DPLL_DT_S45.
*/
#define	GTM_DT_S45	(GTM_DPLL_DT_S45)

/** \\brief  289B8, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S46 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289B8u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S46.
* To use register names with standard convension, please use GTM_DPLL_DT_S46.
*/
#define	GTM_DT_S46	(GTM_DPLL_DT_S46)

/** \\brief  289BC, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S47 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289BCu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S47.
* To use register names with standard convension, please use GTM_DPLL_DT_S47.
*/
#define	GTM_DT_S47	(GTM_DPLL_DT_S47)

/** \\brief  289C0, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S48 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289C0u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S48.
* To use register names with standard convension, please use GTM_DPLL_DT_S48.
*/
#define	GTM_DT_S48	(GTM_DPLL_DT_S48)

/** \\brief  289C4, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S49 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289C4u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S49.
* To use register names with standard convension, please use GTM_DPLL_DT_S49.
*/
#define	GTM_DT_S49	(GTM_DPLL_DT_S49)

/** \\brief  28914, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S5 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128914u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S5.
* To use register names with standard convension, please use GTM_DPLL_DT_S5.
*/
#define	GTM_DT_S5	(GTM_DPLL_DT_S5)

/** \\brief  289C8, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S50 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289C8u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S50.
* To use register names with standard convension, please use GTM_DPLL_DT_S50.
*/
#define	GTM_DT_S50	(GTM_DPLL_DT_S50)

/** \\brief  289CC, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S51 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289CCu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S51.
* To use register names with standard convension, please use GTM_DPLL_DT_S51.
*/
#define	GTM_DT_S51	(GTM_DPLL_DT_S51)

/** \\brief  289D0, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S52 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289D0u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S52.
* To use register names with standard convension, please use GTM_DPLL_DT_S52.
*/
#define	GTM_DT_S52	(GTM_DPLL_DT_S52)

/** \\brief  289D4, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S53 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289D4u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S53.
* To use register names with standard convension, please use GTM_DPLL_DT_S53.
*/
#define	GTM_DT_S53	(GTM_DPLL_DT_S53)

/** \\brief  289D8, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S54 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289D8u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S54.
* To use register names with standard convension, please use GTM_DPLL_DT_S54.
*/
#define	GTM_DT_S54	(GTM_DPLL_DT_S54)

/** \\brief  289DC, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S55 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289DCu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S55.
* To use register names with standard convension, please use GTM_DPLL_DT_S55.
*/
#define	GTM_DT_S55	(GTM_DPLL_DT_S55)

/** \\brief  289E0, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S56 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289E0u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S56.
* To use register names with standard convension, please use GTM_DPLL_DT_S56.
*/
#define	GTM_DT_S56	(GTM_DPLL_DT_S56)

/** \\brief  289E4, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S57 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289E4u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S57.
* To use register names with standard convension, please use GTM_DPLL_DT_S57.
*/
#define	GTM_DT_S57	(GTM_DPLL_DT_S57)

/** \\brief  289E8, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S58 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289E8u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S58.
* To use register names with standard convension, please use GTM_DPLL_DT_S58.
*/
#define	GTM_DT_S58	(GTM_DPLL_DT_S58)

/** \\brief  289EC, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S59 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289ECu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S59.
* To use register names with standard convension, please use GTM_DPLL_DT_S59.
*/
#define	GTM_DT_S59	(GTM_DPLL_DT_S59)

/** \\brief  28918, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S6 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128918u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S6.
* To use register names with standard convension, please use GTM_DPLL_DT_S6.
*/
#define	GTM_DT_S6	(GTM_DPLL_DT_S6)

/** \\brief  289F0, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S60 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289F0u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S60.
* To use register names with standard convension, please use GTM_DPLL_DT_S60.
*/
#define	GTM_DT_S60	(GTM_DPLL_DT_S60)

/** \\brief  289F4, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S61 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289F4u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S61.
* To use register names with standard convension, please use GTM_DPLL_DT_S61.
*/
#define	GTM_DT_S61	(GTM_DPLL_DT_S61)

/** \\brief  289F8, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S62 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289F8u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S62.
* To use register names with standard convension, please use GTM_DPLL_DT_S62.
*/
#define	GTM_DT_S62	(GTM_DPLL_DT_S62)

/** \\brief  289FC, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S63 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289FCu)

