keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_DPLL_DT_S63.
* To use register names with standard convension, please use GTM_DPLL_DT_S63.
*/
#define	GTM_DT_S63	(GTM_DPLL_DT_S63)

/** \\brief  2891C, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S7 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF012891Cu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S7.
* To use register names with standard convension, please use GTM_DPLL_DT_S7.
*/
#define	GTM_DT_S7	(GTM_DPLL_DT_S7)

/** \\brief  28920, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S8 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128920u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S8.
* To use register names with standard convension, please use GTM_DPLL_DT_S8.
*/
#define	GTM_DT_S8	(GTM_DPLL_DT_S8)

/** \\brief  28924, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S9 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128924u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S9.
* To use register names with standard convension, please use GTM_DPLL_DT_S9.
*/
#define	GTM_DT_S9	(GTM_DPLL_DT_S9)

/** \\brief  2847C, Duration of Last STATE Increment [DT_S_ACT] */
#define GTM_DPLL_DT_S_ACT /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S_ACT*)0xF012847Cu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S_ACT.
* To use register names with standard convension, please use GTM_DPLL_DT_S_ACT.
*/
#define	GTM_DT_S_ACT	(GTM_DPLL_DT_S_ACT)

/** \\brief  28478, Duration of Last TRIGGER Increment */
#define GTM_DPLL_DT_T_ACT /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_T_ACT*)0xF0128478u)

/** Alias (User Manual Name) for GTM_DPLL_DT_T_ACT.
* To use register names with standard convension, please use GTM_DPLL_DT_T_ACT.
*/
#define	GTM_DT_T_ACT	(GTM_DPLL_DT_T_ACT)

/** \\brief  28380, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA0 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF0128380u)

/** Alias (User Manual Name) for GTM_DPLL_DTA0.
* To use register names with standard convension, please use GTM_DPLL_DTA0.
*/
#define	GTM_DTA0	(GTM_DPLL_DTA0)

/** \\brief  28384, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF0128384u)

/** Alias (User Manual Name) for GTM_DPLL_DTA1.
* To use register names with standard convension, please use GTM_DPLL_DTA1.
*/
#define	GTM_DTA1	(GTM_DPLL_DTA1)

/** \\brief  283A8, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA10 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283A8u)

/** Alias (User Manual Name) for GTM_DPLL_DTA10.
* To use register names with standard convension, please use GTM_DPLL_DTA10.
*/
#define	GTM_DTA10	(GTM_DPLL_DTA10)

/** \\brief  283AC, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA11 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283ACu)

/** Alias (User Manual Name) for GTM_DPLL_DTA11.
* To use register names with standard convension, please use GTM_DPLL_DTA11.
*/
#define	GTM_DTA11	(GTM_DPLL_DTA11)

/** \\brief  283B0, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA12 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283B0u)

/** Alias (User Manual Name) for GTM_DPLL_DTA12.
* To use register names with standard convension, please use GTM_DPLL_DTA12.
*/
#define	GTM_DTA12	(GTM_DPLL_DTA12)

/** \\brief  283B4, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA13 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283B4u)

/** Alias (User Manual Name) for GTM_DPLL_DTA13.
* To use register names with standard convension, please use GTM_DPLL_DTA13.
*/
#define	GTM_DTA13	(GTM_DPLL_DTA13)

/** \\brief  283B8, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA14 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283B8u)

/** Alias (User Manual Name) for GTM_DPLL_DTA14.
* To use register names with standard convension, please use GTM_DPLL_DTA14.
*/
#define	GTM_DTA14	(GTM_DPLL_DTA14)

/** \\brief  283BC, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA15 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283BCu)

/** Alias (User Manual Name) for GTM_DPLL_DTA15.
* To use register names with standard convension, please use GTM_DPLL_DTA15.
*/
#define	GTM_DTA15	(GTM_DPLL_DTA15)

/** \\brief  283C0, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA16 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283C0u)

/** Alias (User Manual Name) for GTM_DPLL_DTA16.
* To use register names with standard convension, please use GTM_DPLL_DTA16.
*/
#define	GTM_DTA16	(GTM_DPLL_DTA16)

/** \\brief  283C4, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA17 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283C4u)

/** Alias (User Manual Name) for GTM_DPLL_DTA17.
* To use register names with standard convension, please use GTM_DPLL_DTA17.
*/
#define	GTM_DTA17	(GTM_DPLL_DTA17)

/** \\brief  283C8, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA18 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283C8u)

/** Alias (User Manual Name) for GTM_DPLL_DTA18.
* To use register names with standard convension, please use GTM_DPLL_DTA18.
*/
#define	GTM_DTA18	(GTM_DPLL_DTA18)

/** \\brief  283CC, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA19 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283CCu)

/** Alias (User Manual Name) for GTM_DPLL_DTA19.
* To use register names with standard convension, please use GTM_DPLL_DTA19.
*/
#define	GTM_DTA19	(GTM_DPLL_DTA19)

/** \\brief  28388, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF0128388u)

/** Alias (User Manual Name) for GTM_DPLL_DTA2.
* To use register names with standard convension, please use GTM_DPLL_DTA2.
*/
#define	GTM_DTA2	(GTM_DPLL_DTA2)

/** \\brief  283D0, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA20 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283D0u)

