keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_DPLL_DTA20.
* To use register names with standard convension, please use GTM_DPLL_DTA20.
*/
#define	GTM_DTA20	(GTM_DPLL_DTA20)

/** \\brief  283D4, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA21 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283D4u)

/** Alias (User Manual Name) for GTM_DPLL_DTA21.
* To use register names with standard convension, please use GTM_DPLL_DTA21.
*/
#define	GTM_DTA21	(GTM_DPLL_DTA21)

/** \\brief  283D8, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA22 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283D8u)

/** Alias (User Manual Name) for GTM_DPLL_DTA22.
* To use register names with standard convension, please use GTM_DPLL_DTA22.
*/
#define	GTM_DTA22	(GTM_DPLL_DTA22)

/** \\brief  283DC, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA23 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283DCu)

/** Alias (User Manual Name) for GTM_DPLL_DTA23.
* To use register names with standard convension, please use GTM_DPLL_DTA23.
*/
#define	GTM_DTA23	(GTM_DPLL_DTA23)

/** \\brief  283E0, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA24 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283E0u)

/** Alias (User Manual Name) for GTM_DPLL_DTA24.
* To use register names with standard convension, please use GTM_DPLL_DTA24.
*/
#define	GTM_DTA24	(GTM_DPLL_DTA24)

/** \\brief  283E4, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA25 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283E4u)

/** Alias (User Manual Name) for GTM_DPLL_DTA25.
* To use register names with standard convension, please use GTM_DPLL_DTA25.
*/
#define	GTM_DTA25	(GTM_DPLL_DTA25)

/** \\brief  283E8, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA26 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283E8u)

/** Alias (User Manual Name) for GTM_DPLL_DTA26.
* To use register names with standard convension, please use GTM_DPLL_DTA26.
*/
#define	GTM_DTA26	(GTM_DPLL_DTA26)

/** \\brief  283EC, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA27 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283ECu)

/** Alias (User Manual Name) for GTM_DPLL_DTA27.
* To use register names with standard convension, please use GTM_DPLL_DTA27.
*/
#define	GTM_DTA27	(GTM_DPLL_DTA27)

/** \\brief  283F0, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA28 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283F0u)

/** Alias (User Manual Name) for GTM_DPLL_DTA28.
* To use register names with standard convension, please use GTM_DPLL_DTA28.
*/
#define	GTM_DTA28	(GTM_DPLL_DTA28)

/** \\brief  283F4, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA29 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283F4u)

/** Alias (User Manual Name) for GTM_DPLL_DTA29.
* To use register names with standard convension, please use GTM_DPLL_DTA29.
*/
#define	GTM_DTA29	(GTM_DPLL_DTA29)

/** \\brief  2838C, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA3 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF012838Cu)

/** Alias (User Manual Name) for GTM_DPLL_DTA3.
* To use register names with standard convension, please use GTM_DPLL_DTA3.
*/
#define	GTM_DTA3	(GTM_DPLL_DTA3)

/** \\brief  283F8, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA30 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283F8u)

/** Alias (User Manual Name) for GTM_DPLL_DTA30.
* To use register names with standard convension, please use GTM_DPLL_DTA30.
*/
#define	GTM_DTA30	(GTM_DPLL_DTA30)

/** \\brief  283FC, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA31 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283FCu)

/** Alias (User Manual Name) for GTM_DPLL_DTA31.
* To use register names with standard convension, please use GTM_DPLL_DTA31.
*/
#define	GTM_DTA31	(GTM_DPLL_DTA31)

/** \\brief  28390, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA4 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF0128390u)

/** Alias (User Manual Name) for GTM_DPLL_DTA4.
* To use register names with standard convension, please use GTM_DPLL_DTA4.
*/
#define	GTM_DTA4	(GTM_DPLL_DTA4)

/** \\brief  28394, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA5 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF0128394u)

/** Alias (User Manual Name) for GTM_DPLL_DTA5.
* To use register names with standard convension, please use GTM_DPLL_DTA5.
*/
#define	GTM_DTA5	(GTM_DPLL_DTA5)

/** \\brief  28398, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA6 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF0128398u)

/** Alias (User Manual Name) for GTM_DPLL_DTA6.
* To use register names with standard convension, please use GTM_DPLL_DTA6.
*/
#define	GTM_DTA6	(GTM_DPLL_DTA6)

/** \\brief  2839C, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA7 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF012839Cu)

/** Alias (User Manual Name) for GTM_DPLL_DTA7.
* To use register names with standard convension, please use GTM_DPLL_DTA7.
*/
#define	GTM_DTA7	(GTM_DPLL_DTA7)

/** \\brief  283A0, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA8 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283A0u)

/** Alias (User Manual Name) for GTM_DPLL_DTA8.
* To use register names with standard convension, please use GTM_DPLL_DTA8.
*/
#define	GTM_DTA8	(GTM_DPLL_DTA8)

/** \\brief  283A4, Calculated Relat0ve Time To ACTION_i Register */
#define GTM_DPLL_DTA9 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283A4u)

/** Alias (User Manual Name) for GTM_DPLL_DTA9.
* To use register names with standard convension, please use GTM_DPLL_DTA9.
*/
#define	GTM_DTA9	(GTM_DPLL_DTA9)

/** \\brief  28488, Difference of Prediction to actual value for Last STATE
 * Increment */
#define GTM_DPLL_EDT_S /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_EDT_S*)0xF0128488u)

/** Alias (User Manual Name) for GTM_DPLL_EDT_S.
* To use register names with standard convension, please use GTM_DPLL_EDT_S.
*/
#define	GTM_EDT_S	(GTM_DPLL_EDT_S)

/** \\brief  28480, Difference of prediction to actual value of the last TRIGGER
 * increment */
#define GTM_DPLL_EDT_T /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_EDT_T*)0xF0128480u)

/** Alias (User Manual Name) for GTM_DPLL_EDT_T.
* To use register names with standard convension, please use GTM_DPLL_EDT_T.
*/
#define	GTM_EDT_T	(GTM_DPLL_EDT_T)

/** \\brief  28050, DPLL Error Interrupt Enable Register */
#define GTM_DPLL_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_EIRQ_EN*)0xF0128050u)

