keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  28048, DPLL Interrupt Force Register */
#define GTM_DPLL_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_IRQ_FORCINT*)0xF0128048u)

/** \\brief  2804C, DPLL Interrupt Mode Register */
#define GTM_DPLL_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_IRQ_MODE*)0xF012804Cu)

/** \\brief  28040, DPLL Interrupt Notification Register */
#define GTM_DPLL_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_IRQ_NOTIFY*)0xF0128040u)

/** \\brief  2848C, Weighted difference of Prediction up to the Last STATE
 * Increment */
#define GTM_DPLL_MEDT_S /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_MEDT_S*)0xF012848Cu)

/** Alias (User Manual Name) for GTM_DPLL_MEDT_S.
* To use register names with standard convension, please use GTM_DPLL_MEDT_S.
*/
#define	GTM_MEDT_S	(GTM_DPLL_MEDT_S)

/** \\brief  28484, Weighted difference of Prediction up to the Last TRIGGER
 * Increment */
#define GTM_DPLL_MEDT_T /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_MEDT_T*)0xF0128484u)

/** Alias (User Manual Name) for GTM_DPLL_MEDT_T.
* To use register names with standard convension, please use GTM_DPLL_MEDT_T.
*/
#define	GTM_MEDT_T	(GTM_DPLL_MEDT_T)

/** \\brief  285C0, Calculated Number of Sub-Pulses between Two STATE Events */
#define GTM_DPLL_MLS1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_MLS1*)0xF01285C0u)

/** Alias (User Manual Name) for GTM_DPLL_MLS1.
* To use register names with standard convension, please use GTM_DPLL_MLS1.
*/
#define	GTM_MLS1	(GTM_DPLL_MLS1)

/** \\brief  285C4, Calculated Number of Sub-Pulses between Two STATE Events */
#define GTM_DPLL_MLS2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_MLS2*)0xF01285C4u)

/** Alias (User Manual Name) for GTM_DPLL_MLS2.
* To use register names with standard convension, please use GTM_DPLL_MLS2.
*/
#define	GTM_MLS2	(GTM_DPLL_MLS2)

/** \\brief  28440, Missing Pulses to be Added/Subtracted Directly to SUB_INC1
 * and INC_CNT1 Once */
#define GTM_DPLL_MPVAL1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_MPVAL1*)0xF0128440u)

/** Alias (User Manual Name) for GTM_DPLL_MPVAL1.
* To use register names with standard convension, please use GTM_DPLL_MPVAL1.
*/
#define	GTM_MPVAL1	(GTM_DPLL_MPVAL1)

/** \\brief  28444, Missing Pulses to be Added/Subtracted Directly to SUB_INC2
 * and INC_CNT2 Once */
#define GTM_DPLL_MPVAL2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_MPVAL2*)0xF0128444u)

/** Alias (User Manual Name) for GTM_DPLL_MPVAL2.
* To use register names with standard convension, please use GTM_DPLL_MPVAL2.
*/
#define	GTM_MPVAL2	(GTM_DPLL_MPVAL2)

/** \\brief  28300, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA0 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128300u)

/** Alias (User Manual Name) for GTM_DPLL_NA0.
* To use register names with standard convension, please use GTM_DPLL_NA0.
*/
#define	GTM_NA0	(GTM_DPLL_NA0)

/** \\brief  28304, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128304u)

/** Alias (User Manual Name) for GTM_DPLL_NA1.
* To use register names with standard convension, please use GTM_DPLL_NA1.
*/
#define	GTM_NA1	(GTM_DPLL_NA1)

/** \\brief  28328, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA10 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128328u)

/** Alias (User Manual Name) for GTM_DPLL_NA10.
* To use register names with standard convension, please use GTM_DPLL_NA10.
*/
#define	GTM_NA10	(GTM_DPLL_NA10)

/** \\brief  2832C, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA11 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF012832Cu)

/** Alias (User Manual Name) for GTM_DPLL_NA11.
* To use register names with standard convension, please use GTM_DPLL_NA11.
*/
#define	GTM_NA11	(GTM_DPLL_NA11)

/** \\brief  28330, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA12 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128330u)

/** Alias (User Manual Name) for GTM_DPLL_NA12.
* To use register names with standard convension, please use GTM_DPLL_NA12.
*/
#define	GTM_NA12	(GTM_DPLL_NA12)

/** \\brief  28334, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA13 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128334u)

/** Alias (User Manual Name) for GTM_DPLL_NA13.
* To use register names with standard convension, please use GTM_DPLL_NA13.
*/
#define	GTM_NA13	(GTM_DPLL_NA13)

/** \\brief  28338, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA14 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128338u)

/** Alias (User Manual Name) for GTM_DPLL_NA14.
* To use register names with standard convension, please use GTM_DPLL_NA14.
*/
#define	GTM_NA14	(GTM_DPLL_NA14)

/** \\brief  2833C, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA15 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF012833Cu)

/** Alias (User Manual Name) for GTM_DPLL_NA15.
* To use register names with standard convension, please use GTM_DPLL_NA15.
*/
#define	GTM_NA15	(GTM_DPLL_NA15)

/** \\brief  28340, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA16 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128340u)

/** Alias (User Manual Name) for GTM_DPLL_NA16.
* To use register names with standard convension, please use GTM_DPLL_NA16.
*/
#define	GTM_NA16	(GTM_DPLL_NA16)

/** \\brief  28344, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA17 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128344u)

/** Alias (User Manual Name) for GTM_DPLL_NA17.
* To use register names with standard convension, please use GTM_DPLL_NA17.
*/
#define	GTM_NA17	(GTM_DPLL_NA17)

/** \\brief  28348, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA18 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128348u)

/** Alias (User Manual Name) for GTM_DPLL_NA18.
* To use register names with standard convension, please use GTM_DPLL_NA18.
*/
#define	GTM_NA18	(GTM_DPLL_NA18)

/** \\brief  2834C, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA19 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF012834Cu)

