keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_DPLL_NA19.
* To use register names with standard convension, please use GTM_DPLL_NA19.
*/
#define	GTM_NA19	(GTM_DPLL_NA19)

/** \\brief  28308, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128308u)

/** Alias (User Manual Name) for GTM_DPLL_NA2.
* To use register names with standard convension, please use GTM_DPLL_NA2.
*/
#define	GTM_NA2	(GTM_DPLL_NA2)

/** \\brief  28350, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA20 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128350u)

/** Alias (User Manual Name) for GTM_DPLL_NA20.
* To use register names with standard convension, please use GTM_DPLL_NA20.
*/
#define	GTM_NA20	(GTM_DPLL_NA20)

/** \\brief  28354, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA21 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128354u)

/** Alias (User Manual Name) for GTM_DPLL_NA21.
* To use register names with standard convension, please use GTM_DPLL_NA21.
*/
#define	GTM_NA21	(GTM_DPLL_NA21)

/** \\brief  28358, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA22 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128358u)

/** Alias (User Manual Name) for GTM_DPLL_NA22.
* To use register names with standard convension, please use GTM_DPLL_NA22.
*/
#define	GTM_NA22	(GTM_DPLL_NA22)

/** \\brief  2835C, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA23 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF012835Cu)

/** Alias (User Manual Name) for GTM_DPLL_NA23.
* To use register names with standard convension, please use GTM_DPLL_NA23.
*/
#define	GTM_NA23	(GTM_DPLL_NA23)

/** \\brief  28360, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA24 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128360u)

/** Alias (User Manual Name) for GTM_DPLL_NA24.
* To use register names with standard convension, please use GTM_DPLL_NA24.
*/
#define	GTM_NA24	(GTM_DPLL_NA24)

/** \\brief  28364, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA25 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128364u)

/** Alias (User Manual Name) for GTM_DPLL_NA25.
* To use register names with standard convension, please use GTM_DPLL_NA25.
*/
#define	GTM_NA25	(GTM_DPLL_NA25)

/** \\brief  28368, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA26 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128368u)

/** Alias (User Manual Name) for GTM_DPLL_NA26.
* To use register names with standard convension, please use GTM_DPLL_NA26.
*/
#define	GTM_NA26	(GTM_DPLL_NA26)

/** \\brief  2836C, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA27 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF012836Cu)

/** Alias (User Manual Name) for GTM_DPLL_NA27.
* To use register names with standard convension, please use GTM_DPLL_NA27.
*/
#define	GTM_NA27	(GTM_DPLL_NA27)

/** \\brief  28370, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA28 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128370u)

/** Alias (User Manual Name) for GTM_DPLL_NA28.
* To use register names with standard convension, please use GTM_DPLL_NA28.
*/
#define	GTM_NA28	(GTM_DPLL_NA28)

/** \\brief  28374, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA29 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128374u)

/** Alias (User Manual Name) for GTM_DPLL_NA29.
* To use register names with standard convension, please use GTM_DPLL_NA29.
*/
#define	GTM_NA29	(GTM_DPLL_NA29)

/** \\brief  2830C, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA3 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF012830Cu)

/** Alias (User Manual Name) for GTM_DPLL_NA3.
* To use register names with standard convension, please use GTM_DPLL_NA3.
*/
#define	GTM_NA3	(GTM_DPLL_NA3)

/** \\brief  28378, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA30 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128378u)

/** Alias (User Manual Name) for GTM_DPLL_NA30.
* To use register names with standard convension, please use GTM_DPLL_NA30.
*/
#define	GTM_NA30	(GTM_DPLL_NA30)

/** \\brief  2837C, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA31 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF012837Cu)

/** Alias (User Manual Name) for GTM_DPLL_NA31.
* To use register names with standard convension, please use GTM_DPLL_NA31.
*/
#define	GTM_NA31	(GTM_DPLL_NA31)

/** \\brief  28310, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA4 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128310u)

/** Alias (User Manual Name) for GTM_DPLL_NA4.
* To use register names with standard convension, please use GTM_DPLL_NA4.
*/
#define	GTM_NA4	(GTM_DPLL_NA4)

/** \\brief  28314, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA5 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128314u)

/** Alias (User Manual Name) for GTM_DPLL_NA5.
* To use register names with standard convension, please use GTM_DPLL_NA5.
*/
#define	GTM_NA5	(GTM_DPLL_NA5)

/** \\brief  28318, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA6 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128318u)

/** Alias (User Manual Name) for GTM_DPLL_NA6.
* To use register names with standard convension, please use GTM_DPLL_NA6.
*/
#define	GTM_NA6	(GTM_DPLL_NA6)

/** \\brief  2831C, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA7 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF012831Cu)

/** Alias (User Manual Name) for GTM_DPLL_NA7.
* To use register names with standard convension, please use GTM_DPLL_NA7.
*/
#define	GTM_NA7	(GTM_DPLL_NA7)

/** \\brief  28320, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA8 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128320u)

/** Alias (User Manual Name) for GTM_DPLL_NA8.
* To use register names with standard convension, please use GTM_DPLL_NA8.
*/
#define	GTM_NA8	(GTM_DPLL_NA8)

/** \\brief  28324, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA9 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128324u)

