keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_DPLL_NA9.
* To use register names with standard convension, please use GTM_DPLL_NA9.
*/
#define	GTM_NA9	(GTM_DPLL_NA9)

/** \\brief  285FC, Number of Pulses of Current Increment in Emergency Mode */
#define GTM_DPLL_NMB_S /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NMB_S*)0xF01285FCu)

/** Alias (User Manual Name) for GTM_DPLL_NMB_S.
* To use register names with standard convension, please use GTM_DPLL_NMB_S.
*/
#define	GTM_NMB_S	(GTM_DPLL_NMB_S)

/** \\brief  28450, Target Number of Pulses to be sent in emergency mode
 * Register */
#define GTM_DPLL_NMB_S_TAR /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NMB_S_TAR*)0xF0128450u)

/** Alias (User Manual Name) for GTM_DPLL_NMB_S_TAR.
* To use register names with standard convension, please use GTM_DPLL_NMB_S_TAR.
*/
#define	GTM_NMB_S_TAR	(GTM_DPLL_NMB_S_TAR)

/** \\brief  28454, Target Number of Pulses to be sent in emergency mode
 * Register */
#define GTM_DPLL_NMB_S_TAR_OLD /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NMB_S_TAR_OLD*)0xF0128454u)

/** Alias (User Manual Name) for GTM_DPLL_NMB_S_TAR_OLD.
* To use register names with standard convension, please use GTM_DPLL_NMB_S_TAR_OLD.
*/
#define	GTM_NMB_S_TAR_OLD	(GTM_DPLL_NMB_S_TAR_OLD)

/** \\brief  285F8, Number of Pulses of Current Increment in Normal Mode */
#define GTM_DPLL_NMB_T /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NMB_T*)0xF01285F8u)

/** Alias (User Manual Name) for GTM_DPLL_NMB_T.
* To use register names with standard convension, please use GTM_DPLL_NMB_T.
*/
#define	GTM_NMB_T	(GTM_DPLL_NMB_T)

/** \\brief  28448, Target Number of Pulses to be sent in normal mode Register */
#define GTM_DPLL_NMB_T_TAR /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NMB_T_TAR*)0xF0128448u)

/** Alias (User Manual Name) for GTM_DPLL_NMB_T_TAR.
* To use register names with standard convension, please use GTM_DPLL_NMB_T_TAR.
*/
#define	GTM_NMB_T_TAR	(GTM_DPLL_NMB_T_TAR)

/** \\brief  2844C, Target Number of Pulses to be sent in normal mode Register */
#define GTM_DPLL_NMB_T_TAR_OLD /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NMB_T_TAR_OLD*)0xF012844Cu)

/** Alias (User Manual Name) for GTM_DPLL_NMB_T_TAR_OLD.
* To use register names with standard convension, please use GTM_DPLL_NMB_T_TAR_OLD.
*/
#define	GTM_NMB_T_TAR_OLD	(GTM_DPLL_NMB_T_TAR_OLD)

/** \\brief  2803C, DPLL Number of Active TRIGGER Events to Interrupt */
#define GTM_DPLL_NTI_CNT /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NTI_CNT*)0xF012803Cu)

/** \\brief  28038, DPLL Number of Recent STATE Events Used for Calculations */
#define GTM_DPLL_NUSC /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NUSC*)0xF0128038u)

/** \\brief  28034, DPLL Number of Recent TRIGGER Events Used for Calculations */
#define GTM_DPLL_NUTC /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NUTC*)0xF0128034u)

/** \\brief  2801C, DPLL Offset And Switch Old/New Address Register */
#define GTM_DPLL_OSW /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_OSW*)0xF012801Cu)

/** \\brief  28500, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T0 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128500u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T0.
* To use register names with standard convension, please use GTM_DPLL_PDT_T0.
*/
#define	GTM_PDT_T0	(GTM_DPLL_PDT_T0)

/** \\brief  28504, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128504u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T1.
* To use register names with standard convension, please use GTM_DPLL_PDT_T1.
*/
#define	GTM_PDT_T1	(GTM_DPLL_PDT_T1)

/** \\brief  28528, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T10 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128528u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T10.
* To use register names with standard convension, please use GTM_DPLL_PDT_T10.
*/
#define	GTM_PDT_T10	(GTM_DPLL_PDT_T10)

/** \\brief  2852C, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T11 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF012852Cu)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T11.
* To use register names with standard convension, please use GTM_DPLL_PDT_T11.
*/
#define	GTM_PDT_T11	(GTM_DPLL_PDT_T11)

/** \\brief  28530, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T12 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128530u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T12.
* To use register names with standard convension, please use GTM_DPLL_PDT_T12.
*/
#define	GTM_PDT_T12	(GTM_DPLL_PDT_T12)

/** \\brief  28534, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T13 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128534u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T13.
* To use register names with standard convension, please use GTM_DPLL_PDT_T13.
*/
#define	GTM_PDT_T13	(GTM_DPLL_PDT_T13)

/** \\brief  28538, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T14 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128538u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T14.
* To use register names with standard convension, please use GTM_DPLL_PDT_T14.
*/
#define	GTM_PDT_T14	(GTM_DPLL_PDT_T14)

/** \\brief  2853C, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T15 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF012853Cu)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T15.
* To use register names with standard convension, please use GTM_DPLL_PDT_T15.
*/
#define	GTM_PDT_T15	(GTM_DPLL_PDT_T15)

/** \\brief  28540, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T16 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128540u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T16.
* To use register names with standard convension, please use GTM_DPLL_PDT_T16.
*/
#define	GTM_PDT_T16	(GTM_DPLL_PDT_T16)

