keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  28544, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T17 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128544u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T17.
* To use register names with standard convension, please use GTM_DPLL_PDT_T17.
*/
#define	GTM_PDT_T17	(GTM_DPLL_PDT_T17)

/** \\brief  28548, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T18 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128548u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T18.
* To use register names with standard convension, please use GTM_DPLL_PDT_T18.
*/
#define	GTM_PDT_T18	(GTM_DPLL_PDT_T18)

/** \\brief  2854C, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T19 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF012854Cu)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T19.
* To use register names with standard convension, please use GTM_DPLL_PDT_T19.
*/
#define	GTM_PDT_T19	(GTM_DPLL_PDT_T19)

/** \\brief  28508, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128508u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T2.
* To use register names with standard convension, please use GTM_DPLL_PDT_T2.
*/
#define	GTM_PDT_T2	(GTM_DPLL_PDT_T2)

/** \\brief  28550, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T20 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128550u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T20.
* To use register names with standard convension, please use GTM_DPLL_PDT_T20.
*/
#define	GTM_PDT_T20	(GTM_DPLL_PDT_T20)

/** \\brief  28554, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T21 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128554u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T21.
* To use register names with standard convension, please use GTM_DPLL_PDT_T21.
*/
#define	GTM_PDT_T21	(GTM_DPLL_PDT_T21)

/** \\brief  28558, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T22 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128558u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T22.
* To use register names with standard convension, please use GTM_DPLL_PDT_T22.
*/
#define	GTM_PDT_T22	(GTM_DPLL_PDT_T22)

/** \\brief  2855C, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T23 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF012855Cu)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T23.
* To use register names with standard convension, please use GTM_DPLL_PDT_T23.
*/
#define	GTM_PDT_T23	(GTM_DPLL_PDT_T23)

/** \\brief  28560, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T24 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128560u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T24.
* To use register names with standard convension, please use GTM_DPLL_PDT_T24.
*/
#define	GTM_PDT_T24	(GTM_DPLL_PDT_T24)

/** \\brief  28564, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T25 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128564u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T25.
* To use register names with standard convension, please use GTM_DPLL_PDT_T25.
*/
#define	GTM_PDT_T25	(GTM_DPLL_PDT_T25)

/** \\brief  28568, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T26 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128568u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T26.
* To use register names with standard convension, please use GTM_DPLL_PDT_T26.
*/
#define	GTM_PDT_T26	(GTM_DPLL_PDT_T26)

/** \\brief  2856C, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T27 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF012856Cu)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T27.
* To use register names with standard convension, please use GTM_DPLL_PDT_T27.
*/
#define	GTM_PDT_T27	(GTM_DPLL_PDT_T27)

/** \\brief  28570, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T28 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128570u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T28.
* To use register names with standard convension, please use GTM_DPLL_PDT_T28.
*/
#define	GTM_PDT_T28	(GTM_DPLL_PDT_T28)

/** \\brief  28574, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T29 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128574u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T29.
* To use register names with standard convension, please use GTM_DPLL_PDT_T29.
*/
#define	GTM_PDT_T29	(GTM_DPLL_PDT_T29)

/** \\brief  2850C, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T3 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF012850Cu)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T3.
* To use register names with standard convension, please use GTM_DPLL_PDT_T3.
*/
#define	GTM_PDT_T3	(GTM_DPLL_PDT_T3)

/** \\brief  28578, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T30 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128578u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T30.
* To use register names with standard convension, please use GTM_DPLL_PDT_T30.
*/
#define	GTM_PDT_T30	(GTM_DPLL_PDT_T30)

/** \\brief  2857C, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T31 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF012857Cu)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T31.
* To use register names with standard convension, please use GTM_DPLL_PDT_T31.
*/
#define	GTM_PDT_T31	(GTM_DPLL_PDT_T31)

/** \\brief  28510, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T4 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128510u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T4.
* To use register names with standard convension, please use GTM_DPLL_PDT_T4.
*/
#define	GTM_PDT_T4	(GTM_DPLL_PDT_T4)

/** \\brief  28514, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T5 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128514u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T5.
* To use register names with standard convension, please use GTM_DPLL_PDT_T5.
*/
#define	GTM_PDT_T5	(GTM_DPLL_PDT_T5)

/** \\brief  28518, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T6 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128518u)

