keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_DPLL_PDT_T6.
* To use register names with standard convension, please use GTM_DPLL_PDT_T6.
*/
#define	GTM_PDT_T6	(GTM_DPLL_PDT_T6)

/** \\brief  2851C, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T7 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF012851Cu)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T7.
* To use register names with standard convension, please use GTM_DPLL_PDT_T7.
*/
#define	GTM_PDT_T7	(GTM_DPLL_PDT_T7)

/** \\brief  28520, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T8 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128520u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T8.
* To use register names with standard convension, please use GTM_DPLL_PDT_T8.
*/
#define	GTM_PDT_T8	(GTM_DPLL_PDT_T8)

/** \\brief  28524, Projected TRIGGER Increment Sum Relat0ons for Action_i */
#define GTM_DPLL_PDT_T9 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128524u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T9.
* To use register names with standard convension, please use GTM_DPLL_PDT_T9.
*/
#define	GTM_PDT_T9	(GTM_DPLL_PDT_T9)

/** \\brief  28200, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA0 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128200u)

/** Alias (User Manual Name) for GTM_DPLL_PSA0.
* To use register names with standard convension, please use GTM_DPLL_PSA0.
*/
#define	GTM_PSA0	(GTM_DPLL_PSA0)

/** \\brief  28204, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128204u)

/** Alias (User Manual Name) for GTM_DPLL_PSA1.
* To use register names with standard convension, please use GTM_DPLL_PSA1.
*/
#define	GTM_PSA1	(GTM_DPLL_PSA1)

/** \\brief  28228, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA10 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128228u)

/** Alias (User Manual Name) for GTM_DPLL_PSA10.
* To use register names with standard convension, please use GTM_DPLL_PSA10.
*/
#define	GTM_PSA10	(GTM_DPLL_PSA10)

/** \\brief  2822C, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA11 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF012822Cu)

/** Alias (User Manual Name) for GTM_DPLL_PSA11.
* To use register names with standard convension, please use GTM_DPLL_PSA11.
*/
#define	GTM_PSA11	(GTM_DPLL_PSA11)

/** \\brief  28230, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA12 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128230u)

/** Alias (User Manual Name) for GTM_DPLL_PSA12.
* To use register names with standard convension, please use GTM_DPLL_PSA12.
*/
#define	GTM_PSA12	(GTM_DPLL_PSA12)

/** \\brief  28234, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA13 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128234u)

/** Alias (User Manual Name) for GTM_DPLL_PSA13.
* To use register names with standard convension, please use GTM_DPLL_PSA13.
*/
#define	GTM_PSA13	(GTM_DPLL_PSA13)

/** \\brief  28238, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA14 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128238u)

/** Alias (User Manual Name) for GTM_DPLL_PSA14.
* To use register names with standard convension, please use GTM_DPLL_PSA14.
*/
#define	GTM_PSA14	(GTM_DPLL_PSA14)

/** \\brief  2823C, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA15 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF012823Cu)

/** Alias (User Manual Name) for GTM_DPLL_PSA15.
* To use register names with standard convension, please use GTM_DPLL_PSA15.
*/
#define	GTM_PSA15	(GTM_DPLL_PSA15)

/** \\brief  28240, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA16 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128240u)

/** Alias (User Manual Name) for GTM_DPLL_PSA16.
* To use register names with standard convension, please use GTM_DPLL_PSA16.
*/
#define	GTM_PSA16	(GTM_DPLL_PSA16)

/** \\brief  28244, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA17 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128244u)

/** Alias (User Manual Name) for GTM_DPLL_PSA17.
* To use register names with standard convension, please use GTM_DPLL_PSA17.
*/
#define	GTM_PSA17	(GTM_DPLL_PSA17)

/** \\brief  28248, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA18 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128248u)

/** Alias (User Manual Name) for GTM_DPLL_PSA18.
* To use register names with standard convension, please use GTM_DPLL_PSA18.
*/
#define	GTM_PSA18	(GTM_DPLL_PSA18)

/** \\brief  2824C, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA19 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF012824Cu)

/** Alias (User Manual Name) for GTM_DPLL_PSA19.
* To use register names with standard convension, please use GTM_DPLL_PSA19.
*/
#define	GTM_PSA19	(GTM_DPLL_PSA19)

/** \\brief  28208, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128208u)

/** Alias (User Manual Name) for GTM_DPLL_PSA2.
* To use register names with standard convension, please use GTM_DPLL_PSA2.
*/
#define	GTM_PSA2	(GTM_DPLL_PSA2)

/** \\brief  28250, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA20 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128250u)

/** Alias (User Manual Name) for GTM_DPLL_PSA20.
* To use register names with standard convension, please use GTM_DPLL_PSA20.
*/
#define	GTM_PSA20	(GTM_DPLL_PSA20)

/** \\brief  28254, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA21 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128254u)

/** Alias (User Manual Name) for GTM_DPLL_PSA21.
* To use register names with standard convension, please use GTM_DPLL_PSA21.
*/
#define	GTM_PSA21	(GTM_DPLL_PSA21)

/** \\brief  28258, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA22 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128258u)

/** Alias (User Manual Name) for GTM_DPLL_PSA22.
* To use register names with standard convension, please use GTM_DPLL_PSA22.
*/
#define	GTM_PSA22	(GTM_DPLL_PSA22)

/** \\brief  2825C, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA23 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF012825Cu)

/** Alias (User Manual Name) for GTM_DPLL_PSA23.
* To use register names with standard convension, please use GTM_DPLL_PSA23.
*/
#define	GTM_PSA23	(GTM_DPLL_PSA23)

/** \\brief  28260, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA24 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128260u)

/** Alias (User Manual Name) for GTM_DPLL_PSA24.
* To use register names with standard convension, please use GTM_DPLL_PSA24.
*/
#define	GTM_PSA24	(GTM_DPLL_PSA24)

/** \\brief  28264, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA25 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128264u)

