keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_DPLL_PSA25.
* To use register names with standard convension, please use GTM_DPLL_PSA25.
*/
#define	GTM_PSA25	(GTM_DPLL_PSA25)

/** \\brief  28268, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA26 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128268u)

/** Alias (User Manual Name) for GTM_DPLL_PSA26.
* To use register names with standard convension, please use GTM_DPLL_PSA26.
*/
#define	GTM_PSA26	(GTM_DPLL_PSA26)

/** \\brief  2826C, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA27 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF012826Cu)

/** Alias (User Manual Name) for GTM_DPLL_PSA27.
* To use register names with standard convension, please use GTM_DPLL_PSA27.
*/
#define	GTM_PSA27	(GTM_DPLL_PSA27)

/** \\brief  28270, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA28 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128270u)

/** Alias (User Manual Name) for GTM_DPLL_PSA28.
* To use register names with standard convension, please use GTM_DPLL_PSA28.
*/
#define	GTM_PSA28	(GTM_DPLL_PSA28)

/** \\brief  28274, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA29 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128274u)

/** Alias (User Manual Name) for GTM_DPLL_PSA29.
* To use register names with standard convension, please use GTM_DPLL_PSA29.
*/
#define	GTM_PSA29	(GTM_DPLL_PSA29)

/** \\brief  2820C, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA3 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF012820Cu)

/** Alias (User Manual Name) for GTM_DPLL_PSA3.
* To use register names with standard convension, please use GTM_DPLL_PSA3.
*/
#define	GTM_PSA3	(GTM_DPLL_PSA3)

/** \\brief  28278, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA30 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128278u)

/** Alias (User Manual Name) for GTM_DPLL_PSA30.
* To use register names with standard convension, please use GTM_DPLL_PSA30.
*/
#define	GTM_PSA30	(GTM_DPLL_PSA30)

/** \\brief  2827C, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA31 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF012827Cu)

/** Alias (User Manual Name) for GTM_DPLL_PSA31.
* To use register names with standard convension, please use GTM_DPLL_PSA31.
*/
#define	GTM_PSA31	(GTM_DPLL_PSA31)

/** \\brief  28210, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA4 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128210u)

/** Alias (User Manual Name) for GTM_DPLL_PSA4.
* To use register names with standard convension, please use GTM_DPLL_PSA4.
*/
#define	GTM_PSA4	(GTM_DPLL_PSA4)

/** \\brief  28214, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA5 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128214u)

/** Alias (User Manual Name) for GTM_DPLL_PSA5.
* To use register names with standard convension, please use GTM_DPLL_PSA5.
*/
#define	GTM_PSA5	(GTM_DPLL_PSA5)

/** \\brief  28218, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA6 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128218u)

/** Alias (User Manual Name) for GTM_DPLL_PSA6.
* To use register names with standard convension, please use GTM_DPLL_PSA6.
*/
#define	GTM_PSA6	(GTM_DPLL_PSA6)

/** \\brief  2821C, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA7 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF012821Cu)

/** Alias (User Manual Name) for GTM_DPLL_PSA7.
* To use register names with standard convension, please use GTM_DPLL_PSA7.
*/
#define	GTM_PSA7	(GTM_DPLL_PSA7)

/** \\brief  28220, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA8 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128220u)

/** Alias (User Manual Name) for GTM_DPLL_PSA8.
* To use register names with standard convension, please use GTM_DPLL_PSA8.
*/
#define	GTM_PSA8	(GTM_DPLL_PSA8)

/** \\brief  28224, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA9 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128224u)

/** Alias (User Manual Name) for GTM_DPLL_PSA9.
* To use register names with standard convension, please use GTM_DPLL_PSA9.
*/
#define	GTM_PSA9	(GTM_DPLL_PSA9)

/** \\brief  28E80, DPLL Calculated Position Value Register */
#define GTM_DPLL_PSAC0 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF0128E80u)

/** \\brief  28E84, DPLL Calculated Position Value Register */
#define GTM_DPLL_PSAC1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF0128E84u)

/** \\brief  28EA8, DPLL Calculated Position Value Register */
#define GTM_DPLL_PSAC10 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF0128EA8u)

/** \\brief  28EAC, DPLL Calculated Position Value Register */
#define GTM_DPLL_PSAC11 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF0128EACu)

/** \\brief  28EB0, DPLL Calculated Position Value Register */
#define GTM_DPLL_PSAC12 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF0128EB0u)

/** \\brief  28EB4, DPLL Calculated Position Value Register */
#define GTM_DPLL_PSAC13 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF0128EB4u)

/** \\brief  28EB8, DPLL Calculated Position Value Register */
#define GTM_DPLL_PSAC14 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF0128EB8u)

/** \\brief  28EBC, DPLL Calculated Position Value Register */
#define GTM_DPLL_PSAC15 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF0128EBCu)

/** \\brief  28EC0, DPLL Calculated Position Value Register */
#define GTM_DPLL_PSAC16 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF0128EC0u)

/** \\brief  28EC4, DPLL Calculated Position Value Register */
#define GTM_DPLL_PSAC17 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF0128EC4u)

/** \\brief  28EC8, DPLL Calculated Position Value Register */
#define GTM_DPLL_PSAC18 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSAC*)0xF0128EC8u)

