keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  28464, Reciprocal Value of Expected Increment Duration STATE */
#define GTM_DPLL_RCDT_SX /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RCDT_SX*)0xF0128464u)

/** Alias (User Manual Name) for GTM_DPLL_RCDT_SX.
* To use register names with standard convension, please use GTM_DPLL_RCDT_SX.
*/
#define	GTM_RCDT_SX	(GTM_DPLL_RCDT_SX)

/** \\brief  2846C, Reciprocal Value of the Expected Nominal Increment Duration
 * STATE */
#define GTM_DPLL_RCDT_SX_NOM /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RCDT_SX_NOM*)0xF012846Cu)

/** Alias (User Manual Name) for GTM_DPLL_RCDT_SX_NOM.
* To use register names with standard convension, please use GTM_DPLL_RCDT_SX_NOM.
*/
#define	GTM_RCDT_SX_NOM	(GTM_DPLL_RCDT_SX_NOM)

/** \\brief  28460, Reciprocal Value of Expected Increment Duration TRIGGER */
#define GTM_DPLL_RCDT_TX /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RCDT_TX*)0xF0128460u)

/** Alias (User Manual Name) for GTM_DPLL_RCDT_TX.
* To use register names with standard convension, please use GTM_DPLL_RCDT_TX.
*/
#define	GTM_RCDT_TX	(GTM_DPLL_RCDT_TX)

/** \\brief  28468, Reciprocal Value of the Expected Nominal Increment Duration
 * TRIGGER */
#define GTM_DPLL_RCDT_TX_NOM /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RCDT_TX_NOM*)0xF0128468u)

/** Alias (User Manual Name) for GTM_DPLL_RCDT_TX_NOM.
* To use register names with standard convension, please use GTM_DPLL_RCDT_TX_NOM.
*/
#define	GTM_RCDT_TX_NOM	(GTM_DPLL_RCDT_TX_NOM)

/** \\brief  28600, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S0 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128600u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S0.
* To use register names with standard convension, please use GTM_DPLL_RDT_S0.
*/
#define	GTM_RDT_S0	(GTM_DPLL_RDT_S0)

/** \\brief  28604, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128604u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S1.
* To use register names with standard convension, please use GTM_DPLL_RDT_S1.
*/
#define	GTM_RDT_S1	(GTM_DPLL_RDT_S1)

/** \\brief  28628, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S10 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128628u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S10.
* To use register names with standard convension, please use GTM_DPLL_RDT_S10.
*/
#define	GTM_RDT_S10	(GTM_DPLL_RDT_S10)

/** \\brief  2862C, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S11 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF012862Cu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S11.
* To use register names with standard convension, please use GTM_DPLL_RDT_S11.
*/
#define	GTM_RDT_S11	(GTM_DPLL_RDT_S11)

/** \\brief  28630, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S12 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128630u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S12.
* To use register names with standard convension, please use GTM_DPLL_RDT_S12.
*/
#define	GTM_RDT_S12	(GTM_DPLL_RDT_S12)

/** \\brief  28634, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S13 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128634u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S13.
* To use register names with standard convension, please use GTM_DPLL_RDT_S13.
*/
#define	GTM_RDT_S13	(GTM_DPLL_RDT_S13)

/** \\brief  28638, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S14 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128638u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S14.
* To use register names with standard convension, please use GTM_DPLL_RDT_S14.
*/
#define	GTM_RDT_S14	(GTM_DPLL_RDT_S14)

/** \\brief  2863C, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S15 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF012863Cu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S15.
* To use register names with standard convension, please use GTM_DPLL_RDT_S15.
*/
#define	GTM_RDT_S15	(GTM_DPLL_RDT_S15)

/** \\brief  28640, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S16 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128640u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S16.
* To use register names with standard convension, please use GTM_DPLL_RDT_S16.
*/
#define	GTM_RDT_S16	(GTM_DPLL_RDT_S16)

/** \\brief  28644, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S17 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128644u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S17.
* To use register names with standard convension, please use GTM_DPLL_RDT_S17.
*/
#define	GTM_RDT_S17	(GTM_DPLL_RDT_S17)

/** \\brief  28648, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S18 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128648u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S18.
* To use register names with standard convension, please use GTM_DPLL_RDT_S18.
*/
#define	GTM_RDT_S18	(GTM_DPLL_RDT_S18)

/** \\brief  2864C, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S19 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF012864Cu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S19.
* To use register names with standard convension, please use GTM_DPLL_RDT_S19.
*/
#define	GTM_RDT_S19	(GTM_DPLL_RDT_S19)

/** \\brief  28608, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128608u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S2.
* To use register names with standard convension, please use GTM_DPLL_RDT_S2.
*/
#define	GTM_RDT_S2	(GTM_DPLL_RDT_S2)

/** \\brief  28650, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S20 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128650u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S20.
* To use register names with standard convension, please use GTM_DPLL_RDT_S20.
*/
#define	GTM_RDT_S20	(GTM_DPLL_RDT_S20)

/** \\brief  28654, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S21 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128654u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S21.
* To use register names with standard convension, please use GTM_DPLL_RDT_S21.
*/
#define	GTM_RDT_S21	(GTM_DPLL_RDT_S21)

