keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  28610, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S4 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128610u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S4.
* To use register names with standard convension, please use GTM_DPLL_RDT_S4.
*/
#define	GTM_RDT_S4	(GTM_DPLL_RDT_S4)

/** \\brief  286A0, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S40 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286A0u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S40.
* To use register names with standard convension, please use GTM_DPLL_RDT_S40.
*/
#define	GTM_RDT_S40	(GTM_DPLL_RDT_S40)

/** \\brief  286A4, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S41 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286A4u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S41.
* To use register names with standard convension, please use GTM_DPLL_RDT_S41.
*/
#define	GTM_RDT_S41	(GTM_DPLL_RDT_S41)

/** \\brief  286A8, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S42 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286A8u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S42.
* To use register names with standard convension, please use GTM_DPLL_RDT_S42.
*/
#define	GTM_RDT_S42	(GTM_DPLL_RDT_S42)

/** \\brief  286AC, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S43 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286ACu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S43.
* To use register names with standard convension, please use GTM_DPLL_RDT_S43.
*/
#define	GTM_RDT_S43	(GTM_DPLL_RDT_S43)

/** \\brief  286B0, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S44 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286B0u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S44.
* To use register names with standard convension, please use GTM_DPLL_RDT_S44.
*/
#define	GTM_RDT_S44	(GTM_DPLL_RDT_S44)

/** \\brief  286B4, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S45 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286B4u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S45.
* To use register names with standard convension, please use GTM_DPLL_RDT_S45.
*/
#define	GTM_RDT_S45	(GTM_DPLL_RDT_S45)

/** \\brief  286B8, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S46 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286B8u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S46.
* To use register names with standard convension, please use GTM_DPLL_RDT_S46.
*/
#define	GTM_RDT_S46	(GTM_DPLL_RDT_S46)

/** \\brief  286BC, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S47 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286BCu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S47.
* To use register names with standard convension, please use GTM_DPLL_RDT_S47.
*/
#define	GTM_RDT_S47	(GTM_DPLL_RDT_S47)

/** \\brief  286C0, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S48 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286C0u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S48.
* To use register names with standard convension, please use GTM_DPLL_RDT_S48.
*/
#define	GTM_RDT_S48	(GTM_DPLL_RDT_S48)

/** \\brief  286C4, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S49 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286C4u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S49.
* To use register names with standard convension, please use GTM_DPLL_RDT_S49.
*/
#define	GTM_RDT_S49	(GTM_DPLL_RDT_S49)

/** \\brief  28614, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S5 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128614u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S5.
* To use register names with standard convension, please use GTM_DPLL_RDT_S5.
*/
#define	GTM_RDT_S5	(GTM_DPLL_RDT_S5)

/** \\brief  286C8, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S50 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286C8u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S50.
* To use register names with standard convension, please use GTM_DPLL_RDT_S50.
*/
#define	GTM_RDT_S50	(GTM_DPLL_RDT_S50)

/** \\brief  286CC, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S51 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286CCu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S51.
* To use register names with standard convension, please use GTM_DPLL_RDT_S51.
*/
#define	GTM_RDT_S51	(GTM_DPLL_RDT_S51)

/** \\brief  286D0, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S52 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286D0u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S52.
* To use register names with standard convension, please use GTM_DPLL_RDT_S52.
*/
#define	GTM_RDT_S52	(GTM_DPLL_RDT_S52)

/** \\brief  286D4, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S53 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286D4u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S53.
* To use register names with standard convension, please use GTM_DPLL_RDT_S53.
*/
#define	GTM_RDT_S53	(GTM_DPLL_RDT_S53)

/** \\brief  286D8, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S54 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286D8u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S54.
* To use register names with standard convension, please use GTM_DPLL_RDT_S54.
*/
#define	GTM_RDT_S54	(GTM_DPLL_RDT_S54)

/** \\brief  286DC, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S55 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286DCu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S55.
* To use register names with standard convension, please use GTM_DPLL_RDT_S55.
*/
#define	GTM_RDT_S55	(GTM_DPLL_RDT_S55)

/** \\brief  286E0, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S56 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286E0u)

