keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_DPLL_RDT_S56.
* To use register names with standard convension, please use GTM_DPLL_RDT_S56.
*/
#define	GTM_RDT_S56	(GTM_DPLL_RDT_S56)

/** \\brief  286E4, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S57 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286E4u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S57.
* To use register names with standard convension, please use GTM_DPLL_RDT_S57.
*/
#define	GTM_RDT_S57	(GTM_DPLL_RDT_S57)

/** \\brief  286E8, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S58 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286E8u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S58.
* To use register names with standard convension, please use GTM_DPLL_RDT_S58.
*/
#define	GTM_RDT_S58	(GTM_DPLL_RDT_S58)

/** \\brief  286EC, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S59 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286ECu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S59.
* To use register names with standard convension, please use GTM_DPLL_RDT_S59.
*/
#define	GTM_RDT_S59	(GTM_DPLL_RDT_S59)

/** \\brief  28618, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S6 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128618u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S6.
* To use register names with standard convension, please use GTM_DPLL_RDT_S6.
*/
#define	GTM_RDT_S6	(GTM_DPLL_RDT_S6)

/** \\brief  286F0, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S60 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286F0u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S60.
* To use register names with standard convension, please use GTM_DPLL_RDT_S60.
*/
#define	GTM_RDT_S60	(GTM_DPLL_RDT_S60)

/** \\brief  286F4, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S61 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286F4u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S61.
* To use register names with standard convension, please use GTM_DPLL_RDT_S61.
*/
#define	GTM_RDT_S61	(GTM_DPLL_RDT_S61)

/** \\brief  286F8, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S62 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286F8u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S62.
* To use register names with standard convension, please use GTM_DPLL_RDT_S62.
*/
#define	GTM_RDT_S62	(GTM_DPLL_RDT_S62)

/** \\brief  286FC, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S63 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286FCu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S63.
* To use register names with standard convension, please use GTM_DPLL_RDT_S63.
*/
#define	GTM_RDT_S63	(GTM_DPLL_RDT_S63)

/** \\brief  2861C, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S7 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF012861Cu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S7.
* To use register names with standard convension, please use GTM_DPLL_RDT_S7.
*/
#define	GTM_RDT_S7	(GTM_DPLL_RDT_S7)

/** \\brief  28620, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S8 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128620u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S8.
* To use register names with standard convension, please use GTM_DPLL_RDT_S8.
*/
#define	GTM_RDT_S8	(GTM_DPLL_RDT_S8)

/** \\brief  28624, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S9 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128624u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S9.
* To use register names with standard convension, please use GTM_DPLL_RDT_S9.
*/
#define	GTM_RDT_S9	(GTM_DPLL_RDT_S9)

/** \\brief  28474, Actual Reciprocal Value of STATE */
#define GTM_DPLL_RDT_S_ACT /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S_ACT*)0xF0128474u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S_ACT.
* To use register names with standard convension, please use GTM_DPLL_RDT_S_ACT.
*/
#define	GTM_RDT_S_ACT	(GTM_DPLL_RDT_S_ACT)

/** \\brief  28470, Actual Reciprocal Value of TRIGGER */
#define GTM_DPLL_RDT_T_ACT /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_T_ACT*)0xF0128470u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_T_ACT.
* To use register names with standard convension, please use GTM_DPLL_RDT_T_ACT.
*/
#define	GTM_RDT_T_ACT	(GTM_DPLL_RDT_T_ACT)

/** \\brief  284A4, STATE Locking Range */
#define GTM_DPLL_SLR /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_SLR*)0xF01284A4u)

/** Alias (User Manual Name) for GTM_DPLL_SLR.
* To use register names with standard convension, please use GTM_DPLL_SLR.
*/
#define	GTM_SLR	(GTM_DPLL_SLR)

/** \\brief  280FC, DPLL Status Register */
#define GTM_DPLL_STATUS /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_STATUS*)0xF01280FCu)

/** \\brief  280C4, DPLL TBU_TS0 Value at last STATE Event */
#define GTM_DPLL_TBU_TS0_S /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TBU_TS0_S*)0xF01280C4u)

/** Alias (User Manual Name) for GTM_DPLL_TBU_TS0_S.
* To use register names with standard convension, please use GTM_DPLL_TBU_TS0_S.
*/
#define	GTM_TBU_TS0_S	(GTM_DPLL_TBU_TS0_S)

/** \\brief  280C0, DPLL TBU_TS0 Value at last TRIGGER Event */
#define GTM_DPLL_TBU_TS0_T /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TBU_TS0_T*)0xF01280C0u)

/** Alias (User Manual Name) for GTM_DPLL_TBU_TS0_T.
* To use register names with standard convension, please use GTM_DPLL_TBU_TS0_T.
*/
#define	GTM_TBU_TS0_T	(GTM_DPLL_TBU_TS0_T)

/** \\brief  28424, TRIGGER Hold Time Max Value */
#define GTM_DPLL_THMA /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_THMA*)0xF0128424u)

/** Alias (User Manual Name) for GTM_DPLL_THMA.
* To use register names with standard convension, please use GTM_DPLL_THMA.
*/
#define	GTM_THMA	(GTM_DPLL_THMA)

/** \\brief  28420, TRIGGER hold time min value */
#define GTM_DPLL_THMI /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_THMI*)0xF0128420u)

/** Alias (User Manual Name) for GTM_DPLL_THMI.
* To use register names with standard convension, please use GTM_DPLL_THMI.
*/
#define	GTM_THMI	(GTM_DPLL_THMI)

/** \\brief  28428, Measured Last Pulse Time from Valid to Invalid TRIGGER Slope */
#define GTM_DPLL_THVAL /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_THVAL*)0xF0128428u)

/** Alias (User Manual Name) for GTM_DPLL_THVAL.
* To use register names with standard convension, please use GTM_DPLL_THVAL.
*/
#define	GTM_THVAL	(GTM_DPLL_THVAL)

/** \\brief  284A0, TRIGGER locking range */
#define GTM_DPLL_TLR /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TLR*)0xF01284A0u)

