keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  28E6C, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC27 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E6Cu)

/** \\brief  28E70, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC28 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E70u)

/** \\brief  28E74, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC29 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E74u)

/** \\brief  28E0C, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC3 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E0Cu)

/** \\brief  28E78, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC30 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E78u)

/** \\brief  28E7C, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC31 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E7Cu)

/** \\brief  28E10, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC4 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E10u)

/** \\brief  28E14, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC5 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E14u)

/** \\brief  28E18, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC6 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E18u)

/** \\brief  28E1C, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC7 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E1Cu)

/** \\brief  28E20, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC8 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E20u)

/** \\brief  28E24, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC9 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E24u)

/** \\brief  28700, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S0 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128700u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S0.
* To use register names with standard convension, please use GTM_DPLL_TSF_S0.
*/
#define	GTM_TSF_S0	(GTM_DPLL_TSF_S0)

/** \\brief  28704, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128704u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S1.
* To use register names with standard convension, please use GTM_DPLL_TSF_S1.
*/
#define	GTM_TSF_S1	(GTM_DPLL_TSF_S1)

/** \\brief  28728, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S10 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128728u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S10.
* To use register names with standard convension, please use GTM_DPLL_TSF_S10.
*/
#define	GTM_TSF_S10	(GTM_DPLL_TSF_S10)

/** \\brief  2872C, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S11 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF012872Cu)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S11.
* To use register names with standard convension, please use GTM_DPLL_TSF_S11.
*/
#define	GTM_TSF_S11	(GTM_DPLL_TSF_S11)

/** \\brief  28730, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S12 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128730u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S12.
* To use register names with standard convension, please use GTM_DPLL_TSF_S12.
*/
#define	GTM_TSF_S12	(GTM_DPLL_TSF_S12)

/** \\brief  28734, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S13 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128734u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S13.
* To use register names with standard convension, please use GTM_DPLL_TSF_S13.
*/
#define	GTM_TSF_S13	(GTM_DPLL_TSF_S13)

/** \\brief  28738, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S14 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128738u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S14.
* To use register names with standard convension, please use GTM_DPLL_TSF_S14.
*/
#define	GTM_TSF_S14	(GTM_DPLL_TSF_S14)

/** \\brief  2873C, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S15 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF012873Cu)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S15.
* To use register names with standard convension, please use GTM_DPLL_TSF_S15.
*/
#define	GTM_TSF_S15	(GTM_DPLL_TSF_S15)

/** \\brief  28740, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S16 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128740u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S16.
* To use register names with standard convension, please use GTM_DPLL_TSF_S16.
*/
#define	GTM_TSF_S16	(GTM_DPLL_TSF_S16)

/** \\brief  28744, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S17 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128744u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S17.
* To use register names with standard convension, please use GTM_DPLL_TSF_S17.
*/
#define	GTM_TSF_S17	(GTM_DPLL_TSF_S17)

/** \\brief  28748, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S18 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128748u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S18.
* To use register names with standard convension, please use GTM_DPLL_TSF_S18.
*/
#define	GTM_TSF_S18	(GTM_DPLL_TSF_S18)

/** \\brief  2874C, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S19 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF012874Cu)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S19.
* To use register names with standard convension, please use GTM_DPLL_TSF_S19.
*/
#define	GTM_TSF_S19	(GTM_DPLL_TSF_S19)

/** \\brief  28708, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128708u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S2.
* To use register names with standard convension, please use GTM_DPLL_TSF_S2.
*/
#define	GTM_TSF_S2	(GTM_DPLL_TSF_S2)

/** \\brief  28750, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S20 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128750u)

