keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_DPLL_TSF_S20.
* To use register names with standard convension, please use GTM_DPLL_TSF_S20.
*/
#define	GTM_TSF_S20	(GTM_DPLL_TSF_S20)

/** \\brief  28754, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S21 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128754u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S21.
* To use register names with standard convension, please use GTM_DPLL_TSF_S21.
*/
#define	GTM_TSF_S21	(GTM_DPLL_TSF_S21)

/** \\brief  28758, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S22 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128758u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S22.
* To use register names with standard convension, please use GTM_DPLL_TSF_S22.
*/
#define	GTM_TSF_S22	(GTM_DPLL_TSF_S22)

/** \\brief  2875C, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S23 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF012875Cu)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S23.
* To use register names with standard convension, please use GTM_DPLL_TSF_S23.
*/
#define	GTM_TSF_S23	(GTM_DPLL_TSF_S23)

/** \\brief  28760, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S24 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128760u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S24.
* To use register names with standard convension, please use GTM_DPLL_TSF_S24.
*/
#define	GTM_TSF_S24	(GTM_DPLL_TSF_S24)

/** \\brief  28764, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S25 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128764u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S25.
* To use register names with standard convension, please use GTM_DPLL_TSF_S25.
*/
#define	GTM_TSF_S25	(GTM_DPLL_TSF_S25)

/** \\brief  28768, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S26 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128768u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S26.
* To use register names with standard convension, please use GTM_DPLL_TSF_S26.
*/
#define	GTM_TSF_S26	(GTM_DPLL_TSF_S26)

/** \\brief  2876C, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S27 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF012876Cu)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S27.
* To use register names with standard convension, please use GTM_DPLL_TSF_S27.
*/
#define	GTM_TSF_S27	(GTM_DPLL_TSF_S27)

/** \\brief  28770, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S28 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128770u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S28.
* To use register names with standard convension, please use GTM_DPLL_TSF_S28.
*/
#define	GTM_TSF_S28	(GTM_DPLL_TSF_S28)

/** \\brief  28774, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S29 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128774u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S29.
* To use register names with standard convension, please use GTM_DPLL_TSF_S29.
*/
#define	GTM_TSF_S29	(GTM_DPLL_TSF_S29)

/** \\brief  2870C, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S3 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF012870Cu)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S3.
* To use register names with standard convension, please use GTM_DPLL_TSF_S3.
*/
#define	GTM_TSF_S3	(GTM_DPLL_TSF_S3)

/** \\brief  28778, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S30 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128778u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S30.
* To use register names with standard convension, please use GTM_DPLL_TSF_S30.
*/
#define	GTM_TSF_S30	(GTM_DPLL_TSF_S30)

/** \\brief  2877C, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S31 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF012877Cu)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S31.
* To use register names with standard convension, please use GTM_DPLL_TSF_S31.
*/
#define	GTM_TSF_S31	(GTM_DPLL_TSF_S31)

/** \\brief  28780, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S32 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128780u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S32.
* To use register names with standard convension, please use GTM_DPLL_TSF_S32.
*/
#define	GTM_TSF_S32	(GTM_DPLL_TSF_S32)

/** \\brief  28784, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S33 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128784u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S33.
* To use register names with standard convension, please use GTM_DPLL_TSF_S33.
*/
#define	GTM_TSF_S33	(GTM_DPLL_TSF_S33)

/** \\brief  28788, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S34 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128788u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S34.
* To use register names with standard convension, please use GTM_DPLL_TSF_S34.
*/
#define	GTM_TSF_S34	(GTM_DPLL_TSF_S34)

/** \\brief  2878C, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S35 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF012878Cu)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S35.
* To use register names with standard convension, please use GTM_DPLL_TSF_S35.
*/
#define	GTM_TSF_S35	(GTM_DPLL_TSF_S35)

/** \\brief  28790, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S36 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128790u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S36.
* To use register names with standard convension, please use GTM_DPLL_TSF_S36.
*/
#define	GTM_TSF_S36	(GTM_DPLL_TSF_S36)

/** \\brief  28794, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S37 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128794u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S37.
* To use register names with standard convension, please use GTM_DPLL_TSF_S37.
*/
#define	GTM_TSF_S37	(GTM_DPLL_TSF_S37)

/** \\brief  28798, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S38 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128798u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S38.
* To use register names with standard convension, please use GTM_DPLL_TSF_S38.
*/
#define	GTM_TSF_S38	(GTM_DPLL_TSF_S38)

/** \\brief  2879C, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S39 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF012879Cu)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S39.
* To use register names with standard convension, please use GTM_DPLL_TSF_S39.
*/
#define	GTM_TSF_S39	(GTM_DPLL_TSF_S39)

