keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  28710, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S4 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128710u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S4.
* To use register names with standard convension, please use GTM_DPLL_TSF_S4.
*/
#define	GTM_TSF_S4	(GTM_DPLL_TSF_S4)

/** \\brief  287A0, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S40 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF01287A0u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S40.
* To use register names with standard convension, please use GTM_DPLL_TSF_S40.
*/
#define	GTM_TSF_S40	(GTM_DPLL_TSF_S40)

/** \\brief  287A4, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S41 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF01287A4u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S41.
* To use register names with standard convension, please use GTM_DPLL_TSF_S41.
*/
#define	GTM_TSF_S41	(GTM_DPLL_TSF_S41)

/** \\brief  287A8, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S42 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF01287A8u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S42.
* To use register names with standard convension, please use GTM_DPLL_TSF_S42.
*/
#define	GTM_TSF_S42	(GTM_DPLL_TSF_S42)

/** \\brief  287AC, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S43 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF01287ACu)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S43.
* To use register names with standard convension, please use GTM_DPLL_TSF_S43.
*/
#define	GTM_TSF_S43	(GTM_DPLL_TSF_S43)

/** \\brief  287B0, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S44 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF01287B0u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S44.
* To use register names with standard convension, please use GTM_DPLL_TSF_S44.
*/
#define	GTM_TSF_S44	(GTM_DPLL_TSF_S44)

/** \\brief  287B4, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S45 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF01287B4u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S45.
* To use register names with standard convension, please use GTM_DPLL_TSF_S45.
*/
#define	GTM_TSF_S45	(GTM_DPLL_TSF_S45)

/** \\brief  287B8, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S46 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF01287B8u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S46.
* To use register names with standard convension, please use GTM_DPLL_TSF_S46.
*/
#define	GTM_TSF_S46	(GTM_DPLL_TSF_S46)

/** \\brief  287BC, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S47 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF01287BCu)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S47.
* To use register names with standard convension, please use GTM_DPLL_TSF_S47.
*/
#define	GTM_TSF_S47	(GTM_DPLL_TSF_S47)

/** \\brief  287C0, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S48 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF01287C0u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S48.
* To use register names with standard convension, please use GTM_DPLL_TSF_S48.
*/
#define	GTM_TSF_S48	(GTM_DPLL_TSF_S48)

/** \\brief  287C4, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S49 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF01287C4u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S49.
* To use register names with standard convension, please use GTM_DPLL_TSF_S49.
*/
#define	GTM_TSF_S49	(GTM_DPLL_TSF_S49)

/** \\brief  28714, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S5 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF0128714u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S5.
* To use register names with standard convension, please use GTM_DPLL_TSF_S5.
*/
#define	GTM_TSF_S5	(GTM_DPLL_TSF_S5)

/** \\brief  287C8, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S50 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF01287C8u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S50.
* To use register names with standard convension, please use GTM_DPLL_TSF_S50.
*/
#define	GTM_TSF_S50	(GTM_DPLL_TSF_S50)

/** \\brief  287CC, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S51 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF01287CCu)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S51.
* To use register names with standard convension, please use GTM_DPLL_TSF_S51.
*/
#define	GTM_TSF_S51	(GTM_DPLL_TSF_S51)

/** \\brief  287D0, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S52 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF01287D0u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S52.
* To use register names with standard convension, please use GTM_DPLL_TSF_S52.
*/
#define	GTM_TSF_S52	(GTM_DPLL_TSF_S52)

/** \\brief  287D4, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S53 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF01287D4u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S53.
* To use register names with standard convension, please use GTM_DPLL_TSF_S53.
*/
#define	GTM_TSF_S53	(GTM_DPLL_TSF_S53)

/** \\brief  287D8, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S54 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF01287D8u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S54.
* To use register names with standard convension, please use GTM_DPLL_TSF_S54.
*/
#define	GTM_TSF_S54	(GTM_DPLL_TSF_S54)

/** \\brief  287DC, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S55 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF01287DCu)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S55.
* To use register names with standard convension, please use GTM_DPLL_TSF_S55.
*/
#define	GTM_TSF_S55	(GTM_DPLL_TSF_S55)

/** \\brief  287E0, Time Stamp Field of STATE Events */
#define GTM_DPLL_TSF_S56 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSF_S*)0xF01287E0u)

/** Alias (User Manual Name) for GTM_DPLL_TSF_S56.
* To use register names with standard convension, please use GTM_DPLL_TSF_S56.
*/
#define	GTM_TSF_S56	(GTM_DPLL_TSF_S56)

