keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  33388, MCS Channel Program Counter Register 2 */
#define GTM_MCS3_CH7_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0133388u)

/** \\brief  3338C, MCS Channel Program Counter Register 3 */
#define GTM_MCS3_CH7_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013338Cu)

/** \\brief  33390, MCS Channel Program Counter Register 4 */
#define GTM_MCS3_CH7_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0133390u)

/** \\brief  33394, MCS Channel Program Counter Register 5 */
#define GTM_MCS3_CH7_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0133394u)

/** \\brief  33398, MCS Channel Program Counter Register 6 */
#define GTM_MCS3_CH7_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0133398u)

/** \\brief  3339C, MCS Channel Program Counter Register 7 */
#define GTM_MCS3_CH7_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF013339Cu)

/** \\brief  33074, MCS Control Register */
#define GTM_MCS3_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CTRL*)0xF0133074u)

/** \\brief  3307C, MCS Error Register */
#define GTM_MCS3_ERR /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_ERR*)0xF013307Cu)

/** \\brief  33078, MCS Channel Reset Register */
#define GTM_MCS3_RST /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_RST*)0xF0133078u)

/** \\brief  34024, MCS Channel ACB Register */
#define GTM_MCS4_CH0_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF0134024u)

/** \\brief  34028, MCS Clear Trigger Control Register */
#define GTM_MCS4_CH0_CTRG /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_CTRG*)0xF0134028u)

/** Alias (User Manual Name) for GTM_MCS4_CH0_CTRG.
* To use register names with standard convension, please use GTM_MCS4_CH0_CTRG.
*/
#define	GTM_MCS4_CTRG	(GTM_MCS4_CH0_CTRG)

/** \\brief  34020, MCS Channel Control Register */
#define GTM_MCS4_CH0_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF0134020u)

/** \\brief  34054, MCS_Channel Error Interrupt Enable Register */
#define GTM_MCS4_CH0_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF0134054u)

/** \\brief  34048, MCS Channel Interrupt Enable Register */
#define GTM_MCS4_CH0_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF0134048u)

/** \\brief  3404C, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS4_CH0_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF013404Cu)

/** \\brief  34050, MCS IRQ Mode Configuration Register */
#define GTM_MCS4_CH0_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF0134050u)

/** \\brief  34044, MCS Channel interrupt notification register */
#define GTM_MCS4_CH0_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF0134044u)

/** \\brief  34040, MCS Channel Program Counter Register */
#define GTM_MCS4_CH0_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF0134040u)

/** \\brief  34000, MCS Channel Program Counter Register 0 */
#define GTM_MCS4_CH0_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0134000u)

/** \\brief  34004, MCS Channel Program Counter Register 1 */
#define GTM_MCS4_CH0_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF0134004u)

/** \\brief  34008, MCS Channel Program Counter Register 2 */
#define GTM_MCS4_CH0_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0134008u)

/** \\brief  3400C, MCS Channel Program Counter Register 3 */
#define GTM_MCS4_CH0_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013400Cu)

/** \\brief  34010, MCS Channel Program Counter Register 4 */
#define GTM_MCS4_CH0_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0134010u)

/** \\brief  34014, MCS Channel Program Counter Register 5 */
#define GTM_MCS4_CH0_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0134014u)

/** \\brief  34018, MCS Channel Program Counter Register 6 */
#define GTM_MCS4_CH0_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0134018u)

/** \\brief  3401C, MCS Channel Program Counter Register 7 */
#define GTM_MCS4_CH0_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF013401Cu)

/** \\brief  3402C, MCS Set Trigger Control Register */
#define GTM_MCS4_CH0_STRG /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_STRG*)0xF013402Cu)

/** Alias (User Manual Name) for GTM_MCS4_CH0_STRG.
* To use register names with standard convension, please use GTM_MCS4_CH0_STRG.
*/
#define	GTM_MCS4_STRG	(GTM_MCS4_CH0_STRG)

/** \\brief  340A4, MCS Channel ACB Register */
#define GTM_MCS4_CH1_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01340A4u)

/** \\brief  340A0, MCS Channel Control Register */
#define GTM_MCS4_CH1_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01340A0u)

/** \\brief  340D4, MCS_Channel Error Interrupt Enable Register */
#define GTM_MCS4_CH1_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01340D4u)

/** \\brief  340C8, MCS Channel Interrupt Enable Register */
#define GTM_MCS4_CH1_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01340C8u)

/** \\brief  340CC, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS4_CH1_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01340CCu)

/** \\brief  340D0, MCS IRQ Mode Configuration Register */
#define GTM_MCS4_CH1_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01340D0u)

/** \\brief  340C4, MCS Channel interrupt notification register */
#define GTM_MCS4_CH1_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01340C4u)

/** \\brief  340C0, MCS Channel Program Counter Register */
#define GTM_MCS4_CH1_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01340C0u)

/** \\brief  34080, MCS Channel Program Counter Register 0 */
#define GTM_MCS4_CH1_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0134080u)

/** \\brief  34084, MCS Channel Program Counter Register 1 */
#define GTM_MCS4_CH1_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF0134084u)

/** \\brief  34088, MCS Channel Program Counter Register 2 */
#define GTM_MCS4_CH1_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0134088u)

/** \\brief  3408C, MCS Channel Program Counter Register 3 */
#define GTM_MCS4_CH1_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013408Cu)

/** \\brief  34090, MCS Channel Program Counter Register 4 */
#define GTM_MCS4_CH1_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0134090u)

/** \\brief  34094, MCS Channel Program Counter Register 5 */
#define GTM_MCS4_CH1_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0134094u)

