keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  34098, MCS Channel Program Counter Register 6 */
#define GTM_MCS4_CH1_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0134098u)

/** \\brief  3409C, MCS Channel Program Counter Register 7 */
#define GTM_MCS4_CH1_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF013409Cu)

/** \\brief  34124, MCS Channel ACB Register */
#define GTM_MCS4_CH2_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF0134124u)

/** \\brief  34120, MCS Channel Control Register */
#define GTM_MCS4_CH2_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF0134120u)

/** \\brief  34154, MCS_Channel Error Interrupt Enable Register */
#define GTM_MCS4_CH2_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF0134154u)

/** \\brief  34148, MCS Channel Interrupt Enable Register */
#define GTM_MCS4_CH2_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF0134148u)

/** \\brief  3414C, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS4_CH2_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF013414Cu)

/** \\brief  34150, MCS IRQ Mode Configuration Register */
#define GTM_MCS4_CH2_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF0134150u)

/** \\brief  34144, MCS Channel interrupt notification register */
#define GTM_MCS4_CH2_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF0134144u)

/** \\brief  34140, MCS Channel Program Counter Register */
#define GTM_MCS4_CH2_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF0134140u)

/** \\brief  34100, MCS Channel Program Counter Register 0 */
#define GTM_MCS4_CH2_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0134100u)

/** \\brief  34104, MCS Channel Program Counter Register 1 */
#define GTM_MCS4_CH2_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF0134104u)

/** \\brief  34108, MCS Channel Program Counter Register 2 */
#define GTM_MCS4_CH2_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0134108u)

/** \\brief  3410C, MCS Channel Program Counter Register 3 */
#define GTM_MCS4_CH2_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013410Cu)

/** \\brief  34110, MCS Channel Program Counter Register 4 */
#define GTM_MCS4_CH2_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0134110u)

/** \\brief  34114, MCS Channel Program Counter Register 5 */
#define GTM_MCS4_CH2_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0134114u)

/** \\brief  34118, MCS Channel Program Counter Register 6 */
#define GTM_MCS4_CH2_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0134118u)

/** \\brief  3411C, MCS Channel Program Counter Register 7 */
#define GTM_MCS4_CH2_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF013411Cu)

/** \\brief  341A4, MCS Channel ACB Register */
#define GTM_MCS4_CH3_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01341A4u)

/** \\brief  341A0, MCS Channel Control Register */
#define GTM_MCS4_CH3_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01341A0u)

/** \\brief  341D4, MCS_Channel Error Interrupt Enable Register */
#define GTM_MCS4_CH3_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01341D4u)

/** \\brief  341C8, MCS Channel Interrupt Enable Register */
#define GTM_MCS4_CH3_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01341C8u)

/** \\brief  341CC, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS4_CH3_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01341CCu)

/** \\brief  341D0, MCS IRQ Mode Configuration Register */
#define GTM_MCS4_CH3_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01341D0u)

/** \\brief  341C4, MCS Channel interrupt notification register */
#define GTM_MCS4_CH3_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01341C4u)

/** \\brief  341C0, MCS Channel Program Counter Register */
#define GTM_MCS4_CH3_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01341C0u)

/** \\brief  34180, MCS Channel Program Counter Register 0 */
#define GTM_MCS4_CH3_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0134180u)

/** \\brief  34184, MCS Channel Program Counter Register 1 */
#define GTM_MCS4_CH3_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF0134184u)

/** \\brief  34188, MCS Channel Program Counter Register 2 */
#define GTM_MCS4_CH3_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0134188u)

/** \\brief  3418C, MCS Channel Program Counter Register 3 */
#define GTM_MCS4_CH3_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013418Cu)

/** \\brief  34190, MCS Channel Program Counter Register 4 */
#define GTM_MCS4_CH3_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0134190u)

/** \\brief  34194, MCS Channel Program Counter Register 5 */
#define GTM_MCS4_CH3_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0134194u)

/** \\brief  34198, MCS Channel Program Counter Register 6 */
#define GTM_MCS4_CH3_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0134198u)

/** \\brief  3419C, MCS Channel Program Counter Register 7 */
#define GTM_MCS4_CH3_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF013419Cu)

/** \\brief  34224, MCS Channel ACB Register */
#define GTM_MCS4_CH4_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF0134224u)

/** \\brief  34220, MCS Channel Control Register */
#define GTM_MCS4_CH4_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF0134220u)

/** \\brief  34254, MCS_Channel Error Interrupt Enable Register */
#define GTM_MCS4_CH4_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF0134254u)

/** \\brief  34248, MCS Channel Interrupt Enable Register */
#define GTM_MCS4_CH4_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF0134248u)

/** \\brief  3424C, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS4_CH4_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF013424Cu)

/** \\brief  34250, MCS IRQ Mode Configuration Register */
#define GTM_MCS4_CH4_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF0134250u)

