keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  34244, MCS Channel interrupt notification register */
#define GTM_MCS4_CH4_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF0134244u)

/** \\brief  34240, MCS Channel Program Counter Register */
#define GTM_MCS4_CH4_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF0134240u)

/** \\brief  34200, MCS Channel Program Counter Register 0 */
#define GTM_MCS4_CH4_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0134200u)

/** \\brief  34204, MCS Channel Program Counter Register 1 */
#define GTM_MCS4_CH4_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF0134204u)

/** \\brief  34208, MCS Channel Program Counter Register 2 */
#define GTM_MCS4_CH4_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0134208u)

/** \\brief  3420C, MCS Channel Program Counter Register 3 */
#define GTM_MCS4_CH4_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013420Cu)

/** \\brief  34210, MCS Channel Program Counter Register 4 */
#define GTM_MCS4_CH4_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0134210u)

/** \\brief  34214, MCS Channel Program Counter Register 5 */
#define GTM_MCS4_CH4_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0134214u)

/** \\brief  34218, MCS Channel Program Counter Register 6 */
#define GTM_MCS4_CH4_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0134218u)

/** \\brief  3421C, MCS Channel Program Counter Register 7 */
#define GTM_MCS4_CH4_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF013421Cu)

/** \\brief  342A4, MCS Channel ACB Register */
#define GTM_MCS4_CH5_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01342A4u)

/** \\brief  342A0, MCS Channel Control Register */
#define GTM_MCS4_CH5_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01342A0u)

/** \\brief  342D4, MCS_Channel Error Interrupt Enable Register */
#define GTM_MCS4_CH5_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01342D4u)

/** \\brief  342C8, MCS Channel Interrupt Enable Register */
#define GTM_MCS4_CH5_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01342C8u)

/** \\brief  342CC, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS4_CH5_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01342CCu)

/** \\brief  342D0, MCS IRQ Mode Configuration Register */
#define GTM_MCS4_CH5_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01342D0u)

/** \\brief  342C4, MCS Channel interrupt notification register */
#define GTM_MCS4_CH5_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01342C4u)

/** \\brief  342C0, MCS Channel Program Counter Register */
#define GTM_MCS4_CH5_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01342C0u)

/** \\brief  34280, MCS Channel Program Counter Register 0 */
#define GTM_MCS4_CH5_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0134280u)

/** \\brief  34284, MCS Channel Program Counter Register 1 */
#define GTM_MCS4_CH5_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF0134284u)

/** \\brief  34288, MCS Channel Program Counter Register 2 */
#define GTM_MCS4_CH5_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0134288u)

/** \\brief  3428C, MCS Channel Program Counter Register 3 */
#define GTM_MCS4_CH5_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013428Cu)

/** \\brief  34290, MCS Channel Program Counter Register 4 */
#define GTM_MCS4_CH5_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0134290u)

/** \\brief  34294, MCS Channel Program Counter Register 5 */
#define GTM_MCS4_CH5_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0134294u)

/** \\brief  34298, MCS Channel Program Counter Register 6 */
#define GTM_MCS4_CH5_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0134298u)

/** \\brief  3429C, MCS Channel Program Counter Register 7 */
#define GTM_MCS4_CH5_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF013429Cu)

/** \\brief  34324, MCS Channel ACB Register */
#define GTM_MCS4_CH6_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF0134324u)

/** \\brief  34320, MCS Channel Control Register */
#define GTM_MCS4_CH6_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF0134320u)

/** \\brief  34354, MCS_Channel Error Interrupt Enable Register */
#define GTM_MCS4_CH6_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF0134354u)

/** \\brief  34348, MCS Channel Interrupt Enable Register */
#define GTM_MCS4_CH6_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF0134348u)

/** \\brief  3434C, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS4_CH6_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF013434Cu)

/** \\brief  34350, MCS IRQ Mode Configuration Register */
#define GTM_MCS4_CH6_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF0134350u)

/** \\brief  34344, MCS Channel interrupt notification register */
#define GTM_MCS4_CH6_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF0134344u)

/** \\brief  34340, MCS Channel Program Counter Register */
#define GTM_MCS4_CH6_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF0134340u)

/** \\brief  34300, MCS Channel Program Counter Register 0 */
#define GTM_MCS4_CH6_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0134300u)

/** \\brief  34304, MCS Channel Program Counter Register 1 */
#define GTM_MCS4_CH6_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF0134304u)

/** \\brief  34308, MCS Channel Program Counter Register 2 */
#define GTM_MCS4_CH6_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0134308u)

/** \\brief  3430C, MCS Channel Program Counter Register 3 */
#define GTM_MCS4_CH6_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013430Cu)

/** \\brief  34310, MCS Channel Program Counter Register 4 */
#define GTM_MCS4_CH6_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0134310u)

/** \\brief  34314, MCS Channel Program Counter Register 5 */
#define GTM_MCS4_CH6_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0134314u)

/** \\brief  34318, MCS Channel Program Counter Register 6 */
#define GTM_MCS4_CH6_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0134318u)

/** \\brief  3431C, MCS Channel Program Counter Register 7 */
#define GTM_MCS4_CH6_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF013431Cu)

