keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  343A4, MCS Channel ACB Register */
#define GTM_MCS4_CH7_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01343A4u)

/** \\brief  343A0, MCS Channel Control Register */
#define GTM_MCS4_CH7_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01343A0u)

/** \\brief  343D4, MCS_Channel Error Interrupt Enable Register */
#define GTM_MCS4_CH7_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01343D4u)

/** \\brief  343C8, MCS Channel Interrupt Enable Register */
#define GTM_MCS4_CH7_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01343C8u)

/** \\brief  343CC, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS4_CH7_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01343CCu)

/** \\brief  343D0, MCS IRQ Mode Configuration Register */
#define GTM_MCS4_CH7_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01343D0u)

/** \\brief  343C4, MCS Channel interrupt notification register */
#define GTM_MCS4_CH7_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01343C4u)

/** \\brief  343C0, MCS Channel Program Counter Register */
#define GTM_MCS4_CH7_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01343C0u)

/** \\brief  34380, MCS Channel Program Counter Register 0 */
#define GTM_MCS4_CH7_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0134380u)

/** \\brief  34384, MCS Channel Program Counter Register 1 */
#define GTM_MCS4_CH7_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF0134384u)

/** \\brief  34388, MCS Channel Program Counter Register 2 */
#define GTM_MCS4_CH7_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0134388u)

/** \\brief  3438C, MCS Channel Program Counter Register 3 */
#define GTM_MCS4_CH7_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013438Cu)

/** \\brief  34390, MCS Channel Program Counter Register 4 */
#define GTM_MCS4_CH7_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0134390u)

/** \\brief  34394, MCS Channel Program Counter Register 5 */
#define GTM_MCS4_CH7_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0134394u)

/** \\brief  34398, MCS Channel Program Counter Register 6 */
#define GTM_MCS4_CH7_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0134398u)

/** \\brief  3439C, MCS Channel Program Counter Register 7 */
#define GTM_MCS4_CH7_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF013439Cu)

/** \\brief  34074, MCS Control Register */
#define GTM_MCS4_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CTRL*)0xF0134074u)

/** \\brief  3407C, MCS Error Register */
#define GTM_MCS4_ERR /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_ERR*)0xF013407Cu)

/** \\brief  34078, MCS Channel Reset Register */
#define GTM_MCS4_RST /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_RST*)0xF0134078u)

/** \\brief  35024, MCS Channel ACB Register */
#define GTM_MCS5_CH0_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF0135024u)

/** \\brief  35028, MCS Clear Trigger Control Register */
#define GTM_MCS5_CH0_CTRG /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_CTRG*)0xF0135028u)

/** Alias (User Manual Name) for GTM_MCS5_CH0_CTRG.
* To use register names with standard convension, please use GTM_MCS5_CH0_CTRG.
*/
#define	GTM_MCS5_CTRG	(GTM_MCS5_CH0_CTRG)

/** \\brief  35020, MCS Channel Control Register */
#define GTM_MCS5_CH0_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF0135020u)

/** \\brief  35054, MCS_Channel Error Interrupt Enable Register */
#define GTM_MCS5_CH0_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF0135054u)

/** \\brief  35048, MCS Channel Interrupt Enable Register */
#define GTM_MCS5_CH0_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF0135048u)

/** \\brief  3504C, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS5_CH0_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF013504Cu)

/** \\brief  35050, MCS IRQ Mode Configuration Register */
#define GTM_MCS5_CH0_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF0135050u)

/** \\brief  35044, MCS Channel interrupt notification register */
#define GTM_MCS5_CH0_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF0135044u)

/** \\brief  35040, MCS Channel Program Counter Register */
#define GTM_MCS5_CH0_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF0135040u)

/** \\brief  35000, MCS Channel Program Counter Register 0 */
#define GTM_MCS5_CH0_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0135000u)

/** \\brief  35004, MCS Channel Program Counter Register 1 */
#define GTM_MCS5_CH0_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF0135004u)

/** \\brief  35008, MCS Channel Program Counter Register 2 */
#define GTM_MCS5_CH0_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0135008u)

/** \\brief  3500C, MCS Channel Program Counter Register 3 */
#define GTM_MCS5_CH0_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013500Cu)

/** \\brief  35010, MCS Channel Program Counter Register 4 */
#define GTM_MCS5_CH0_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0135010u)

/** \\brief  35014, MCS Channel Program Counter Register 5 */
#define GTM_MCS5_CH0_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0135014u)

/** \\brief  35018, MCS Channel Program Counter Register 6 */
#define GTM_MCS5_CH0_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0135018u)

/** \\brief  3501C, MCS Channel Program Counter Register 7 */
#define GTM_MCS5_CH0_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF013501Cu)

/** \\brief  3502C, MCS Set Trigger Control Register */
#define GTM_MCS5_CH0_STRG /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH0_STRG*)0xF013502Cu)

/** Alias (User Manual Name) for GTM_MCS5_CH0_STRG.
* To use register names with standard convension, please use GTM_MCS5_CH0_STRG.
*/
#define	GTM_MCS5_STRG	(GTM_MCS5_CH0_STRG)

