keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  350A4, MCS Channel ACB Register */
#define GTM_MCS5_CH1_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01350A4u)

/** \\brief  350A0, MCS Channel Control Register */
#define GTM_MCS5_CH1_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01350A0u)

/** \\brief  350D4, MCS_Channel Error Interrupt Enable Register */
#define GTM_MCS5_CH1_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01350D4u)

/** \\brief  350C8, MCS Channel Interrupt Enable Register */
#define GTM_MCS5_CH1_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01350C8u)

/** \\brief  350CC, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS5_CH1_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01350CCu)

/** \\brief  350D0, MCS IRQ Mode Configuration Register */
#define GTM_MCS5_CH1_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01350D0u)

/** \\brief  350C4, MCS Channel interrupt notification register */
#define GTM_MCS5_CH1_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01350C4u)

/** \\brief  350C0, MCS Channel Program Counter Register */
#define GTM_MCS5_CH1_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01350C0u)

/** \\brief  35080, MCS Channel Program Counter Register 0 */
#define GTM_MCS5_CH1_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0135080u)

/** \\brief  35084, MCS Channel Program Counter Register 1 */
#define GTM_MCS5_CH1_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF0135084u)

/** \\brief  35088, MCS Channel Program Counter Register 2 */
#define GTM_MCS5_CH1_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0135088u)

/** \\brief  3508C, MCS Channel Program Counter Register 3 */
#define GTM_MCS5_CH1_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013508Cu)

/** \\brief  35090, MCS Channel Program Counter Register 4 */
#define GTM_MCS5_CH1_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0135090u)

/** \\brief  35094, MCS Channel Program Counter Register 5 */
#define GTM_MCS5_CH1_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0135094u)

/** \\brief  35098, MCS Channel Program Counter Register 6 */
#define GTM_MCS5_CH1_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0135098u)

/** \\brief  3509C, MCS Channel Program Counter Register 7 */
#define GTM_MCS5_CH1_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF013509Cu)

/** \\brief  35124, MCS Channel ACB Register */
#define GTM_MCS5_CH2_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF0135124u)

/** \\brief  35120, MCS Channel Control Register */
#define GTM_MCS5_CH2_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF0135120u)

/** \\brief  35154, MCS_Channel Error Interrupt Enable Register */
#define GTM_MCS5_CH2_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF0135154u)

/** \\brief  35148, MCS Channel Interrupt Enable Register */
#define GTM_MCS5_CH2_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF0135148u)

/** \\brief  3514C, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS5_CH2_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF013514Cu)

/** \\brief  35150, MCS IRQ Mode Configuration Register */
#define GTM_MCS5_CH2_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF0135150u)

/** \\brief  35144, MCS Channel interrupt notification register */
#define GTM_MCS5_CH2_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF0135144u)

/** \\brief  35140, MCS Channel Program Counter Register */
#define GTM_MCS5_CH2_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF0135140u)

/** \\brief  35100, MCS Channel Program Counter Register 0 */
#define GTM_MCS5_CH2_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0135100u)

/** \\brief  35104, MCS Channel Program Counter Register 1 */
#define GTM_MCS5_CH2_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF0135104u)

/** \\brief  35108, MCS Channel Program Counter Register 2 */
#define GTM_MCS5_CH2_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0135108u)

/** \\brief  3510C, MCS Channel Program Counter Register 3 */
#define GTM_MCS5_CH2_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013510Cu)

/** \\brief  35110, MCS Channel Program Counter Register 4 */
#define GTM_MCS5_CH2_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0135110u)

/** \\brief  35114, MCS Channel Program Counter Register 5 */
#define GTM_MCS5_CH2_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0135114u)

/** \\brief  35118, MCS Channel Program Counter Register 6 */
#define GTM_MCS5_CH2_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0135118u)

/** \\brief  3511C, MCS Channel Program Counter Register 7 */
#define GTM_MCS5_CH2_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF013511Cu)

/** \\brief  351A4, MCS Channel ACB Register */
#define GTM_MCS5_CH3_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01351A4u)

/** \\brief  351A0, MCS Channel Control Register */
#define GTM_MCS5_CH3_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01351A0u)

/** \\brief  351D4, MCS_Channel Error Interrupt Enable Register */
#define GTM_MCS5_CH3_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01351D4u)

/** \\brief  351C8, MCS Channel Interrupt Enable Register */
#define GTM_MCS5_CH3_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01351C8u)

/** \\brief  351CC, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS5_CH3_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01351CCu)

/** \\brief  351D0, MCS IRQ Mode Configuration Register */
#define GTM_MCS5_CH3_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01351D0u)

/** \\brief  351C4, MCS Channel interrupt notification register */
#define GTM_MCS5_CH3_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01351C4u)

/** \\brief  351C0, MCS Channel Program Counter Register */
#define GTM_MCS5_CH3_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01351C0u)

/** \\brief  35180, MCS Channel Program Counter Register 0 */
#define GTM_MCS5_CH3_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0135180u)

/** \\brief  35184, MCS Channel Program Counter Register 1 */
#define GTM_MCS5_CH3_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF0135184u)

/** \\brief  35188, MCS Channel Program Counter Register 2 */
#define GTM_MCS5_CH3_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0135188u)

/** \\brief  3518C, MCS Channel Program Counter Register 3 */
#define GTM_MCS5_CH3_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013518Cu)

