keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  35190, MCS Channel Program Counter Register 4 */
#define GTM_MCS5_CH3_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0135190u)

/** \\brief  35194, MCS Channel Program Counter Register 5 */
#define GTM_MCS5_CH3_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0135194u)

/** \\brief  35198, MCS Channel Program Counter Register 6 */
#define GTM_MCS5_CH3_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0135198u)

/** \\brief  3519C, MCS Channel Program Counter Register 7 */
#define GTM_MCS5_CH3_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF013519Cu)

/** \\brief  35224, MCS Channel ACB Register */
#define GTM_MCS5_CH4_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF0135224u)

/** \\brief  35220, MCS Channel Control Register */
#define GTM_MCS5_CH4_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF0135220u)

/** \\brief  35254, MCS_Channel Error Interrupt Enable Register */
#define GTM_MCS5_CH4_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF0135254u)

/** \\brief  35248, MCS Channel Interrupt Enable Register */
#define GTM_MCS5_CH4_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF0135248u)

/** \\brief  3524C, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS5_CH4_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF013524Cu)

/** \\brief  35250, MCS IRQ Mode Configuration Register */
#define GTM_MCS5_CH4_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF0135250u)

/** \\brief  35244, MCS Channel interrupt notification register */
#define GTM_MCS5_CH4_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF0135244u)

/** \\brief  35240, MCS Channel Program Counter Register */
#define GTM_MCS5_CH4_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF0135240u)

/** \\brief  35200, MCS Channel Program Counter Register 0 */
#define GTM_MCS5_CH4_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0135200u)

/** \\brief  35204, MCS Channel Program Counter Register 1 */
#define GTM_MCS5_CH4_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF0135204u)

/** \\brief  35208, MCS Channel Program Counter Register 2 */
#define GTM_MCS5_CH4_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0135208u)

/** \\brief  3520C, MCS Channel Program Counter Register 3 */
#define GTM_MCS5_CH4_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013520Cu)

/** \\brief  35210, MCS Channel Program Counter Register 4 */
#define GTM_MCS5_CH4_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0135210u)

/** \\brief  35214, MCS Channel Program Counter Register 5 */
#define GTM_MCS5_CH4_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0135214u)

/** \\brief  35218, MCS Channel Program Counter Register 6 */
#define GTM_MCS5_CH4_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0135218u)

/** \\brief  3521C, MCS Channel Program Counter Register 7 */
#define GTM_MCS5_CH4_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF013521Cu)

/** \\brief  352A4, MCS Channel ACB Register */
#define GTM_MCS5_CH5_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01352A4u)

/** \\brief  352A0, MCS Channel Control Register */
#define GTM_MCS5_CH5_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01352A0u)

/** \\brief  352D4, MCS_Channel Error Interrupt Enable Register */
#define GTM_MCS5_CH5_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01352D4u)

/** \\brief  352C8, MCS Channel Interrupt Enable Register */
#define GTM_MCS5_CH5_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01352C8u)

/** \\brief  352CC, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS5_CH5_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01352CCu)

/** \\brief  352D0, MCS IRQ Mode Configuration Register */
#define GTM_MCS5_CH5_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01352D0u)

/** \\brief  352C4, MCS Channel interrupt notification register */
#define GTM_MCS5_CH5_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01352C4u)

/** \\brief  352C0, MCS Channel Program Counter Register */
#define GTM_MCS5_CH5_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01352C0u)

/** \\brief  35280, MCS Channel Program Counter Register 0 */
#define GTM_MCS5_CH5_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0135280u)

/** \\brief  35284, MCS Channel Program Counter Register 1 */
#define GTM_MCS5_CH5_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF0135284u)

/** \\brief  35288, MCS Channel Program Counter Register 2 */
#define GTM_MCS5_CH5_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0135288u)

/** \\brief  3528C, MCS Channel Program Counter Register 3 */
#define GTM_MCS5_CH5_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013528Cu)

/** \\brief  35290, MCS Channel Program Counter Register 4 */
#define GTM_MCS5_CH5_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0135290u)

/** \\brief  35294, MCS Channel Program Counter Register 5 */
#define GTM_MCS5_CH5_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0135294u)

/** \\brief  35298, MCS Channel Program Counter Register 6 */
#define GTM_MCS5_CH5_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0135298u)

/** \\brief  3529C, MCS Channel Program Counter Register 7 */
#define GTM_MCS5_CH5_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF013529Cu)

/** \\brief  35324, MCS Channel ACB Register */
#define GTM_MCS5_CH6_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF0135324u)

/** \\brief  35320, MCS Channel Control Register */
#define GTM_MCS5_CH6_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF0135320u)

/** \\brief  35354, MCS_Channel Error Interrupt Enable Register */
#define GTM_MCS5_CH6_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF0135354u)

