keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  35348, MCS Channel Interrupt Enable Register */
#define GTM_MCS5_CH6_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF0135348u)

/** \\brief  3534C, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS5_CH6_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF013534Cu)

/** \\brief  35350, MCS IRQ Mode Configuration Register */
#define GTM_MCS5_CH6_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF0135350u)

/** \\brief  35344, MCS Channel interrupt notification register */
#define GTM_MCS5_CH6_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF0135344u)

/** \\brief  35340, MCS Channel Program Counter Register */
#define GTM_MCS5_CH6_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF0135340u)

/** \\brief  35300, MCS Channel Program Counter Register 0 */
#define GTM_MCS5_CH6_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0135300u)

/** \\brief  35304, MCS Channel Program Counter Register 1 */
#define GTM_MCS5_CH6_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF0135304u)

/** \\brief  35308, MCS Channel Program Counter Register 2 */
#define GTM_MCS5_CH6_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0135308u)

/** \\brief  3530C, MCS Channel Program Counter Register 3 */
#define GTM_MCS5_CH6_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013530Cu)

/** \\brief  35310, MCS Channel Program Counter Register 4 */
#define GTM_MCS5_CH6_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0135310u)

/** \\brief  35314, MCS Channel Program Counter Register 5 */
#define GTM_MCS5_CH6_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0135314u)

/** \\brief  35318, MCS Channel Program Counter Register 6 */
#define GTM_MCS5_CH6_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0135318u)

/** \\brief  3531C, MCS Channel Program Counter Register 7 */
#define GTM_MCS5_CH6_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF013531Cu)

/** \\brief  353A4, MCS Channel ACB Register */
#define GTM_MCS5_CH7_ACB /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01353A4u)

/** \\brief  353A0, MCS Channel Control Register */
#define GTM_MCS5_CH7_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01353A0u)

/** \\brief  353D4, MCS_Channel Error Interrupt Enable Register */
#define GTM_MCS5_CH7_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01353D4u)

/** \\brief  353C8, MCS Channel Interrupt Enable Register */
#define GTM_MCS5_CH7_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01353C8u)

/** \\brief  353CC, MCS Channel Software Interrupt Generation Register */
#define GTM_MCS5_CH7_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01353CCu)

/** \\brief  353D0, MCS IRQ Mode Configuration Register */
#define GTM_MCS5_CH7_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01353D0u)

/** \\brief  353C4, MCS Channel interrupt notification register */
#define GTM_MCS5_CH7_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01353C4u)

/** \\brief  353C0, MCS Channel Program Counter Register */
#define GTM_MCS5_CH7_PC /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01353C0u)

/** \\brief  35380, MCS Channel Program Counter Register 0 */
#define GTM_MCS5_CH7_R0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R0*)0xF0135380u)

/** \\brief  35384, MCS Channel Program Counter Register 1 */
#define GTM_MCS5_CH7_R1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R1*)0xF0135384u)

/** \\brief  35388, MCS Channel Program Counter Register 2 */
#define GTM_MCS5_CH7_R2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R2*)0xF0135388u)

/** \\brief  3538C, MCS Channel Program Counter Register 3 */
#define GTM_MCS5_CH7_R3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R3*)0xF013538Cu)

/** \\brief  35390, MCS Channel Program Counter Register 4 */
#define GTM_MCS5_CH7_R4 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R4*)0xF0135390u)

/** \\brief  35394, MCS Channel Program Counter Register 5 */
#define GTM_MCS5_CH7_R5 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R5*)0xF0135394u)

/** \\brief  35398, MCS Channel Program Counter Register 6 */
#define GTM_MCS5_CH7_R6 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R6*)0xF0135398u)

/** \\brief  3539C, MCS Channel Program Counter Register 7 */
#define GTM_MCS5_CH7_R7 /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CH_R7*)0xF013539Cu)

/** \\brief  35074, MCS Control Register */
#define GTM_MCS5_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_CTRL*)0xF0135074u)

/** \\brief  3507C, MCS Error Register */
#define GTM_MCS5_ERR /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_ERR*)0xF013507Cu)

/** \\brief  35078, MCS Channel Reset Register */
#define GTM_MCS5_RST /*lint --e(923)*/ (*(volatile Ifx_GTM_MCS_RST*)0xF0135078u)

/** \\brief  184, Monitor Activity Register 0 */
#define GTM_MON_ACTIVITY_0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MON_ACTIVITY_0*)0xF0100184u)

/** \\brief  188, Monitor Activity Register 1 */
#define GTM_MON_ACTIVITY_1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MON_ACTIVITY_1*)0xF0100188u)

/** \\brief  180, Monitor Status Register */
#define GTM_MON_STATUS /*lint --e(923)*/ (*(volatile Ifx_GTM_MON_STATUS*)0xF0100180u)

/** \\brief  9FF64, MSC Input High Control Register */
#define GTM_MSCIN0_INHCON /*lint --e(923)*/ (*(volatile Ifx_GTM_MSCIN_INHCON*)0xF019FF64u)

/** Alias (User Manual Name) for GTM_MSCIN0_INHCON.
* To use register names with standard convension, please use GTM_MSCIN0_INHCON.
*/
#define	GTM_MSC0INHCON	(GTM_MSCIN0_INHCON)

/** \\brief  9FF60, MSC Input Low Control Register */
#define GTM_MSCIN0_INLCON /*lint --e(923)*/ (*(volatile Ifx_GTM_MSCIN_INLCON*)0xF019FF60u)

/** Alias (User Manual Name) for GTM_MSCIN0_INLCON.
* To use register names with standard convension, please use GTM_MSCIN0_INLCON.
*/
#define	GTM_MSC0INLCON	(GTM_MSCIN0_INLCON)

