keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  9FF38, MSC Set Control 2 Register */
#define GTM_MSCSET_1S3_CON2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MSCSET_CON2*)0xF019FF38u)

/** Alias (User Manual Name) for GTM_MSCSET_1S3_CON2.
* To use register names with standard convension, please use GTM_MSCSET_1S3_CON2.
*/
#define	GTM_MSCSET4CON2	(GTM_MSCSET_1S3_CON2)

/** \\brief  9FF3C, MSC Set Control 3 Register */
#define GTM_MSCSET_1S3_CON3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MSCSET_CON3*)0xF019FF3Cu)

/** Alias (User Manual Name) for GTM_MSCSET_1S3_CON3.
* To use register names with standard convension, please use GTM_MSCSET_1S3_CON3.
*/
#define	GTM_MSCSET4CON3	(GTM_MSCSET_1S3_CON3)

/** \\brief  9FF40, MSC Set Control 0 Register */
#define GTM_MSCSET_1S4_CON0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MSCSET_CON0*)0xF019FF40u)

/** Alias (User Manual Name) for GTM_MSCSET_1S4_CON0.
* To use register names with standard convension, please use GTM_MSCSET_1S4_CON0.
*/
#define	GTM_MSCSET5CON0	(GTM_MSCSET_1S4_CON0)

/** \\brief  9FF44, MSC Set Control 1 Register */
#define GTM_MSCSET_1S4_CON1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MSCSET_CON1*)0xF019FF44u)

/** Alias (User Manual Name) for GTM_MSCSET_1S4_CON1.
* To use register names with standard convension, please use GTM_MSCSET_1S4_CON1.
*/
#define	GTM_MSCSET5CON1	(GTM_MSCSET_1S4_CON1)

/** \\brief  9FF48, MSC Set Control 2 Register */
#define GTM_MSCSET_1S4_CON2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MSCSET_CON2*)0xF019FF48u)

/** Alias (User Manual Name) for GTM_MSCSET_1S4_CON2.
* To use register names with standard convension, please use GTM_MSCSET_1S4_CON2.
*/
#define	GTM_MSCSET5CON2	(GTM_MSCSET_1S4_CON2)

/** \\brief  9FF4C, MSC Set Control 3 Register */
#define GTM_MSCSET_1S4_CON3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MSCSET_CON3*)0xF019FF4Cu)

/** Alias (User Manual Name) for GTM_MSCSET_1S4_CON3.
* To use register names with standard convension, please use GTM_MSCSET_1S4_CON3.
*/
#define	GTM_MSCSET5CON3	(GTM_MSCSET_1S4_CON3)

/** \\brief  9FF50, MSC Set Control 0 Register */
#define GTM_MSCSET_1S5_CON0 /*lint --e(923)*/ (*(volatile Ifx_GTM_MSCSET_CON0*)0xF019FF50u)

/** Alias (User Manual Name) for GTM_MSCSET_1S5_CON0.
* To use register names with standard convension, please use GTM_MSCSET_1S5_CON0.
*/
#define	GTM_MSCSET6CON0	(GTM_MSCSET_1S5_CON0)

/** \\brief  9FF54, MSC Set Control 1 Register */
#define GTM_MSCSET_1S5_CON1 /*lint --e(923)*/ (*(volatile Ifx_GTM_MSCSET_CON1*)0xF019FF54u)

/** Alias (User Manual Name) for GTM_MSCSET_1S5_CON1.
* To use register names with standard convension, please use GTM_MSCSET_1S5_CON1.
*/
#define	GTM_MSCSET6CON1	(GTM_MSCSET_1S5_CON1)

/** \\brief  9FF58, MSC Set Control 2 Register */
#define GTM_MSCSET_1S5_CON2 /*lint --e(923)*/ (*(volatile Ifx_GTM_MSCSET_CON2*)0xF019FF58u)

/** Alias (User Manual Name) for GTM_MSCSET_1S5_CON2.
* To use register names with standard convension, please use GTM_MSCSET_1S5_CON2.
*/
#define	GTM_MSCSET6CON2	(GTM_MSCSET_1S5_CON2)

/** \\brief  9FF5C, MSC Set Control 3 Register */
#define GTM_MSCSET_1S5_CON3 /*lint --e(923)*/ (*(volatile Ifx_GTM_MSCSET_CON3*)0xF019FF5Cu)

/** Alias (User Manual Name) for GTM_MSCSET_1S5_CON3.
* To use register names with standard convension, please use GTM_MSCSET_1S5_CON3.
*/
#define	GTM_MSCSET6CON3	(GTM_MSCSET_1S5_CON3)

/** \\brief  9FDE8, OCDS Control and Status */
#define GTM_OCS /*lint --e(923)*/ (*(volatile Ifx_GTM_OCS*)0xF019FDE8u)

/** \\brief  9FDDC, OCDS Debug Access Register */
#define GTM_ODA /*lint --e(923)*/ (*(volatile Ifx_GTM_ODA*)0xF019FDDCu)

/** \\brief  9FDC4, OCDS TBU0 Trigger Register */
#define GTM_OTBU0T /*lint --e(923)*/ (*(volatile Ifx_GTM_OTBU0T*)0xF019FDC4u)

/** \\brief  9FDC8, OCDS TBU1 Trigger Register */
#define GTM_OTBU1T /*lint --e(923)*/ (*(volatile Ifx_GTM_OTBU1T*)0xF019FDC8u)

/** \\brief  9FDCC, OCDS TBU2 Trigger Register */
#define GTM_OTBU2T /*lint --e(923)*/ (*(volatile Ifx_GTM_OTBU2T*)0xF019FDCCu)

/** \\brief  9FDD4, OCDS Trigger Set Control 0 Register */
#define GTM_OTSC0 /*lint --e(923)*/ (*(volatile Ifx_GTM_OTSC0*)0xF019FDD4u)

/** \\brief  9FDD8, OCDS Trigger Set Control 1 Register */
#define GTM_OTSC1 /*lint --e(923)*/ (*(volatile Ifx_GTM_OTSC1*)0xF019FDD8u)

/** \\brief  9FDD0, OCDS Trigger Set Select Register */
#define GTM_OTSS /*lint --e(923)*/ (*(volatile Ifx_GTM_OTSS*)0xF019FDD0u)

/** \\brief  0, GTM Version Control Register */
#define GTM_REV /*lint --e(923)*/ (*(volatile Ifx_GTM_REV*)0xF0100000u)

/** \\brief  4, GTM Global Reset Register */
#define GTM_RST /*lint --e(923)*/ (*(volatile Ifx_GTM_RST*)0xF0100004u)

/** \\brief  800, SPE Control Status Register */
#define GTM_SPE0_CTRL_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_CTRL_STAT*)0xF0100800u)

/** \\brief  83C, SPE Error Interrupt Enable Register */
#define GTM_SPE0_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_EIRQ_EN*)0xF010083Cu)

/** \\brief  830, SPE Interrupt Enable Register */
#define GTM_SPE0_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_EN*)0xF0100830u)

/** \\brief  834, SPE Interrupt Generation by Software */
#define GTM_SPE0_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_FORCINT*)0xF0100834u)

/** \\brief  838, SPE IRQ Mode Configuration Register */
#define GTM_SPE0_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_MODE*)0xF0100838u)

/** \\brief  82C, SPE Interrupt Notification Register */
#define GTM_SPE0_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_IRQ_NOTIFY*)0xF010082Cu)

/** \\brief  828, SPE Output Control Register */
#define GTM_SPE0_OUT_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_CTRL*)0xF0100828u)

/** \\brief  808, SPE Output Definition Register 0 */
#define GTM_SPE0_OUT_PAT0 /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100808u)

/** \\brief  80C, SPE Output Definition Register 0 */
#define GTM_SPE0_OUT_PAT1 /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF010080Cu)

/** \\brief  810, SPE Output Definition Register 0 */
#define GTM_SPE0_OUT_PAT2 /*lint --e(923)*/ (*(volatile Ifx_GTM_SPE_OUT_PAT*)0xF0100810u)

