keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  3810, TIM Channel SMU Shadow Counter Register */
#define GTM_TIM5_CH0_CNTS /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103810u)

/** \\brief  3824, TIM Channel Control Register */
#define GTM_TIM5_CH0_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0103824u)

/** \\brief  380C, TIM Channel Edge Counter Register */
#define GTM_TIM5_CH0_ECNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010380Cu)

/** \\brief  3828, TIM Channel External Capture Control Register */
#define GTM_TIM5_CH0_ECTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0103828u)

/** \\brief  383C, TIM Channel Error Interrupt Enable Register */
#define GTM_TIM5_CH0_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF010383Cu)

/** \\brief  3820, TIM Channel Filter Parameter 1 Register */
#define GTM_TIM5_CH0_FLT_FE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0103820u)

/** \\brief  381C, GTM_TIM Channel Filter Parameter 0 Register */
#define GTM_TIM5_CH0_FLT_RE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010381Cu)

/** \\brief  3800, TIM Channel General Purpose 0 Register */
#define GTM_TIM5_CH0_GPR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103800u)

/** \\brief  3804, TIM Channel General Purpose 1 Register */
#define GTM_TIM5_CH0_GPR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103804u)

/** \\brief  3830, TIM Channel Interrupt Enable Register */
#define GTM_TIM5_CH0_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0103830u)

/** \\brief  3834, TIM Channel Software Interrupt Force Register */
#define GTM_TIM5_CH0_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0103834u)

/** \\brief  3838, TIM IRQ Mode Configuration Register */
#define GTM_TIM5_CH0_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0103838u)

/** \\brief  382C, TIM Channel Interrupt Notification Register */
#define GTM_TIM5_CH0_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF010382Cu)

/** \\brief  3814, TIM Channel TDUC Register */
#define GTM_TIM5_CH0_TDUC /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103814u)

/** \\brief  3818, TIM Channel TDUV Register */
#define GTM_TIM5_CH0_TDUV /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103818u)

/** \\brief  3888, TIM Channel SMU Counter Register */
#define GTM_TIM5_CH1_CNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103888u)

/** \\brief  3890, TIM Channel SMU Shadow Counter Register */
#define GTM_TIM5_CH1_CNTS /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103890u)

/** \\brief  38A4, TIM Channel Control Register */
#define GTM_TIM5_CH1_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF01038A4u)

/** \\brief  388C, TIM Channel Edge Counter Register */
#define GTM_TIM5_CH1_ECNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010388Cu)

/** \\brief  38A8, TIM Channel External Capture Control Register */
#define GTM_TIM5_CH1_ECTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF01038A8u)

/** \\brief  38BC, TIM Channel Error Interrupt Enable Register */
#define GTM_TIM5_CH1_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF01038BCu)

/** \\brief  38A0, TIM Channel Filter Parameter 1 Register */
#define GTM_TIM5_CH1_FLT_FE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF01038A0u)

/** \\brief  389C, GTM_TIM Channel Filter Parameter 0 Register */
#define GTM_TIM5_CH1_FLT_RE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010389Cu)

/** \\brief  3880, TIM Channel General Purpose 0 Register */
#define GTM_TIM5_CH1_GPR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103880u)

/** \\brief  3884, TIM Channel General Purpose 1 Register */
#define GTM_TIM5_CH1_GPR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103884u)

/** \\brief  38B0, TIM Channel Interrupt Enable Register */
#define GTM_TIM5_CH1_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF01038B0u)

/** \\brief  38B4, TIM Channel Software Interrupt Force Register */
#define GTM_TIM5_CH1_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF01038B4u)

/** \\brief  38B8, TIM IRQ Mode Configuration Register */
#define GTM_TIM5_CH1_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF01038B8u)

/** \\brief  38AC, TIM Channel Interrupt Notification Register */
#define GTM_TIM5_CH1_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF01038ACu)

/** \\brief  3894, TIM Channel TDUC Register */
#define GTM_TIM5_CH1_TDUC /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103894u)

/** \\brief  3898, TIM Channel TDUV Register */
#define GTM_TIM5_CH1_TDUV /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103898u)

/** \\brief  3908, TIM Channel SMU Counter Register */
#define GTM_TIM5_CH2_CNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103908u)

/** \\brief  3910, TIM Channel SMU Shadow Counter Register */
#define GTM_TIM5_CH2_CNTS /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103910u)

/** \\brief  3924, TIM Channel Control Register */
#define GTM_TIM5_CH2_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0103924u)

/** \\brief  390C, TIM Channel Edge Counter Register */
#define GTM_TIM5_CH2_ECNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010390Cu)

/** \\brief  3928, TIM Channel External Capture Control Register */
#define GTM_TIM5_CH2_ECTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0103928u)

/** \\brief  393C, TIM Channel Error Interrupt Enable Register */
#define GTM_TIM5_CH2_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF010393Cu)

/** \\brief  3920, TIM Channel Filter Parameter 1 Register */
#define GTM_TIM5_CH2_FLT_FE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0103920u)

/** \\brief  391C, GTM_TIM Channel Filter Parameter 0 Register */
#define GTM_TIM5_CH2_FLT_RE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010391Cu)

/** \\brief  3900, TIM Channel General Purpose 0 Register */
#define GTM_TIM5_CH2_GPR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103900u)

/** \\brief  3904, TIM Channel General Purpose 1 Register */
#define GTM_TIM5_CH2_GPR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103904u)

