keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  3930, TIM Channel Interrupt Enable Register */
#define GTM_TIM5_CH2_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0103930u)

/** \\brief  3934, TIM Channel Software Interrupt Force Register */
#define GTM_TIM5_CH2_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0103934u)

/** \\brief  3938, TIM IRQ Mode Configuration Register */
#define GTM_TIM5_CH2_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0103938u)

/** \\brief  392C, TIM Channel Interrupt Notification Register */
#define GTM_TIM5_CH2_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF010392Cu)

/** \\brief  3914, TIM Channel TDUC Register */
#define GTM_TIM5_CH2_TDUC /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103914u)

/** \\brief  3918, TIM Channel TDUV Register */
#define GTM_TIM5_CH2_TDUV /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103918u)

/** \\brief  3988, TIM Channel SMU Counter Register */
#define GTM_TIM5_CH3_CNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103988u)

/** \\brief  3990, TIM Channel SMU Shadow Counter Register */
#define GTM_TIM5_CH3_CNTS /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103990u)

/** \\brief  39A4, TIM Channel Control Register */
#define GTM_TIM5_CH3_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF01039A4u)

/** \\brief  398C, TIM Channel Edge Counter Register */
#define GTM_TIM5_CH3_ECNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010398Cu)

/** \\brief  39A8, TIM Channel External Capture Control Register */
#define GTM_TIM5_CH3_ECTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF01039A8u)

/** \\brief  39BC, TIM Channel Error Interrupt Enable Register */
#define GTM_TIM5_CH3_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF01039BCu)

/** \\brief  39A0, TIM Channel Filter Parameter 1 Register */
#define GTM_TIM5_CH3_FLT_FE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF01039A0u)

/** \\brief  399C, GTM_TIM Channel Filter Parameter 0 Register */
#define GTM_TIM5_CH3_FLT_RE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010399Cu)

/** \\brief  3980, TIM Channel General Purpose 0 Register */
#define GTM_TIM5_CH3_GPR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103980u)

/** \\brief  3984, TIM Channel General Purpose 1 Register */
#define GTM_TIM5_CH3_GPR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103984u)

/** \\brief  39B0, TIM Channel Interrupt Enable Register */
#define GTM_TIM5_CH3_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF01039B0u)

/** \\brief  39B4, TIM Channel Software Interrupt Force Register */
#define GTM_TIM5_CH3_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF01039B4u)

/** \\brief  39B8, TIM IRQ Mode Configuration Register */
#define GTM_TIM5_CH3_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF01039B8u)

/** \\brief  39AC, TIM Channel Interrupt Notification Register */
#define GTM_TIM5_CH3_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF01039ACu)

/** \\brief  3994, TIM Channel TDUC Register */
#define GTM_TIM5_CH3_TDUC /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103994u)

/** \\brief  3998, TIM Channel TDUV Register */
#define GTM_TIM5_CH3_TDUV /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103998u)

/** \\brief  3A08, TIM Channel SMU Counter Register */
#define GTM_TIM5_CH4_CNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103A08u)

/** \\brief  3A10, TIM Channel SMU Shadow Counter Register */
#define GTM_TIM5_CH4_CNTS /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103A10u)

/** \\brief  3A24, TIM Channel Control Register */
#define GTM_TIM5_CH4_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0103A24u)

/** \\brief  3A0C, TIM Channel Edge Counter Register */
#define GTM_TIM5_CH4_ECNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF0103A0Cu)

/** \\brief  3A28, TIM Channel External Capture Control Register */
#define GTM_TIM5_CH4_ECTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0103A28u)

/** \\brief  3A3C, TIM Channel Error Interrupt Enable Register */
#define GTM_TIM5_CH4_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF0103A3Cu)

/** \\brief  3A20, TIM Channel Filter Parameter 1 Register */
#define GTM_TIM5_CH4_FLT_FE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0103A20u)

/** \\brief  3A1C, GTM_TIM Channel Filter Parameter 0 Register */
#define GTM_TIM5_CH4_FLT_RE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF0103A1Cu)

/** \\brief  3A00, TIM Channel General Purpose 0 Register */
#define GTM_TIM5_CH4_GPR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103A00u)

/** \\brief  3A04, TIM Channel General Purpose 1 Register */
#define GTM_TIM5_CH4_GPR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0103A04u)

/** \\brief  3A30, TIM Channel Interrupt Enable Register */
#define GTM_TIM5_CH4_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0103A30u)

/** \\brief  3A34, TIM Channel Software Interrupt Force Register */
#define GTM_TIM5_CH4_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0103A34u)

/** \\brief  3A38, TIM IRQ Mode Configuration Register */
#define GTM_TIM5_CH4_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0103A38u)

/** \\brief  3A2C, TIM Channel Interrupt Notification Register */
#define GTM_TIM5_CH4_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF0103A2Cu)

/** \\brief  3A14, TIM Channel TDUC Register */
#define GTM_TIM5_CH4_TDUC /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0103A14u)

/** \\brief  3A18, TIM Channel TDUV Register */
#define GTM_TIM5_CH4_TDUV /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0103A18u)

/** \\brief  3A88, TIM Channel SMU Counter Register */
#define GTM_TIM5_CH5_CNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0103A88u)

/** \\brief  3A90, TIM Channel SMU Shadow Counter Register */
#define GTM_TIM5_CH5_CNTS /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0103A90u)

/** \\brief  3AA4, TIM Channel Control Register */
#define GTM_TIM5_CH5_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0103AA4u)

/** \\brief  3A8C, TIM Channel Edge Counter Register */
#define GTM_TIM5_CH5_ECNT /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF0103A8Cu)

/** \\brief  3AA8, TIM Channel External Capture Control Register */
#define GTM_TIM5_CH5_ECTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0103AA8u)

/** \\brief  3ABC, TIM Channel Error Interrupt Enable Register */
#define GTM_TIM5_CH5_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF0103ABCu)

/** \\brief  3AA0, TIM Channel Filter Parameter 1 Register */
#define GTM_TIM5_CH5_FLT_FE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0103AA0u)

/** \\brief  3A9C, GTM_TIM Channel Filter Parameter 0 Register */
#define GTM_TIM5_CH5_FLT_RE /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF0103A9Cu)

/** \\brief  3A80, TIM Channel General Purpose 0 Register */
#define GTM_TIM5_CH5_GPR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0103A80u)

