keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  990C, TOM Channel CCU0 Compare Register */
#define GTM_TOM3_CH4_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010990Cu)

/** \\brief  9910, TOM Channel CCU1 Compare Register */
#define GTM_TOM3_CH4_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109910u)

/** \\brief  9914, TOM Channel CCU0 Counter Register */
#define GTM_TOM3_CH4_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109914u)

/** \\brief  9900, TOM Channel Control Register’ */
#define GTM_TOM3_CH4_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109900u)

/** \\brief  9920, TOM Channel Interrupt Enable Register */
#define GTM_TOM3_CH4_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109920u)

/** \\brief  9924, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM3_CH4_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109924u)

/** \\brief  9928, TOM IRQ Mode Configuration Register */
#define GTM_TOM3_CH4_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109928u)

/** \\brief  991C, TOM Channel Interrupt Notification Register */
#define GTM_TOM3_CH4_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010991Cu)

/** \\brief  9904, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM3_CH4_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109904u)

/** \\brief  9908, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM3_CH4_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109908u)

/** \\brief  9918, TOM Channel Status Register */
#define GTM_TOM3_CH4_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109918u)

/** \\brief  994C, TOM Channel CCU0 Compare Register */
#define GTM_TOM3_CH5_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010994Cu)

/** \\brief  9950, TOM Channel CCU1 Compare Register */
#define GTM_TOM3_CH5_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109950u)

/** \\brief  9954, TOM Channel CCU0 Counter Register */
#define GTM_TOM3_CH5_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109954u)

/** \\brief  9940, TOM Channel Control Register’ */
#define GTM_TOM3_CH5_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109940u)

/** \\brief  9960, TOM Channel Interrupt Enable Register */
#define GTM_TOM3_CH5_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109960u)

/** \\brief  9964, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM3_CH5_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109964u)

/** \\brief  9968, TOM IRQ Mode Configuration Register */
#define GTM_TOM3_CH5_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109968u)

/** \\brief  995C, TOM Channel Interrupt Notification Register */
#define GTM_TOM3_CH5_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010995Cu)

/** \\brief  9944, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM3_CH5_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109944u)

/** \\brief  9948, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM3_CH5_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109948u)

/** \\brief  9958, TOM Channel Status Register */
#define GTM_TOM3_CH5_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109958u)

/** \\brief  998C, TOM Channel CCU0 Compare Register */
#define GTM_TOM3_CH6_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010998Cu)

/** \\brief  9990, TOM Channel CCU1 Compare Register */
#define GTM_TOM3_CH6_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109990u)

/** \\brief  9994, TOM Channel CCU0 Counter Register */
#define GTM_TOM3_CH6_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109994u)

/** \\brief  9980, TOM Channel Control Register’ */
#define GTM_TOM3_CH6_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109980u)

/** \\brief  99A0, TOM Channel Interrupt Enable Register */
#define GTM_TOM3_CH6_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF01099A0u)

/** \\brief  99A4, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM3_CH6_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF01099A4u)

/** \\brief  99A8, TOM IRQ Mode Configuration Register */
#define GTM_TOM3_CH6_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF01099A8u)

/** \\brief  999C, TOM Channel Interrupt Notification Register */
#define GTM_TOM3_CH6_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010999Cu)

/** \\brief  9984, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM3_CH6_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109984u)

/** \\brief  9988, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM3_CH6_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109988u)

/** \\brief  9998, TOM Channel Status Register */
#define GTM_TOM3_CH6_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109998u)

/** \\brief  99CC, TOM Channel CCU0 Compare Register */
#define GTM_TOM3_CH7_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF01099CCu)

/** \\brief  99D0, TOM Channel CCU1 Compare Register */
#define GTM_TOM3_CH7_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF01099D0u)

/** \\brief  99D4, TOM Channel CCU0 Counter Register */
#define GTM_TOM3_CH7_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF01099D4u)

/** \\brief  99C0, TOM Channel Control Register’ */
#define GTM_TOM3_CH7_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF01099C0u)

/** \\brief  99E0, TOM Channel Interrupt Enable Register */
#define GTM_TOM3_CH7_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF01099E0u)

/** \\brief  99E4, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM3_CH7_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF01099E4u)

/** \\brief  99E8, TOM IRQ Mode Configuration Register */
#define GTM_TOM3_CH7_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF01099E8u)

/** \\brief  99DC, TOM Channel Interrupt Notification Register */
#define GTM_TOM3_CH7_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF01099DCu)

/** \\brief  99C4, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM3_CH7_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF01099C4u)

/** \\brief  99C8, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM3_CH7_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF01099C8u)

