keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  99D8, TOM Channel Status Register */
#define GTM_TOM3_CH7_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF01099D8u)

/** \\brief  9A0C, TOM Channel CCU0 Compare Register */
#define GTM_TOM3_CH8_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF0109A0Cu)

/** \\brief  9A10, TOM Channel CCU1 Compare Register */
#define GTM_TOM3_CH8_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109A10u)

/** \\brief  9A14, TOM Channel CCU0 Counter Register */
#define GTM_TOM3_CH8_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109A14u)

/** \\brief  9A00, TOM Channel Control Register’ */
#define GTM_TOM3_CH8_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109A00u)

/** \\brief  9A20, TOM Channel Interrupt Enable Register */
#define GTM_TOM3_CH8_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109A20u)

/** \\brief  9A24, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM3_CH8_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109A24u)

/** \\brief  9A28, TOM IRQ Mode Configuration Register */
#define GTM_TOM3_CH8_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109A28u)

/** \\brief  9A1C, TOM Channel Interrupt Notification Register */
#define GTM_TOM3_CH8_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF0109A1Cu)

/** \\brief  9A04, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM3_CH8_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109A04u)

/** \\brief  9A08, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM3_CH8_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109A08u)

/** \\brief  9A18, TOM Channel Status Register */
#define GTM_TOM3_CH8_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109A18u)

/** \\brief  9A4C, TOM Channel CCU0 Compare Register */
#define GTM_TOM3_CH9_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF0109A4Cu)

/** \\brief  9A50, TOM Channel CCU1 Compare Register */
#define GTM_TOM3_CH9_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF0109A50u)

/** \\brief  9A54, TOM Channel CCU0 Counter Register */
#define GTM_TOM3_CH9_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF0109A54u)

/** \\brief  9A40, TOM Channel Control Register’ */
#define GTM_TOM3_CH9_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF0109A40u)

/** \\brief  9A60, TOM Channel Interrupt Enable Register */
#define GTM_TOM3_CH9_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF0109A60u)

/** \\brief  9A64, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM3_CH9_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF0109A64u)

/** \\brief  9A68, TOM IRQ Mode Configuration Register */
#define GTM_TOM3_CH9_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF0109A68u)

/** \\brief  9A5C, TOM Channel Interrupt Notification Register */
#define GTM_TOM3_CH9_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF0109A5Cu)

/** \\brief  9A44, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM3_CH9_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF0109A44u)

/** \\brief  9A48, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM3_CH9_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF0109A48u)

/** \\brief  9A58, TOM Channel Status Register */
#define GTM_TOM3_CH9_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF0109A58u)

/** \\brief  9834, TOM TGC0 Action Time Base Register */
#define GTM_TOM3_TGC0_ACT_TB /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_ACT_TB*)0xF0109834u)

/** \\brief  9870, TOM TGC0 Enable/Disable Control Register */
#define GTM_TOM3_TGC0_ENDIS_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_ENDIS_CTRL*)0xF0109870u)

/** \\brief  9874, TOM TGC0 Enable/Disable Status Register */
#define GTM_TOM3_TGC0_ENDIS_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_ENDIS_STAT*)0xF0109874u)

/** \\brief  9838, TOM TGC0 Force Update Control Register */
#define GTM_TOM3_TGC0_FUPD_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_FUPD_CTRL*)0xF0109838u)

/** \\brief  9830, TOM TGC0 Global Control Register */
#define GTM_TOM3_TGC0_GLB_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_GLB_CTRL*)0xF0109830u)

/** \\brief  983C, TOM TGC0 Internal Trigger Control Register */
#define GTM_TOM3_TGC0_INT_TRIG /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_INT_TRIG*)0xF010983Cu)

/** \\brief  9878, TOM TGC0 Output Enable Control Register */
#define GTM_TOM3_TGC0_OUTEN_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_OUTEN_CTRL*)0xF0109878u)

/** \\brief  987C, TOM TGC0 Output Enable Status Register */
#define GTM_TOM3_TGC0_OUTEN_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC0_OUTEN_STAT*)0xF010987Cu)

/** \\brief  9A34, TOM TGC1 Action Time Base Register */
#define GTM_TOM3_TGC1_ACT_TB /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_ACT_TB*)0xF0109A34u)

/** \\brief  9A70, TOM TGC1 Enable/Disable Control Register */
#define GTM_TOM3_TGC1_ENDIS_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_ENDIS_CTRL*)0xF0109A70u)

/** \\brief  9A74, TOM TGC1 Enable/Disable Status Register */
#define GTM_TOM3_TGC1_ENDIS_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_ENDIS_STAT*)0xF0109A74u)

/** \\brief  9A38, TOM TGC1 Force Update Control Register */
#define GTM_TOM3_TGC1_FUPD_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_FUPD_CTRL*)0xF0109A38u)

/** \\brief  9A30, TOM TGC1 Global Control Register */
#define GTM_TOM3_TGC1_GLB_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_GLB_CTRL*)0xF0109A30u)

/** \\brief  9A3C, TOM TGC1 Internal Trigger Control Register */
#define GTM_TOM3_TGC1_INT_TRIG /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_INT_TRIG*)0xF0109A3Cu)

/** \\brief  9A78, TOM TGC1 Output Enable Control Register */
#define GTM_TOM3_TGC1_OUTEN_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_OUTEN_CTRL*)0xF0109A78u)

/** \\brief  9A7C, TOM TGC1 Output Enable Status Register */
#define GTM_TOM3_TGC1_OUTEN_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_TGC1_OUTEN_STAT*)0xF0109A7Cu)

