keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  A35C, TOM Channel Interrupt Notification Register */
#define GTM_TOM4_CH13_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A35Cu)

/** \\brief  A344, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM4_CH13_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A344u)

/** \\brief  A348, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM4_CH13_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A348u)

/** \\brief  A358, TOM Channel Status Register */
#define GTM_TOM4_CH13_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A358u)

/** \\brief  A38C, TOM Channel CCU0 Compare Register */
#define GTM_TOM4_CH14_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A38Cu)

/** \\brief  A390, TOM Channel CCU1 Compare Register */
#define GTM_TOM4_CH14_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A390u)

/** \\brief  A394, TOM Channel CCU0 Counter Register */
#define GTM_TOM4_CH14_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A394u)

/** \\brief  A380, TOM Channel Control Register’ */
#define GTM_TOM4_CH14_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A380u)

/** \\brief  A3A0, TOM Channel Interrupt Enable Register */
#define GTM_TOM4_CH14_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A3A0u)

/** \\brief  A3A4, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM4_CH14_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A3A4u)

/** \\brief  A3A8, TOM IRQ Mode Configuration Register */
#define GTM_TOM4_CH14_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A3A8u)

/** \\brief  A39C, TOM Channel Interrupt Notification Register */
#define GTM_TOM4_CH14_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A39Cu)

/** \\brief  A384, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM4_CH14_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A384u)

/** \\brief  A388, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM4_CH14_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A388u)

/** \\brief  A398, TOM Channel Status Register */
#define GTM_TOM4_CH14_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A398u)

/** \\brief  A3CC, TOM Channel CCU0 Compare Register */
#define GTM_TOM4_CH15_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A3CCu)

/** \\brief  A3D0, TOM Channel CCU1 Compare Register */
#define GTM_TOM4_CH15_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A3D0u)

/** \\brief  A3D4, TOM Channel CCU0 Counter Register */
#define GTM_TOM4_CH15_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A3D4u)

/** \\brief  A3C0, TOM Channel Control Register’ */
#define GTM_TOM4_CH15_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A3C0u)

/** \\brief  A3E0, TOM Channel Interrupt Enable Register */
#define GTM_TOM4_CH15_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A3E0u)

/** \\brief  A3E4, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM4_CH15_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A3E4u)

/** \\brief  A3E8, TOM IRQ Mode Configuration Register */
#define GTM_TOM4_CH15_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A3E8u)

/** \\brief  A3DC, TOM Channel Interrupt Notification Register */
#define GTM_TOM4_CH15_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A3DCu)

/** \\brief  A3C4, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM4_CH15_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A3C4u)

/** \\brief  A3C8, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM4_CH15_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A3C8u)

/** \\brief  A3D8, TOM Channel Status Register */
#define GTM_TOM4_CH15_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A3D8u)

/** \\brief  A04C, TOM Channel CCU0 Compare Register */
#define GTM_TOM4_CH1_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A04Cu)

/** \\brief  A050, TOM Channel CCU1 Compare Register */
#define GTM_TOM4_CH1_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A050u)

/** \\brief  A054, TOM Channel CCU0 Counter Register */
#define GTM_TOM4_CH1_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A054u)

/** \\brief  A040, TOM Channel Control Register’ */
#define GTM_TOM4_CH1_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A040u)

/** \\brief  A060, TOM Channel Interrupt Enable Register */
#define GTM_TOM4_CH1_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A060u)

/** \\brief  A064, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM4_CH1_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A064u)

/** \\brief  A068, TOM IRQ Mode Configuration Register */
#define GTM_TOM4_CH1_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A068u)

/** \\brief  A05C, TOM Channel Interrupt Notification Register */
#define GTM_TOM4_CH1_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A05Cu)

/** \\brief  A044, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM4_CH1_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A044u)

/** \\brief  A048, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM4_CH1_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A048u)

/** \\brief  A058, TOM Channel Status Register */
#define GTM_TOM4_CH1_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A058u)

/** \\brief  A08C, TOM Channel CCU0 Compare Register */
#define GTM_TOM4_CH2_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A08Cu)

/** \\brief  A090, TOM Channel CCU1 Compare Register */
#define GTM_TOM4_CH2_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A090u)

