keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  A094, TOM Channel CCU0 Counter Register */
#define GTM_TOM4_CH2_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A094u)

/** \\brief  A080, TOM Channel Control Register’ */
#define GTM_TOM4_CH2_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A080u)

/** \\brief  A0A0, TOM Channel Interrupt Enable Register */
#define GTM_TOM4_CH2_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A0A0u)

/** \\brief  A0A4, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM4_CH2_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A0A4u)

/** \\brief  A0A8, TOM IRQ Mode Configuration Register */
#define GTM_TOM4_CH2_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A0A8u)

/** \\brief  A09C, TOM Channel Interrupt Notification Register */
#define GTM_TOM4_CH2_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A09Cu)

/** \\brief  A084, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM4_CH2_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A084u)

/** \\brief  A088, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM4_CH2_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A088u)

/** \\brief  A098, TOM Channel Status Register */
#define GTM_TOM4_CH2_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A098u)

/** \\brief  A0CC, TOM Channel CCU0 Compare Register */
#define GTM_TOM4_CH3_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A0CCu)

/** \\brief  A0D0, TOM Channel CCU1 Compare Register */
#define GTM_TOM4_CH3_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A0D0u)

/** \\brief  A0D4, TOM Channel CCU0 Counter Register */
#define GTM_TOM4_CH3_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A0D4u)

/** \\brief  A0C0, TOM Channel Control Register’ */
#define GTM_TOM4_CH3_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A0C0u)

/** \\brief  A0E0, TOM Channel Interrupt Enable Register */
#define GTM_TOM4_CH3_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A0E0u)

/** \\brief  A0E4, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM4_CH3_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A0E4u)

/** \\brief  A0E8, TOM IRQ Mode Configuration Register */
#define GTM_TOM4_CH3_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A0E8u)

/** \\brief  A0DC, TOM Channel Interrupt Notification Register */
#define GTM_TOM4_CH3_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A0DCu)

/** \\brief  A0C4, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM4_CH3_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A0C4u)

/** \\brief  A0C8, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM4_CH3_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A0C8u)

/** \\brief  A0D8, TOM Channel Status Register */
#define GTM_TOM4_CH3_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A0D8u)

/** \\brief  A10C, TOM Channel CCU0 Compare Register */
#define GTM_TOM4_CH4_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A10Cu)

/** \\brief  A110, TOM Channel CCU1 Compare Register */
#define GTM_TOM4_CH4_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A110u)

/** \\brief  A114, TOM Channel CCU0 Counter Register */
#define GTM_TOM4_CH4_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A114u)

/** \\brief  A100, TOM Channel Control Register’ */
#define GTM_TOM4_CH4_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A100u)

/** \\brief  A120, TOM Channel Interrupt Enable Register */
#define GTM_TOM4_CH4_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A120u)

/** \\brief  A124, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM4_CH4_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A124u)

/** \\brief  A128, TOM IRQ Mode Configuration Register */
#define GTM_TOM4_CH4_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A128u)

/** \\brief  A11C, TOM Channel Interrupt Notification Register */
#define GTM_TOM4_CH4_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A11Cu)

/** \\brief  A104, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM4_CH4_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A104u)

/** \\brief  A108, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM4_CH4_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A108u)

/** \\brief  A118, TOM Channel Status Register */
#define GTM_TOM4_CH4_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A118u)

/** \\brief  A14C, TOM Channel CCU0 Compare Register */
#define GTM_TOM4_CH5_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A14Cu)

/** \\brief  A150, TOM Channel CCU1 Compare Register */
#define GTM_TOM4_CH5_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A150u)

/** \\brief  A154, TOM Channel CCU0 Counter Register */
#define GTM_TOM4_CH5_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A154u)

/** \\brief  A140, TOM Channel Control Register’ */
#define GTM_TOM4_CH5_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A140u)

/** \\brief  A160, TOM Channel Interrupt Enable Register */
#define GTM_TOM4_CH5_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A160u)

/** \\brief  A164, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM4_CH5_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A164u)

/** \\brief  A168, TOM IRQ Mode Configuration Register */
#define GTM_TOM4_CH5_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A168u)

/** \\brief  A15C, TOM Channel Interrupt Notification Register */
#define GTM_TOM4_CH5_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A15Cu)

