keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxGtm_reg.h
/** \\brief  A144, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM4_CH5_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A144u)

/** \\brief  A148, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM4_CH5_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A148u)

/** \\brief  A158, TOM Channel Status Register */
#define GTM_TOM4_CH5_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A158u)

/** \\brief  A18C, TOM Channel CCU0 Compare Register */
#define GTM_TOM4_CH6_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A18Cu)

/** \\brief  A190, TOM Channel CCU1 Compare Register */
#define GTM_TOM4_CH6_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A190u)

/** \\brief  A194, TOM Channel CCU0 Counter Register */
#define GTM_TOM4_CH6_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A194u)

/** \\brief  A180, TOM Channel Control Register’ */
#define GTM_TOM4_CH6_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A180u)

/** \\brief  A1A0, TOM Channel Interrupt Enable Register */
#define GTM_TOM4_CH6_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A1A0u)

/** \\brief  A1A4, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM4_CH6_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A1A4u)

/** \\brief  A1A8, TOM IRQ Mode Configuration Register */
#define GTM_TOM4_CH6_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A1A8u)

/** \\brief  A19C, TOM Channel Interrupt Notification Register */
#define GTM_TOM4_CH6_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A19Cu)

/** \\brief  A184, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM4_CH6_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A184u)

/** \\brief  A188, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM4_CH6_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A188u)

/** \\brief  A198, TOM Channel Status Register */
#define GTM_TOM4_CH6_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A198u)

/** \\brief  A1CC, TOM Channel CCU0 Compare Register */
#define GTM_TOM4_CH7_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A1CCu)

/** \\brief  A1D0, TOM Channel CCU1 Compare Register */
#define GTM_TOM4_CH7_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A1D0u)

/** \\brief  A1D4, TOM Channel CCU0 Counter Register */
#define GTM_TOM4_CH7_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A1D4u)

/** \\brief  A1C0, TOM Channel Control Register’ */
#define GTM_TOM4_CH7_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A1C0u)

/** \\brief  A1E0, TOM Channel Interrupt Enable Register */
#define GTM_TOM4_CH7_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A1E0u)

/** \\brief  A1E4, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM4_CH7_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A1E4u)

/** \\brief  A1E8, TOM IRQ Mode Configuration Register */
#define GTM_TOM4_CH7_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A1E8u)

/** \\brief  A1DC, TOM Channel Interrupt Notification Register */
#define GTM_TOM4_CH7_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A1DCu)

/** \\brief  A1C4, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM4_CH7_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A1C4u)

/** \\brief  A1C8, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM4_CH7_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A1C8u)

/** \\brief  A1D8, TOM Channel Status Register */
#define GTM_TOM4_CH7_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A1D8u)

/** \\brief  A20C, TOM Channel CCU0 Compare Register */
#define GTM_TOM4_CH8_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A20Cu)

/** \\brief  A210, TOM Channel CCU1 Compare Register */
#define GTM_TOM4_CH8_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A210u)

/** \\brief  A214, TOM Channel CCU0 Counter Register */
#define GTM_TOM4_CH8_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A214u)

/** \\brief  A200, TOM Channel Control Register’ */
#define GTM_TOM4_CH8_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CTRL*)0xF010A200u)

/** \\brief  A220, TOM Channel Interrupt Enable Register */
#define GTM_TOM4_CH8_IRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_EN*)0xF010A220u)

/** \\brief  A224, TOM Channel Software Interrupt Generation Register */
#define GTM_TOM4_CH8_IRQ_FORCINT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_FORCINT*)0xF010A224u)

/** \\brief  A228, TOM IRQ Mode Configuration Register */
#define GTM_TOM4_CH8_IRQ_MODE /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_MODE*)0xF010A228u)

/** \\brief  A21C, TOM Channel Interrupt Notification Register */
#define GTM_TOM4_CH8_IRQ_NOTIFY /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_IRQ_NOTIFY*)0xF010A21Cu)

/** \\brief  A204, TOM Channel CCU0 Compare Shadow Register */
#define GTM_TOM4_CH8_SR0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR0*)0xF010A204u)

/** \\brief  A208, TOM Channel CCU1 Compare Shadow Register */
#define GTM_TOM4_CH8_SR1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_SR1*)0xF010A208u)

/** \\brief  A218, TOM Channel Status Register */
#define GTM_TOM4_CH8_STAT /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_STAT*)0xF010A218u)

/** \\brief  A24C, TOM Channel CCU0 Compare Register */
#define GTM_TOM4_CH9_CM0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM0*)0xF010A24Cu)

/** \\brief  A250, TOM Channel CCU1 Compare Register */
#define GTM_TOM4_CH9_CM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CM1*)0xF010A250u)

/** \\brief  A254, TOM Channel CCU0 Counter Register */
#define GTM_TOM4_CH9_CN0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TOM_CH_CN0*)0xF010A254u)

